askn37/multix-zinnia-sdk-modernAVR/boards.txt
menu.01_variant=Variant
menu.02_clock=Clock(Dx)
menu.03_clock=Clock(Ex/Lx)
menu.04_clock=Clock(Sx)
menu.11_BODMODE=BOD Mode
menu.12_BODLVL=BOD Level
menu.21_resetpin=FUSE PF6
menu.22_updipin=FUSE UPDI
menu.23_mvsyscfg=FUSE MVIO
menu.24_eeprom=EEPROM
menu.25_bootrow=BOOTROW
menu.26_userrow=USERROW
menu.27_fusefile=FUSE define
menu.51_buildopt=Build Option
menu.52_macroapi=Build API
menu.53_printf=Build "printf"
menu.54_console_select=UART and LED
menu.90_console_baud=Console
menu.95_bootloader=Bootloader
menu.96_usbbootloader=USB bootloader


AVRDB.name=AVR DB with Bootloader
AVRDB.build.board=AVR128DB64
AVRDB.build.core=modernAVR
AVRDA.name=AVR DA with Bootloader
AVRDA.build.board=AVR128DA64
AVRDA.build.core=modernAVR
AVRDD.name=AVR DD with Bootloader
AVRDD.build.board=AVR64DD32
AVRDD.build.core=modernAVR
AVRDU.name=AVR DU with Bootloader
AVRDU.build.board=AVR64DU32
AVRDU.build.core=modernAVR
AVREA.name=AVR EA with Bootloader
AVREA.build.board=AVR64EA32
AVREA.build.core=modernAVR
AVREB.name=AVR EB with Bootloader
AVREB.build.board=AVR32EB32
AVREB.build.core=modernAVR
AVRLA.name=AVR LA with Bootloader
AVRLA.build.board=AVR32LA32
AVRLA.build.core=modernAVR
AVRSD.name=AVR SD with Bootloader (Experimental)
AVRSD.build.board=AVR32SD32
AVRSD.build.core=modernAVR
separator1.name=-
separator1.build.board=-
AVRDU_usbloader.name=AVR DU with USB Bootloader
AVRDU_usbloader.build.board=AVR64DU32
AVRDU_usbloader.build.core=modernAVR
separator2.name=-
separator2.build.board=-
AVRDB_noloader.name=AVR DB w/o Bootloader
AVRDB_noloader.build.board=AVR128DB64
AVRDB_noloader.build.core=modernAVR
AVRDA_noloader.name=AVR DA w/o Bootloader
AVRDA_noloader.build.board=AVR128DA64
AVRDA_noloader.build.core=modernAVR
AVRDD_noloader.name=AVR DD w/o Bootloader
AVRDD_noloader.build.board=AVR64DD32
AVRDD_noloader.build.core=modernAVR
AVRDU_noloader.name=AVR DU w/o Bootloader
AVRDU_noloader.build.board=AVR64DU32
AVRDU_noloader.build.core=modernAVR
AVREA_noloader.name=AVR EA w/o Bootloader
AVREA_noloader.build.board=AVR64EA32
AVREA_noloader.build.core=modernAVR
AVREB_noloader.name=AVR EB w/o Bootloader
AVREB_noloader.build.board=AVR32EB32
AVREB_noloader.build.core=modernAVR
AVRLA_noloader.name=AVR LA w/o Bootloader
AVRLA_noloader.build.board=AVR32LA32
AVRLA_noloader.build.core=modernAVR
AVRSD_noloader.name=AVR SD w/o Bootloader
AVRSD_noloader.build.board=AVR32SD32
AVRSD_noloader.build.core=modernAVR
separator3.name=-
separator3.build.board=-
CNANO.name=Curiosity Nano evaluation kit for AVR
CNANO.build.board=AVR128DA48
CNANO.build.core=modernAVR


AVRDB.programmer.default=pickit4_updi
AVRDA.programmer.default=pickit4_updi
AVRDD.programmer.default=pickit4_updi
AVRDU.programmer.default=pickit4_updi
AVREA.programmer.default=pickit4_updi
AVREB.programmer.default=pickit4_updi
AVRLA.programmer.default=pickit4_updi
AVRSD.programmer.default=pickit4_updi
AVRDU_usbloader.programmer.default=pickit4_updi
AVRDB_noloader.programmer.default=pkobn_updi
AVRDA_noloader.programmer.default=pkobn_updi
AVRDD_noloader.programmer.default=pkobn_updi
AVRDU_noloader.programmer.default=pkobn_updi
AVREA_noloader.programmer.default=pkobn_updi
AVREB_noloader.programmer.default=pkobn_updi
AVRLA_noloader.programmer.default=pkobn_updi
AVRSD_noloader.programmer.default=pkobn_updi
CNANO.programmer.default=pkobn_updi


AVRDB.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDB.bootloader.OSCCFG=0x00
AVRDB.bootloader.PINCFG=0x00
AVRDB.bootloader.HWMONCFG=0x00
AVRDB.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}00{bootloader.eesave_bit}
AVRDB.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDB.bootloader.CODESIZE=0x00
AVRDB.bootloader.BOOTSIZE=0x01
AVRDB.bootloader.bod_lvl=000
AVRDB.bootloader.bod_mode=00
AVRDB.bootloader.bod_sample=0
AVRDB.bootloader.eepupload=
AVRDB.bootloader.browupload=
AVRDB.bootloader.urowupload=
AVRDB.bootloader.fuseupload={bootloader.fuses}
AVRDB.bootloader.eesave_bit=1
AVRDB.bootloader.mvsys_bit=01
AVRDB.bootloader.reset_bit=1
AVRDB.bootloader.updi_bit=1
AVRDB.bootloader.tool=avrdude
AVRDB.bootloader.programed_type=.with_bootloader
AVRDB.build.export_merged_output=true
AVRDB.build.text_section_start=.text=0x200
AVRDB.build.buildopt=-DNDEBUG
AVRDB.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB.build.macroapi=-DENABLE_MACRO_API
AVRDB.build.printf=
AVRDB.build.printflt=
AVRDB_noloader.build.f_cpu=24000000L
AVRDB_noloader.compiler.ldflags=
AVRDB_noloader.compiler.c.elf.extra_flags=
AVRDB.upload.protocol=arduino
AVRDB.upload.speed=115200
AVRDB.upload.tool=avrdude

AVRDB.menu.01_variant.AVR128DB64.build.board=AVR_AVR128DB64
AVRDB.menu.01_variant.AVR128DB64.build.mcu=avr128db64
AVRDB.menu.01_variant.AVR128DB64.build.variant=avr_db64
AVRDB.menu.01_variant.AVR128DB64.build.linker_script=avrxmega4_p512.x
AVRDB.menu.01_variant.AVR128DB64.upload.maximum_data_size=16384
AVRDB.menu.01_variant.AVR128DB64.upload.maximum_size=130560
AVRDB.menu.01_variant.AVR128DB64=64pin AVR128DB64 (128KiB+16KiB)

AVRDB.menu.01_variant.AVR64DB64.build.board=AVR_AVR64DB64
AVRDB.menu.01_variant.AVR64DB64.build.mcu=avr64db64
AVRDB.menu.01_variant.AVR64DB64.build.variant=avr_db64
AVRDB.menu.01_variant.AVR64DB64.build.linker_script=avrxmega2_p512.x
AVRDB.menu.01_variant.AVR64DB64.upload.maximum_data_size=8192
AVRDB.menu.01_variant.AVR64DB64.upload.maximum_size=65024
AVRDB.menu.01_variant.AVR64DB64=64pin AVR64DB64 (64KiB+8KiB)

AVRDB.menu.01_variant.separator1=-

AVRDB.menu.01_variant.AVR128DB48.build.board=AVR_AVR128DB48
AVRDB.menu.01_variant.AVR128DB48.build.mcu=avr128db48
AVRDB.menu.01_variant.AVR128DB48.build.variant=avr_db48
AVRDB.menu.01_variant.AVR128DB48.build.linker_script=avrxmega4_p512.x
AVRDB.menu.01_variant.AVR128DB48.upload.maximum_data_size=16384
AVRDB.menu.01_variant.AVR128DB48.upload.maximum_size=130560
AVRDB.menu.01_variant.AVR128DB48=48pin AVR128DB48 (128KiB+16KiB)

AVRDB.menu.01_variant.AVR64DB48.build.board=AVR_AVR64DB48
AVRDB.menu.01_variant.AVR64DB48.build.mcu=avr64db48
AVRDB.menu.01_variant.AVR64DB48.build.variant=avr_db48
AVRDB.menu.01_variant.AVR64DB48.build.linker_script=avrxmega2_p512.x
AVRDB.menu.01_variant.AVR64DB48.upload.maximum_data_size=8192
AVRDB.menu.01_variant.AVR64DB48.upload.maximum_size=65024
AVRDB.menu.01_variant.AVR64DB48=48pin AVR64DB48 (64KiB+8KiB)

AVRDB.menu.01_variant.AVR32DB48.build.board=AVR_AVR32DB48
AVRDB.menu.01_variant.AVR32DB48.build.mcu=avr32db48
AVRDB.menu.01_variant.AVR32DB48.build.variant=avr_db48
AVRDB.menu.01_variant.AVR32DB48.build.linker_script=avrxmega3_p512.x
AVRDB.menu.01_variant.AVR32DB48.upload.maximum_data_size=4096
AVRDB.menu.01_variant.AVR32DB48.upload.maximum_size=32256
AVRDB.menu.01_variant.AVR32DB48=48pin AVR32DB48 (32KiB+4KiB)

AVRDB.menu.01_variant.separator2=-

