askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDB.menu.01_variant.AVR128DB32.build.board=AVR_AVR128DB32
AVRDB.menu.01_variant.AVR128DB32.build.mcu=avr128db32
AVRDB.menu.01_variant.AVR128DB32.build.variant=avr_db32
AVRDB.menu.01_variant.AVR128DB32.build.linker_script=avrxmega4_p512.x
AVRDB.menu.01_variant.AVR128DB32.upload.maximum_data_size=16384
AVRDB.menu.01_variant.AVR128DB32.upload.maximum_size=130560
AVRDB.menu.01_variant.AVR128DB32=32pin AVR128DB32 (128KiB+16KiB)

AVRDB.menu.01_variant.AVR64DB32.build.board=AVR_AVR64DB32
AVRDB.menu.01_variant.AVR64DB32.build.mcu=avr64db32
AVRDB.menu.01_variant.AVR64DB32.build.variant=avr_db32
AVRDB.menu.01_variant.AVR64DB32.build.linker_script=avrxmega2_p512.x
AVRDB.menu.01_variant.AVR64DB32.upload.maximum_data_size=8192
AVRDB.menu.01_variant.AVR64DB32.upload.maximum_size=65024
AVRDB.menu.01_variant.AVR64DB32=32pin AVR64DB32 (64KiB+8KiB)

AVRDB.menu.01_variant.AVR32DB32.build.board=AVR_AVR32DB32
AVRDB.menu.01_variant.AVR32DB32.build.mcu=avr32db32
AVRDB.menu.01_variant.AVR32DB32.build.variant=avr_db32
AVRDB.menu.01_variant.AVR32DB32.build.linker_script=avrxmega3_p512.x
AVRDB.menu.01_variant.AVR32DB32.upload.maximum_data_size=4096
AVRDB.menu.01_variant.AVR32DB32.upload.maximum_size=32256
AVRDB.menu.01_variant.AVR32DB32=32pin AVR32DB32 (32KiB+4KiB)

AVRDB.menu.01_variant.separator3=-

AVRDB.menu.01_variant.AVR128DB28.build.board=AVR_AVR128DB28
AVRDB.menu.01_variant.AVR128DB28.build.mcu=avr128db28
AVRDB.menu.01_variant.AVR128DB28.build.variant=avr_db28
AVRDB.menu.01_variant.AVR128DB28.build.linker_script=avrxmega4_p512.x
AVRDB.menu.01_variant.AVR128DB28.upload.maximum_data_size=16384
AVRDB.menu.01_variant.AVR128DB28.upload.maximum_size=130560
AVRDB.menu.01_variant.AVR128DB28=28pin AVR128DB28 (128KiB+16KiB)

AVRDB.menu.01_variant.AVR64DB28.build.board=AVR_AVR64DB28
AVRDB.menu.01_variant.AVR64DB28.build.mcu=avr64db28
AVRDB.menu.01_variant.AVR64DB28.build.variant=avr_db28
AVRDB.menu.01_variant.AVR64DB28.build.linker_script=avrxmega2_p512.x
AVRDB.menu.01_variant.AVR64DB28.upload.maximum_data_size=8192
AVRDB.menu.01_variant.AVR64DB28.upload.maximum_size=65024
AVRDB.menu.01_variant.AVR64DB28=28pin AVR64DB28 (64KiB+8KiB)

AVRDB.menu.01_variant.AVR32DB28.build.board=AVR_AVR32DB28
AVRDB.menu.01_variant.AVR32DB28.build.mcu=avr32db28
AVRDB.menu.01_variant.AVR32DB28.build.variant=avr_db28
AVRDB.menu.01_variant.AVR32DB28.build.linker_script=avrxmega3_p512.x
AVRDB.menu.01_variant.AVR32DB28.upload.maximum_data_size=4096
AVRDB.menu.01_variant.AVR32DB28.upload.maximum_size=32256
AVRDB.menu.01_variant.AVR32DB28=28pin AVR32DB28 (32KiB+4KiB)

AVRDB.menu.02_clock.24MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.24MHz.build.f_cpu=24000000L
AVRDB.menu.02_clock.24MHz=Internal 24 MHz (default)

AVRDB.menu.02_clock.12MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.12MHz.build.f_cpu=12000000L
AVRDB.menu.02_clock.12MHz=Internal 12 MHz

AVRDB.menu.02_clock.6MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.6MHz.build.f_cpu=6000000L
AVRDB.menu.02_clock.6MHz=Internal 6 MHz

AVRDB.menu.02_clock.3MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.3MHz.build.f_cpu=3000000L
AVRDB.menu.02_clock.3MHz=Internal 3 MHz

AVRDB.menu.02_clock.separator1=-

AVRDB.menu.02_clock.20MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.20MHz.build.f_cpu=20000000L
AVRDB.menu.02_clock.20MHz=Internal 20 MHz

AVRDB.menu.02_clock.10MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.10MHz.build.f_cpu=10000000L
AVRDB.menu.02_clock.10MHz=Internal 10 MHz

AVRDB.menu.02_clock.5MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.5MHz.build.f_cpu=5000000L
AVRDB.menu.02_clock.5MHz=Internal 5 MHz

AVRDB.menu.02_clock.separator2=-

AVRDB.menu.02_clock.16MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.16MHz.build.f_cpu=16000000L
AVRDB.menu.02_clock.16MHz=Internal 16 MHz

AVRDB.menu.02_clock.8MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.8MHz.build.f_cpu=8000000L
AVRDB.menu.02_clock.8MHz=Internal 8 MHz

AVRDB.menu.02_clock.4MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.4MHz.build.f_cpu=4000000L
AVRDB.menu.02_clock.4MHz=Internal 4 MHz

AVRDB.menu.02_clock.2MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.2MHz.build.f_cpu=2000000L
AVRDB.menu.02_clock.2MHz=Internal 2 MHz

AVRDB.menu.02_clock.1MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.1MHz.build.f_cpu=1000000L
AVRDB.menu.02_clock.1MHz=Internal 1 MHz

AVRDB.menu.02_clock.separator3=-

AVRDB.menu.02_clock.32MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.32MHz.build.f_cpu=32000000L
AVRDB.menu.02_clock.32MHz=Internal 32 MHz (OVERCLOCK)

AVRDB.menu.02_clock.28MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.28MHz.build.f_cpu=28000000L
AVRDB.menu.02_clock.28MHz=Internal 28 MHz (OVERCLOCK)

AVRDB.menu.02_clock.14MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.14MHz.build.f_cpu=14000000L
AVRDB.menu.02_clock.14MHz=Internal 14 MHz (OVERCLOCK)

AVRDB.menu.02_clock.7MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.7MHz.build.f_cpu=7000000L
AVRDB.menu.02_clock.7MHz=Internal 7 MHz (OVERCLOCK)

AVRDB.menu.02_clock.separator4=-

AVRDB.menu.02_clock.32768Hz.bootloader.bod_sample=1
AVRDB.menu.02_clock.32768Hz.build.f_cpu=32768L
AVRDB.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRDB.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRDB.menu.11_BODMODE.Disabled=Disabled
# AVRDB.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRDB.menu.11_BODMODE.Enabled=Enabled
# AVRDB.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRDB.menu.11_BODMODE.Sampled=Sampled
# AVRDB.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRDB.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRDB.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDB.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDB.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDB.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDB.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDB.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDB.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDB.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRDB.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRDB.menu.21_resetpin.Reset=Reset
AVRDB.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRDB.menu.21_resetpin.Gpio=GPIO (input only)

