askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDB.menu.23_mvsyscfg.Dual.bootloader.mvsys_bit=01
AVRDB.menu.23_mvsyscfg.Dual="Dual" (default)
AVRDB.menu.23_mvsyscfg.Single.bootloader.mvsys_bit=10
AVRDB.menu.23_mvsyscfg.Single="Single"

AVRDB.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRDB.menu.24_eeprom.Retained=Save guard "Retained"
AVRDB.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRDB.menu.24_eeprom.Erase=Save guard "Erase"
AVRDB.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRDB.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRDB.menu.24_eeprom.Upload=Upload ".eep" file

AVRDB.menu.26_userrow.Retained=Save guard "Retained"
AVRDB.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRDB.menu.26_userrow.Upload=Upload ".urow" file

AVRDB.menu.51_buildopt.Release=Release (default)
AVRDB.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRDB.menu.51_buildopt.Debug1=DEBUG=1
AVRDB.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRDB.menu.51_buildopt.Debug2=DEBUG=2

AVRDB.menu.52_macroapi.Enable=Macro API Enable (default)

AVRDB.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRDB.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRDB.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRDB.menu.52_macroapi.Disable.build.macroapi=
AVRDB.menu.52_macroapi.Disable=Macro API Disable

AVRDB.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRDB.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDB.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRDB.menu.53_printf.Default=Integer Only

AVRDB.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRDB.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDB.menu.53_printf.Full=Float Support

AVRDB.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB.menu.90_console_baud.9600bps=9600 bps (default)

AVRDB.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDB.menu.90_console_baud.38400bps=38400 bps

AVRDB.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDB.menu.90_console_baud.57600bps=57600 bps

AVRDB.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDB.menu.90_console_baud.115200bps=115200 bps

AVRDB.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDB.menu.90_console_baud.230400bps=230400 bps

AVRDB.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDB.menu.90_console_baud.500000bps=500000 bps

AVRDB.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDB.menu.90_console_baud.1000000bps=1000000 bps

AVRDB.menu.90_console_baud.separator1=-

AVRDB.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDB.menu.90_console_baud.2400bps=2400 bps (for ULP)

AVRDB.menu.95_bootloader.UART0_A0_LA7.bootloader.file=hex/boot_avrdx_UART0_A0_{upload.speed}_LA7.hex
AVRDB.menu.95_bootloader.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDB.menu.95_bootloader.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRDB.menu.95_bootloader.separator1=-

AVRDB.menu.95_bootloader.UART2_F0_LA7.bootloader.file=hex/boot_avrdx_UART2_F0_{upload.speed}_LA7.hex
AVRDB.menu.95_bootloader.UART2_F0_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7
AVRDB.menu.95_bootloader.UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7

AVRDB.menu.95_bootloader.UART2_F4_LA7.bootloader.file=hex/boot_avrdx_UART2_F4_{upload.speed}_LA7.hex
AVRDB.menu.95_bootloader.UART2_F4_LA7.build.console_select=-DSerial=Serial2B -DLED_BUILTIN=PIN_PA7
AVRDB.menu.95_bootloader.UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48/64pin)

AVRDB.menu.95_bootloader.separator2=-

AVRDB.menu.95_bootloader.UART3_B0_LB3_SB2_Curiosity=UART3 TX:PB0 RX:PB1 LED=PB3 SW=PB2 (AVR128DB48 Curiosity Nano)
AVRDB.menu.95_bootloader.UART3_B0_LB3_SB2_Curiosity.bootloader.file=hex/boot_avrdx_UART3_B0_{upload.speed}_LB3.hex
AVRDB.menu.95_bootloader.UART3_B0_LB3_SB2_Curiosity.build.console_select=-DSerial=Serial3A -DLED_BUILTIN=PIN_PB3 -DSW_BUILTIN=PIN_PB2


AVRDA.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDA.bootloader.OSCCFG=0x00
AVRDA.bootloader.PINCFG=0x00
AVRDA.bootloader.HWMONCFG=0x00
AVRDA.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}00{bootloader.eesave_bit}
AVRDA.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDA.bootloader.CODESIZE=0x00
AVRDA.bootloader.BOOTSIZE=0x01
AVRDA.bootloader.bod_lvl=000
AVRDA.bootloader.bod_mode=00
AVRDA.bootloader.bod_sample=0
AVRDA.bootloader.eepupload=
AVRDA.bootloader.browupload=
AVRDA.bootloader.urowupload=
AVRDA.bootloader.fuseupload={bootloader.fuses}
AVRDA.bootloader.eesave_bit=1
AVRDA.bootloader.mvsys_bit=01
AVRDA.bootloader.reset_bit=1
AVRDA.bootloader.updi_bit=1
AVRDA.bootloader.tool=avrdude
AVRDA.bootloader.programed_type=.with_bootloader
AVRDA.build.export_merged_output=true
AVRDA.build.text_section_start=.text=0x200
AVRDA.build.buildopt=-DNDEBUG
AVRDA.build.console_baud=-DCONSOLE_BAUD=9600
AVRDA.build.macroapi=-DENABLE_MACRO_API
AVRDA.build.printf=
AVRDA.build.printflt=
AVRDA.build.f_cpu=24000000L
AVRDA.compiler.ldflags=
AVRDA.compiler.c.elf.extra_flags=
AVRDA.upload.protocol=arduino
AVRDA.upload.speed=115200
AVRDA.upload.tool=avrdude

AVRDA.menu.01_variant.AVR128DA64.build.board=AVR_AVR128DA64
AVRDA.menu.01_variant.AVR128DA64.build.mcu=avr128da64
AVRDA.menu.01_variant.AVR128DA64.build.variant=avr_da64
AVRDA.menu.01_variant.AVR128DA64.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.AVR128DA64.upload.maximum_data_size=16384
AVRDA.menu.01_variant.AVR128DA64.upload.maximum_size=130560
AVRDA.menu.01_variant.AVR128DA64=64pin AVR128DA64 (128KiB+16KiB)

AVRDA.menu.01_variant.AVR128DA64S.build.board=AVR_AVR128DA64S
AVRDA.menu.01_variant.AVR128DA64S.build.mcu=avr128da64s
AVRDA.menu.01_variant.AVR128DA64S.build.variant=avr_da64
AVRDA.menu.01_variant.AVR128DA64S.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.AVR128DA64S.upload.maximum_data_size=16384
AVRDA.menu.01_variant.AVR128DA64S.upload.maximum_size=130560
AVRDA.menu.01_variant.AVR128DA64S=64pin AVR128DA64S (128KiB+16KiB)

AVRDA.menu.01_variant.AVR64DA64.build.board=AVR_AVR64DA64
AVRDA.menu.01_variant.AVR64DA64.build.mcu=avr64da64
AVRDA.menu.01_variant.AVR64DA64.build.variant=avr_da64
AVRDA.menu.01_variant.AVR64DA64.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.AVR64DA64.upload.maximum_data_size=8192
AVRDA.menu.01_variant.AVR64DA64.upload.maximum_size=65024
AVRDA.menu.01_variant.AVR64DA64=64pin AVR64DA64 (64KiB+8KiB)

AVRDA.menu.01_variant.AVR64DA64S.build.board=AVR_AVR64DA64S
AVRDA.menu.01_variant.AVR64DA64S.build.mcu=avr64da64s
AVRDA.menu.01_variant.AVR64DA64S.build.variant=avr_da64
AVRDA.menu.01_variant.AVR64DA64S.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.AVR64DA64S.upload.maximum_data_size=8192
AVRDA.menu.01_variant.AVR64DA64S.upload.maximum_size=65024
AVRDA.menu.01_variant.AVR64DA64S=64pin AVR64DA64S (64KiB+8KiB)

AVRDA.menu.01_variant.separator=-

AVRDA.menu.01_variant.AVR128DA48.build.board=AVR_AVR128DA48
AVRDA.menu.01_variant.AVR128DA48.build.mcu=avr128da48
AVRDA.menu.01_variant.AVR128DA48.build.variant=avr_da48
AVRDA.menu.01_variant.AVR128DA48.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.AVR128DA48.upload.maximum_data_size=16384
AVRDA.menu.01_variant.AVR128DA48.upload.maximum_size=130560
AVRDA.menu.01_variant.AVR128DA48=48pin AVR128DA48 (128KiB+16KiB)

