askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDA.menu.01_variant.AVR128DA48S.build.board=AVR_AVR128DA48S
AVRDA.menu.01_variant.AVR128DA48S.build.mcu=avr128da48s
AVRDA.menu.01_variant.AVR128DA48S.build.variant=avr_da48
AVRDA.menu.01_variant.AVR128DA48S.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.AVR128DA48S.upload.maximum_data_size=16384
AVRDA.menu.01_variant.AVR128DA48S.upload.maximum_size=130560
AVRDA.menu.01_variant.AVR128DA48S=48pin AVR128DA48S (128KiB+16KiB)

AVRDA.menu.01_variant.AVR64DA48.build.board=AVR_AVR64DA48
AVRDA.menu.01_variant.AVR64DA48.build.mcu=avr64da48
AVRDA.menu.01_variant.AVR64DA48.build.variant=avr_da48
AVRDA.menu.01_variant.AVR64DA48.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.AVR64DA48.upload.maximum_data_size=8192
AVRDA.menu.01_variant.AVR64DA48.upload.maximum_size=65024
AVRDA.menu.01_variant.AVR64DA48=48pin AVR64DA48 (64KiB+8KiB)

AVRDA.menu.01_variant.AVR32DA48.build.board=AVR_AVR32DA48
AVRDA.menu.01_variant.AVR32DA48.build.mcu=avr32da48
AVRDA.menu.01_variant.AVR32DA48.build.variant=avr_da48
AVRDA.menu.01_variant.AVR32DA48.build.linker_script=avrxmega3_p512.x
AVRDA.menu.01_variant.AVR32DA48.upload.maximum_data_size=4096
AVRDA.menu.01_variant.AVR32DA48.upload.maximum_size=32256
AVRDA.menu.01_variant.AVR32DA48=48pin AVR32DA48S (32KiB+4KiB)

AVRDA.menu.01_variant.AVR32DA48S.build.board=AVR_AVR32DA48S
AVRDA.menu.01_variant.AVR32DA48S.build.mcu=avr32da48s
AVRDA.menu.01_variant.AVR32DA48S.build.variant=avr_da48
AVRDA.menu.01_variant.AVR32DA48S.build.linker_script=avrxmega3_p512.x
AVRDA.menu.01_variant.AVR32DA48S.upload.maximum_data_size=4096
AVRDA.menu.01_variant.AVR32DA48S.upload.maximum_size=32256
AVRDA.menu.01_variant.AVR32DA48S=48pin AVR32DA48 (32KiB+4KiB)

AVRDA.menu.01_variant.separator1=-

AVRDA.menu.01_variant.AVR128DA32.build.board=AVR_AVR128DA32
AVRDA.menu.01_variant.AVR128DA32.build.mcu=avr128da32
AVRDA.menu.01_variant.AVR128DA32.build.variant=avr_da32
AVRDA.menu.01_variant.AVR128DA32.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.AVR128DA32.upload.maximum_data_size=16384
AVRDA.menu.01_variant.AVR128DA32.upload.maximum_size=130560
AVRDA.menu.01_variant.AVR128DA32=32pin AVR128DA32 (128KiB+16KiB)

AVRDA.menu.01_variant.AVR128DA32S.build.board=AVR_AVR128DA32S
AVRDA.menu.01_variant.AVR128DA32S.build.mcu=avr128da32s
AVRDA.menu.01_variant.AVR128DA32S.build.variant=avr_da32
AVRDA.menu.01_variant.AVR128DA32S.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.AVR128DA32S.upload.maximum_data_size=16384
AVRDA.menu.01_variant.AVR128DA32S.upload.maximum_size=130560
AVRDA.menu.01_variant.AVR128DA32S=32pin AVR128DA32S (128KiB+16KiB)

AVRDA.menu.01_variant.AVR64DA32.build.board=AVR_AVR64DA32
AVRDA.menu.01_variant.AVR64DA32.build.mcu=avr64da32
AVRDA.menu.01_variant.AVR64DA32.build.variant=avr_da32
AVRDA.menu.01_variant.AVR64DA32.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.AVR64DA32.upload.maximum_data_size=8192
AVRDA.menu.01_variant.AVR64DA32.upload.maximum_size=65024
AVRDA.menu.01_variant.AVR64DA32=32pin AVR64DA32 (64KiB+8KiB)

AVRDA.menu.01_variant.AVR64DA32S.build.board=AVR_AVR64DA32S
AVRDA.menu.01_variant.AVR64DA32S.build.mcu=avr64da32s
AVRDA.menu.01_variant.AVR64DA32S.build.variant=avr_da32
AVRDA.menu.01_variant.AVR64DA32S.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.AVR64DA32S.upload.maximum_data_size=8192
AVRDA.menu.01_variant.AVR64DA32S.upload.maximum_size=65024
AVRDA.menu.01_variant.AVR64DA32S=32pin AVR64DA32S (64KiB+8KiB)

AVRDA.menu.01_variant.AVR32DA32.build.board=AVR_AVR32DA32
AVRDA.menu.01_variant.AVR32DA32.build.mcu=avr32da32
AVRDA.menu.01_variant.AVR32DA32.build.variant=avr_da32
AVRDA.menu.01_variant.AVR32DA32.build.linker_script=avrxmega3_p512.x
AVRDA.menu.01_variant.AVR32DA32.upload.maximum_data_size=4096
AVRDA.menu.01_variant.AVR32DA32.upload.maximum_size=32256
AVRDA.menu.01_variant.AVR32DA32=32pin AVR32DA32 (32KiB+4KiB)

AVRDA.menu.01_variant.AVR32DA32S.build.board=AVR_AVR32DA32S
AVRDA.menu.01_variant.AVR32DA32S.build.mcu=avr32da32s
AVRDA.menu.01_variant.AVR32DA32S.build.variant=avr_da32
AVRDA.menu.01_variant.AVR32DA32S.build.linker_script=avrxmega3_p512.x
AVRDA.menu.01_variant.AVR32DA32S.upload.maximum_data_size=4096
AVRDA.menu.01_variant.AVR32DA32S.upload.maximum_size=32256
AVRDA.menu.01_variant.AVR32DA32S=32pin AVR32DA32S (32KiB+4KiB)

AVRDA.menu.01_variant.separator2=-

AVRDA.menu.01_variant.AVR128DA28.build.board=AVR_AVR128DA28
AVRDA.menu.01_variant.AVR128DA28.build.mcu=avr128da28
AVRDA.menu.01_variant.AVR128DA28.build.variant=avr_da28
AVRDA.menu.01_variant.AVR128DA28.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.AVR128DA28.upload.maximum_data_size=16384
AVRDA.menu.01_variant.AVR128DA28.upload.maximum_size=130560
AVRDA.menu.01_variant.AVR128DA28=28pin AVR128DA28 (128KiB+16KiB)

AVRDA.menu.01_variant.AVR128DA28S.build.board=AVR_AVR128DA28S
AVRDA.menu.01_variant.AVR128DA28S.build.mcu=avr128da28s
AVRDA.menu.01_variant.AVR128DA28S.build.variant=avr_da28
AVRDA.menu.01_variant.AVR128DA28S.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.AVR128DA28S.upload.maximum_data_size=16384
AVRDA.menu.01_variant.AVR128DA28S.upload.maximum_size=130560
AVRDA.menu.01_variant.AVR128DA28S=28pin AVR128DA28S (128KiB+16KiB)

AVRDA.menu.01_variant.AVR64DA28.build.board=AVR_AVR64DA28
AVRDA.menu.01_variant.AVR64DA28.build.mcu=avr64da28
AVRDA.menu.01_variant.AVR64DA28.build.variant=avr_da28
AVRDA.menu.01_variant.AVR64DA28.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.AVR64DA28.upload.maximum_data_size=8192
AVRDA.menu.01_variant.AVR64DA28.upload.maximum_size=65024
AVRDA.menu.01_variant.AVR64DA28=28pin AVR64DA28 (64KiB+8KiB)

AVRDA.menu.01_variant.AVR64DA28S.build.board=AVR_AVR64DA28S
AVRDA.menu.01_variant.AVR64DA28S.build.mcu=avr64da28s
AVRDA.menu.01_variant.AVR64DA28S.build.variant=avr_da28
AVRDA.menu.01_variant.AVR64DA28S.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.AVR64DA28S.upload.maximum_data_size=8192
AVRDA.menu.01_variant.AVR64DA28S.upload.maximum_size=65024
AVRDA.menu.01_variant.AVR64DA28S=28pin AVR64DA28S (64KiB+8KiB)

