askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDA.menu.01_variant.AVR32DA28.build.board=AVR_AVR32DA28
AVRDA.menu.01_variant.AVR32DA28.build.mcu=avr32da28
AVRDA.menu.01_variant.AVR32DA28.build.variant=avr_da28
AVRDA.menu.01_variant.AVR32DA28.build.linker_script=avrxmega3_p512.x
AVRDA.menu.01_variant.AVR32DA28.upload.maximum_data_size=4096
AVRDA.menu.01_variant.AVR32DA28.upload.maximum_size=32256
AVRDA.menu.01_variant.AVR32DA28=28pin AVR32DA28 (32KiB+4KiB)

AVRDA.menu.01_variant.AVR32DA28S.build.board=AVR_AVR32DA28S
AVRDA.menu.01_variant.AVR32DA28S.build.mcu=avr32da28s
AVRDA.menu.01_variant.AVR32DA28S.build.variant=avr_da28
AVRDA.menu.01_variant.AVR32DA28S.build.linker_script=avrxmega3_p512.x
AVRDA.menu.01_variant.AVR32DA28S.upload.maximum_data_size=4096
AVRDA.menu.01_variant.AVR32DA28S.upload.maximum_size=32256
AVRDA.menu.01_variant.AVR32DA28S=28pin AVR32DA28S (32KiB+4KiB)

AVRDA.menu.02_clock.24MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.24MHz.build.f_cpu=24000000L
AVRDA.menu.02_clock.24MHz=Internal 24 MHz (default)

AVRDA.menu.02_clock.12MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.12MHz.build.f_cpu=12000000L
AVRDA.menu.02_clock.12MHz=Internal 12 MHz

AVRDA.menu.02_clock.6MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.6MHz.build.f_cpu=6000000L
AVRDA.menu.02_clock.6MHz=Internal 6 MHz

AVRDA.menu.02_clock.3MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.3MHz.build.f_cpu=3000000L
AVRDA.menu.02_clock.3MHz=Internal 3 MHz

AVRDA.menu.02_clock.separator1=-
AVRDA.menu.02_clock.20MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.20MHz.build.f_cpu=20000000L
AVRDA.menu.02_clock.20MHz=Internal 20 MHz

AVRDA.menu.02_clock.10MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.10MHz.build.f_cpu=10000000L
AVRDA.menu.02_clock.10MHz=Internal 10 MHz

AVRDA.menu.02_clock.5MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.5MHz.build.f_cpu=5000000L
AVRDA.menu.02_clock.5MHz=Internal 5 MHz

AVRDA.menu.02_clock.separator2=-
AVRDA.menu.02_clock.16MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.16MHz.build.f_cpu=16000000L
AVRDA.menu.02_clock.16MHz=Internal 16 MHz

AVRDA.menu.02_clock.8MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.8MHz.build.f_cpu=8000000L
AVRDA.menu.02_clock.8MHz=Internal 8 MHz

AVRDA.menu.02_clock.4MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.4MHz.build.f_cpu=4000000L
AVRDA.menu.02_clock.4MHz=Internal 4 MHz

AVRDA.menu.02_clock.2MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.2MHz.build.f_cpu=2000000L
AVRDA.menu.02_clock.2MHz=Internal 2 MHz

AVRDA.menu.02_clock.1MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.1MHz.build.f_cpu=1000000L
AVRDA.menu.02_clock.1MHz=Internal 1 MHz

AVRDA.menu.02_clock.separator3=-

AVRDA.menu.02_clock.32MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.32MHz.build.f_cpu=32000000L
AVRDA.menu.02_clock.32MHz=Internal 32 MHz (OVERCLOCK)

AVRDA.menu.02_clock.28MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.28MHz.build.f_cpu=28000000L
AVRDA.menu.02_clock.28MHz=Internal 28 MHz (OVERCLOCK)

AVRDA.menu.02_clock.14MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.14MHz.build.f_cpu=14000000L
AVRDA.menu.02_clock.14MHz=Internal 14 MHz (OVERCLOCK)

AVRDA.menu.02_clock.7MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.7MHz.build.f_cpu=7000000L
AVRDA.menu.02_clock.7MHz=Internal 7 MHz (OVERCLOCK)

AVRDA.menu.02_clock.separator4=-

AVRDA.menu.02_clock.32768Hz.bootloader.bod_sample=1
AVRDA.menu.02_clock.32768Hz.build.f_cpu=32768L
AVRDA.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRDA.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRDA.menu.11_BODMODE.Disabled=Disabled
# AVRDA.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRDA.menu.11_BODMODE.Enabled=Enabled
# AVRDA.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRDA.menu.11_BODMODE.Sampled=Sampled
# AVRDA.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRDA.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRDA.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDA.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDA.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDA.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDA.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDA.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDA.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDA.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRDA.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRDA.menu.21_resetpin.Reset=Reset

AVRDA.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRDA.menu.21_resetpin.Gpio=GPIO (input only)

AVRDA.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRDA.menu.24_eeprom.Retained=Save guard "Retained"

AVRDA.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRDA.menu.24_eeprom.Erase=Save guard "Erase"

AVRDA.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRDA.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRDA.menu.24_eeprom.Upload=Upload ".eep" file

AVRDA.menu.26_userrow.Retained=Save guard "Retained"

AVRDA.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRDA.menu.26_userrow.Upload=Upload ".urow" file

AVRDA.menu.51_buildopt.Release=Release (default)

AVRDA.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRDA.menu.51_buildopt.Debug1=DEBUG=1

AVRDA.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRDA.menu.51_buildopt.Debug2=DEBUG=2

AVRDA.menu.52_macroapi.Enable=Macro API Enable (default)

AVRDA.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRDA.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRDA.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRDA.menu.52_macroapi.Disable.build.macroapi=

AVRDA.menu.52_macroapi.Disable=Macro API Disable

AVRDA.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRDA.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDA.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRDA.menu.53_printf.Default=Integer Only

AVRDA.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRDA.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDA.menu.53_printf.Full=Float Support

AVRDA.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDA.menu.90_console_baud.9600bps=9600 bps (default)

AVRDA.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDA.menu.90_console_baud.38400bps=38400 bps

