askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDA.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDA.menu.90_console_baud.57600bps=57600 bps

AVRDA.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDA.menu.90_console_baud.115200bps=115200 bps

AVRDA.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDA.menu.90_console_baud.230400bps=230400 bps

AVRDA.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDA.menu.90_console_baud.500000bps=500000 bps

AVRDA.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDA.menu.90_console_baud.1000000bps=1000000 bps

AVRDA.menu.90_console_baud.separator1=-

AVRDA.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDA.menu.90_console_baud.2400bps=2400 bps (for ULP)

AVRDA.menu.95_bootloader.UART0_A0_LA7.bootloader.file=hex/boot_avrdx_UART0_A0_{upload.speed}_LA7.hex
AVRDA.menu.95_bootloader.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDA.menu.95_bootloader.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRDA.menu.95_bootloader.separator1=-

AVRDA.menu.95_bootloader.UART2_F0_LA7.bootloader.file=hex/boot_avrdx_UART2_F0_{upload.speed}_LA7.hex
AVRDA.menu.95_bootloader.UART2_F0_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7
AVRDA.menu.95_bootloader.UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7

AVRDA.menu.95_bootloader.UART2_F4_LA7.bootloader.file=hex/boot_avrdx_UART2_F4_{upload.speed}_LA7.hex
AVRDA.menu.95_bootloader.UART2_F4_LA7.build.console_select=-DSerial=Serial2B -DLED_BUILTIN=PIN_PA7
AVRDA.menu.95_bootloader.UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48/64pin)

AVRDA.menu.95_bootloader.separator2=-

AVRDA.menu.95_bootloader.UART1_C0_LC6_SC7_Curiosity=UART1 TX:PC0 RX:PC1 LED=PC6 SW=PC7 (AVR128DA48 Curiosity Nano)
AVRDA.menu.95_bootloader.UART1_C0_LC6_SC7_Curiosity.bootloader.file=hex/boot_avrdx_UART1_C0_{upload.speed}_LC6.hex
AVRDA.menu.95_bootloader.UART1_C0_LC6_SC7_Curiosity.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PC6 -DSW_BUILTIN=PIN_PC7


AVRDD.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDD.bootloader.OSCCFG=0x00
AVRDD.bootloader.PINCFG=0x00
AVRDD.bootloader.HWMONCFG=0x00
AVRDD.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}00{bootloader.eesave_bit}
AVRDD.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDD.bootloader.CODESIZE=0x00
AVRDD.bootloader.BOOTSIZE=0x01
AVRDD.bootloader.bod_lvl=000
AVRDD.bootloader.bod_mode=00
AVRDD.bootloader.bod_sample=0
AVRDD.bootloader.eepupload=
AVRDD.bootloader.browupload=
AVRDD.bootloader.urowupload=
AVRDD.bootloader.fuseupload={bootloader.fuses}
AVRDD.bootloader.eesave_bit=1
AVRDD.bootloader.mvsys_bit=01
AVRDD.bootloader.reset_bit=1
AVRDD.bootloader.updi_bit=1
AVRDD.bootloader.tool=avrdude
AVRDD.bootloader.programed_type=.with_bootloader
AVRDD.build.export_merged_output=true
AVRDD.build.text_section_start=.text=0x200
AVRDD.build.buildopt=-DNDEBUG
AVRDD.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD.build.macroapi=-DENABLE_MACRO_API
AVRDD.build.printf=
AVRDD.build.printflt=
AVRDD.build.f_cpu=24000000L
AVRDD.compiler.ldflags=
AVRDD.compiler.c.elf.extra_flags=
AVRDD.upload.protocol=arduino
AVRDD.upload.speed=115200
AVRDD.upload.tool=avrdude

AVRDD.menu.01_variant.AVR64DD32.build.board=AVR_AVR64DD32
AVRDD.menu.01_variant.AVR64DD32.build.mcu=avr64dd32
AVRDD.menu.01_variant.AVR64DD32.build.variant=avr_dd32
AVRDD.menu.01_variant.AVR64DD32.build.linker_script=avrxmega2_p512.x
AVRDD.menu.01_variant.AVR64DD32.upload.maximum_data_size=8192
AVRDD.menu.01_variant.AVR64DD32.upload.maximum_size=65024
AVRDD.menu.01_variant.AVR64DD32=32pin AVR64DD32 (64KiB+8KiB)

AVRDD.menu.01_variant.AVR32DD32.build.board=AVR_AVR32DD32
AVRDD.menu.01_variant.AVR32DD32.build.mcu=avr32dd32
AVRDD.menu.01_variant.AVR32DD32.build.variant=avr_dd32
AVRDD.menu.01_variant.AVR32DD32.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.AVR32DD32.upload.maximum_data_size=4096
AVRDD.menu.01_variant.AVR32DD32.upload.maximum_size=32256
AVRDD.menu.01_variant.AVR32DD32=32pin AVR32DD32 (32KiB+4KiB)

AVRDD.menu.01_variant.AVR16DD32.build.board=AVR_AVR16DD32
AVRDD.menu.01_variant.AVR16DD32.build.mcu=avr16dd32
AVRDD.menu.01_variant.AVR16DD32.build.variant=avr_dd32
AVRDD.menu.01_variant.AVR16DD32.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.AVR16DD32.upload.maximum_data_size=2048
AVRDD.menu.01_variant.AVR16DD32.upload.maximum_size=15872
AVRDD.menu.01_variant.AVR16DD32=32pin AVR16DD32 (16KiB+2KiB)

AVRDD.menu.01_variant.separator1=-

AVRDD.menu.01_variant.AVR64DD28.build.board=AVR_AVR64DD28
AVRDD.menu.01_variant.AVR64DD28.build.mcu=avr64dd28
AVRDD.menu.01_variant.AVR64DD28.build.variant=avr_dd28
AVRDD.menu.01_variant.AVR64DD28.build.linker_script=avrxmega2_p512.x
AVRDD.menu.01_variant.AVR64DD28.upload.maximum_data_size=8192
AVRDD.menu.01_variant.AVR64DD28.upload.maximum_size=65024
AVRDD.menu.01_variant.AVR64DD28=28pin AVR64DD28 (64KiB+8KiB)

AVRDD.menu.01_variant.AVR32DD28.build.board=AVR_AVR32DD28
AVRDD.menu.01_variant.AVR32DD28.build.mcu=avr32dd28
AVRDD.menu.01_variant.AVR32DD28.build.variant=avr_dd28
AVRDD.menu.01_variant.AVR32DD28.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.AVR32DD28.upload.maximum_data_size=4096
AVRDD.menu.01_variant.AVR32DD28.upload.maximum_size=32256
AVRDD.menu.01_variant.AVR32DD28=28pin AVR32DD28 (32KiB+4KiB)

AVRDD.menu.01_variant.AVR16DD28.build.board=AVR_AVR16DD28
AVRDD.menu.01_variant.AVR16DD28.build.mcu=avr16dd28
AVRDD.menu.01_variant.AVR16DD28.build.variant=avr_dd28
AVRDD.menu.01_variant.AVR16DD28.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.AVR16DD28.upload.maximum_data_size=2048
AVRDD.menu.01_variant.AVR16DD28.upload.maximum_size=15872
AVRDD.menu.01_variant.AVR16DD28=28pin AVR16DD28 (16KiB+2KiB)

AVRDD.menu.01_variant.separator2=-

AVRDD.menu.01_variant.AVR64DD20.build.board=AVR_AVR64DD20
AVRDD.menu.01_variant.AVR64DD20.build.mcu=avr64dd20
AVRDD.menu.01_variant.AVR64DD20.build.variant=avr_dd20
AVRDD.menu.01_variant.AVR64DD20.build.linker_script=avrxmega2_p512.x
AVRDD.menu.01_variant.AVR64DD20.upload.maximum_data_size=8192
AVRDD.menu.01_variant.AVR64DD20.upload.maximum_size=65024
AVRDD.menu.01_variant.AVR64DD20=20pin AVR64DD20 (64KiB+8KiB)

AVRDD.menu.01_variant.AVR32DD20.build.board=AVR_AVR32DD20
AVRDD.menu.01_variant.AVR32DD20.build.mcu=avr32dd20
AVRDD.menu.01_variant.AVR32DD20.build.variant=avr_dd20
AVRDD.menu.01_variant.AVR32DD20.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.AVR32DD20.upload.maximum_data_size=4096
AVRDD.menu.01_variant.AVR32DD20.upload.maximum_size=32256
AVRDD.menu.01_variant.AVR32DD20=20pin AVR32DD20 (32KiB+4KiB)

