askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDD.menu.01_variant.AVR16DD20.build.board=AVR_AVR16DD20
AVRDD.menu.01_variant.AVR16DD20.build.mcu=avr16dd20
AVRDD.menu.01_variant.AVR16DD20.build.variant=avr_dd20
AVRDD.menu.01_variant.AVR16DD20.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.AVR16DD20.upload.maximum_data_size=2048
AVRDD.menu.01_variant.AVR16DD20.upload.maximum_size=15872
AVRDD.menu.01_variant.AVR16DD20=20pin AVR16DD20 (16KiB+2KiB)

AVRDD.menu.01_variant.separator3=-

AVRDD.menu.01_variant.AVR64DD14.build.board=AVR_AVR64DD14
AVRDD.menu.01_variant.AVR64DD14.build.mcu=avr64dd14
AVRDD.menu.01_variant.AVR64DD14.build.variant=avr_dd14
AVRDD.menu.01_variant.AVR64DD14.build.linker_script=avrxmega2_p512.x
AVRDD.menu.01_variant.AVR64DD14.upload.maximum_data_size=8192
AVRDD.menu.01_variant.AVR64DD14.upload.maximum_size=65024
AVRDD.menu.01_variant.AVR64DD14=14pin AVR64DD14 (64KiB+8KiB)

AVRDD.menu.01_variant.AVR32DD14.build.board=AVR_AVR32DD14
AVRDD.menu.01_variant.AVR32DD14.build.mcu=avr32dd14
AVRDD.menu.01_variant.AVR32DD14.build.variant=avr_dd14
AVRDD.menu.01_variant.AVR32DD14.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.AVR32DD14.upload.maximum_data_size=4096
AVRDD.menu.01_variant.AVR32DD14.upload.maximum_size=32256
AVRDD.menu.01_variant.AVR32DD14=14pin AVR32DD14 (32KiB+4KiB)

AVRDD.menu.01_variant.AVR16DD14.build.board=AVR_AVR16DD14
AVRDD.menu.01_variant.AVR16DD14.build.mcu=avr16dd14
AVRDD.menu.01_variant.AVR16DD14.build.variant=avr_dd14
AVRDD.menu.01_variant.AVR16DD14.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.AVR16DD14.upload.maximum_data_size=2048
AVRDD.menu.01_variant.AVR16DD14.upload.maximum_size=15872
AVRDD.menu.01_variant.AVR16DD14=14pin AVR16DD14 (16KiB+2KiB)

AVRDD.menu.02_clock.24MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.24MHz.build.f_cpu=24000000L
AVRDD.menu.02_clock.24MHz=Internal 24 MHz (default)

AVRDD.menu.02_clock.12MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.12MHz.build.f_cpu=12000000L
AVRDD.menu.02_clock.12MHz=Internal 12 MHz

AVRDD.menu.02_clock.6MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.6MHz.build.f_cpu=6000000L
AVRDD.menu.02_clock.6MHz=Internal 6 MHz

AVRDD.menu.02_clock.3MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.3MHz.build.f_cpu=3000000L
AVRDD.menu.02_clock.3MHz=Internal 3 MHz

AVRDD.menu.02_clock.separator1=-

AVRDD.menu.02_clock.20MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.20MHz.build.f_cpu=20000000L
AVRDD.menu.02_clock.20MHz=Internal 20 MHz

AVRDD.menu.02_clock.10MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.10MHz.build.f_cpu=10000000L
AVRDD.menu.02_clock.10MHz=Internal 10 MHz

AVRDD.menu.02_clock.5MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.5MHz.build.f_cpu=5000000L
AVRDD.menu.02_clock.5MHz=Internal 5 MHz

AVRDD.menu.02_clock.separator2=-
AVRDD.menu.02_clock.16MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.16MHz.build.f_cpu=16000000L
AVRDD.menu.02_clock.16MHz=Internal 16 MHz

AVRDD.menu.02_clock.8MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.8MHz.build.f_cpu=8000000L
AVRDD.menu.02_clock.8MHz=Internal 8 MHz

AVRDD.menu.02_clock.4MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.4MHz.build.f_cpu=4000000L
AVRDD.menu.02_clock.4MHz=Internal 4 MHz

AVRDD.menu.02_clock.2MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.2MHz.build.f_cpu=2000000L
AVRDD.menu.02_clock.2MHz=Internal 2 MHz

AVRDD.menu.02_clock.1MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.1MHz.build.f_cpu=1000000L
AVRDD.menu.02_clock.1MHz=Internal 1 MHz

AVRDD.menu.02_clock.separator3=-

AVRDD.menu.02_clock.32MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.32MHz.build.f_cpu=32000000L
AVRDD.menu.02_clock.32MHz=Internal 32 MHz (OVERCLOCK)

AVRDD.menu.02_clock.28MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.28MHz.build.f_cpu=28000000L
AVRDD.menu.02_clock.28MHz=Internal 28 MHz (OVERCLOCK)

AVRDD.menu.02_clock.14MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.14MHz.build.f_cpu=14000000L
AVRDD.menu.02_clock.14MHz=Internal 14 MHz (OVERCLOCK)

AVRDD.menu.02_clock.7MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.7MHz.build.f_cpu=7000000L
AVRDD.menu.02_clock.7MHz=Internal 7 MHz (OVERCLOCK)

AVRDD.menu.02_clock.separator4=-

AVRDD.menu.02_clock.32768Hz.bootloader.bod_sample=1
AVRDD.menu.02_clock.32768Hz.build.f_cpu=32768L
AVRDD.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRDD.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRDD.menu.11_BODMODE.Disabled=Disabled
# AVRDD.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRDD.menu.11_BODMODE.Enabled=Enabled
# AVRDD.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRDD.menu.11_BODMODE.Sampled=Sampled
# AVRDD.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRDD.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRDD.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDD.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDD.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDD.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDD.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDD.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDD.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDD.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRDD.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRDD.menu.21_resetpin.Reset=Reset

AVRDD.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRDD.menu.21_resetpin.Gpio=GPIO (input only)

# AVRDD.menu.22_updipin.Updi.bootloader.updi_bit=1
# AVRDD.menu.22_updipin.Updi=PF7 pin=UPDI (default)

# AVRDD.menu.22_updipin.Gpio.bootloader.updi_bit=0
# AVRDD.menu.22_updipin.Gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)

AVRDD.menu.23_mvsyscfg.Dual.bootloader.mvsys_bit=01
AVRDD.menu.23_mvsyscfg.Dual="Dual" (default)

AVRDD.menu.23_mvsyscfg.Single.bootloader.mvsys_bit=10
AVRDD.menu.23_mvsyscfg.Single="Single"

AVRDD.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRDD.menu.24_eeprom.Retained=Save guard "Retained"

AVRDD.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRDD.menu.24_eeprom.Erase=Save guard "Erase"

AVRDD.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRDD.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRDD.menu.24_eeprom.Upload=Upload ".eep" file

AVRDD.menu.26_userrow.Retained=Save guard "Retained"

AVRDD.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRDD.menu.26_userrow.Upload=Upload ".urow" file

