askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDD.menu.51_buildopt.Release=Release (default)

AVRDD.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRDD.menu.51_buildopt.Debug1=DEBUG=1

AVRDD.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRDD.menu.51_buildopt.Debug2=DEBUG=2

AVRDD.menu.52_macroapi.Enable=Macro API Enable (default)

AVRDD.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRDD.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRDD.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRDD.menu.52_macroapi.Disable.build.macroapi=
AVRDD.menu.52_macroapi.Disable=Macro API Disable

AVRDD.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRDD.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDD.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRDD.menu.53_printf.Default=Integer Only

AVRDD.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRDD.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDD.menu.53_printf.Full=Float Support

AVRDD.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD.menu.90_console_baud.9600bps=9600 bps (default)

AVRDD.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDD.menu.90_console_baud.38400bps=38400 bps

AVRDD.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDD.menu.90_console_baud.57600bps=57600 bps

AVRDD.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDD.menu.90_console_baud.115200bps=115200 bps

AVRDD.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDD.menu.90_console_baud.230400bps=230400 bps

AVRDD.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDD.menu.90_console_baud.500000bps=500000 bps

AVRDD.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDD.menu.90_console_baud.1000000bps=1000000 bps

AVRDD.menu.90_console_baud.separator1=-

AVRDD.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDD.menu.90_console_baud.2400bps=2400 bps (for ULP)

AVRDD.menu.95_bootloader.UART0_A0_LA7.bootloader.file=hex/boot_avrdd_UART0_A0_{upload.speed}_LA7.hex
AVRDD.menu.95_bootloader.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDD.menu.95_bootloader.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRDD.menu.95_bootloader.separator=-

AVRDD.menu.95_bootloader.UART0_D4_LC3.bootloader.file=hex/boot_avrdd_UART0_D4_{upload.speed}_LC3.hex
AVRDD.menu.95_bootloader.UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVRDD.menu.95_bootloader.UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3 (14pin)

AVRDD.menu.95_bootloader.UART1_D6_LC3.bootloader.file=hex/boot_avrdd_UART1_D6_{upload.speed}_LC3.hex
AVRDD.menu.95_bootloader.UART1_D6_LC3.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PC3
AVRDD.menu.95_bootloader.UART1_D6_LC3=UART1 TX:PD6 RX:PD7 LED=PC3 (14pin)

AVRDD.menu.95_bootloader.separator1=-

AVRDD.menu.95_bootloader.UART0_D4_LF5_SF6_Curiosity=UART0 TX:PD4 RX:PD5 LED=PF5 SW=PF6 (AVR64DD32 Curiosity Nano)
AVRDD.menu.95_bootloader.UART0_D4_LF5_SF6_Curiosity.bootloader.file=hex/boot_avrdd_UART0_D4_{upload.speed}_LF5.hex
AVRDD.menu.95_bootloader.UART0_D4_LF5_SF6_Curiosity.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6


AVRDU.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDU.bootloader.OSCCFG=0x00
AVRDU.bootloader.PINCFG=0x00
AVRDU.bootloader.HWMONCFG=0x00
AVRDU.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRDU.bootloader.SYSCFG1=0b000{bootloader.usbsink_bit}000
AVRDU.bootloader.CODESIZE=0x00
AVRDU.bootloader.BOOTSIZE=0x01
AVRDU.bootloader.bod_lvl=000
AVRDU.bootloader.bod_mode=00
AVRDU.bootloader.bod_sample=0
AVRDU.bootloader.eepupload=
AVRDU.bootloader.browupload=
AVRDU.bootloader.urowupload=
AVRDU.bootloader.fuseupload={bootloader.fuses}
AVRDU.bootloader.eesave_bit=1
AVRDU.bootloader.browsave_bit=1
AVRDU.bootloader.usbsink_bit=01
AVRDU.bootloader.reset_bit=1
AVRDU.bootloader.updi_bit=1
AVRDU.bootloader.tool=avrdude
AVRDU.bootloader.programed_type=.with_bootloader
AVRDU.build.export_merged_output=true
AVRDU.build.text_section_start=.text=0x200
AVRDU.build.buildopt=-DNDEBUG
AVRDU.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU.build.macroapi=-DENABLE_MACRO_API
AVRDU.build.printf=
AVRDU.build.printflt=
AVRDU.build.f_cpu=20000000L
AVRDU.compiler.ldflags=
AVRDU.compiler.c.elf.extra_flags=
AVRDU.upload.protocol=arduino
AVRDU.upload.speed=115200
AVRDU.upload.tool=avrdude

AVRDU.menu.01_variant.AVR64DU32.build.board=AVR_AVR64DU32
AVRDU.menu.01_variant.AVR64DU32.build.mcu=avr64du32
AVRDU.menu.01_variant.AVR64DU32.build.variant=avr_du32
AVRDU.menu.01_variant.AVR64DU32.build.linker_script=avrxmega2_p512.x
AVRDU.menu.01_variant.AVR64DU32.upload.maximum_data_size=8192
AVRDU.menu.01_variant.AVR64DU32.upload.maximum_size=65024
AVRDU.menu.01_variant.AVR64DU32=32pin AVR64DU32 (64KiB+8KiB)
AVRDU.menu.01_variant.AVR32DU32.build.board=AVR_AVR32DU32

AVRDU.menu.01_variant.AVR32DU32.build.mcu=avr32du32
AVRDU.menu.01_variant.AVR32DU32.build.variant=avr_du32
AVRDU.menu.01_variant.AVR32DU32.build.linker_script=avrxmega3_p512.x
AVRDU.menu.01_variant.AVR32DU32.upload.maximum_data_size=4096
AVRDU.menu.01_variant.AVR32DU32.upload.maximum_size=32256
AVRDU.menu.01_variant.AVR32DU32=32pin AVR32DU32 (32KiB+4KiB)

AVRDU.menu.01_variant.AVR16DU32.build.board=AVR_AVR16DU32
AVRDU.menu.01_variant.AVR16DU32.build.mcu=avr16du32
AVRDU.menu.01_variant.AVR16DU32.build.variant=avr_du32
AVRDU.menu.01_variant.AVR16DU32.build.linker_script=avrxmega3_p512.x
AVRDU.menu.01_variant.AVR16DU32.upload.maximum_data_size=2048
AVRDU.menu.01_variant.AVR16DU32.upload.maximum_size=15872
AVRDU.menu.01_variant.AVR16DU32=32pin AVR16DU32 (16KiB+2KiB)

AVRDU.menu.01_variant.separator1=-

AVRDU.menu.01_variant.AVR64DU28.build.board=AVR_AVR64DU28
AVRDU.menu.01_variant.AVR64DU28.build.mcu=avr64du28
AVRDU.menu.01_variant.AVR64DU28.build.variant=avr_du28
AVRDU.menu.01_variant.AVR64DU28.build.linker_script=avrxmega2_p512.x
AVRDU.menu.01_variant.AVR64DU28.upload.maximum_data_size=8192
AVRDU.menu.01_variant.AVR64DU28.upload.maximum_size=65024
AVRDU.menu.01_variant.AVR64DU28=28pin AVR64DU28 (64KiB+8KiB)

AVRDU.menu.01_variant.AVR32DU28.build.board=AVR_AVR32DU28
AVRDU.menu.01_variant.AVR32DU28.build.mcu=avr32du28
AVRDU.menu.01_variant.AVR32DU28.build.variant=avr_du28
AVRDU.menu.01_variant.AVR32DU28.build.linker_script=avrxmega3_p512.x
AVRDU.menu.01_variant.AVR32DU28.upload.maximum_data_size=4096
AVRDU.menu.01_variant.AVR32DU28.upload.maximum_size=32256
AVRDU.menu.01_variant.AVR32DU28=28pin AVR32DU28 (32KiB+4KiB)

AVRDU.menu.01_variant.AVR16DU28.build.board=AVR_AVR16DU28
AVRDU.menu.01_variant.AVR16DU28.build.mcu=avr16du28
AVRDU.menu.01_variant.AVR16DU28.build.variant=avr_du28
AVRDU.menu.01_variant.AVR16DU28.build.linker_script=avrxmega3_p512.x
AVRDU.menu.01_variant.AVR16DU28.upload.maximum_data_size=2048
AVRDU.menu.01_variant.AVR16DU28.upload.maximum_size=15872
AVRDU.menu.01_variant.AVR16DU28=28pin AVR16DU28 (16KiB+2KiB)

AVRDU.menu.01_variant.separator2=-

AVRDU.menu.01_variant.AVR32DU20.build.board=AVR_AVR32DU20
AVRDU.menu.01_variant.AVR32DU20.build.mcu=avr32dU20
AVRDU.menu.01_variant.AVR32DU20.build.variant=avr_dU20
AVRDU.menu.01_variant.AVR32DU20.build.linker_script=avrxmega3_p512.x
AVRDU.menu.01_variant.AVR32DU20.upload.maximum_data_size=4096
AVRDU.menu.01_variant.AVR32DU20.upload.maximum_size=32256
AVRDU.menu.01_variant.AVR32DU20=20pin AVR32DU20 (32KiB+4KiB)

AVRDU.menu.01_variant.AVR16DU20.build.board=AVR_AVR16DU20
AVRDU.menu.01_variant.AVR16DU20.build.mcu=avr16du20
AVRDU.menu.01_variant.AVR16DU20.build.variant=avr_du20
AVRDU.menu.01_variant.AVR16DU20.build.linker_script=avrxmega3_p512.x
AVRDU.menu.01_variant.AVR16DU20.upload.maximum_data_size=2048
AVRDU.menu.01_variant.AVR16DU20.upload.maximum_size=15872
AVRDU.menu.01_variant.AVR16DU20=20pin AVR16DU20 (16KiB+2KiB)

