askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDU.menu.01_variant.separator3=-

AVRDU.menu.01_variant.AVR32DU14.build.board=AVR_AVR32DU14
AVRDU.menu.01_variant.AVR32DU14.build.mcu=avr32du14
AVRDU.menu.01_variant.AVR32DU14.build.variant=avr_du14
AVRDU.menu.01_variant.AVR32DU14.build.linker_script=avrxmega3_p512.x
AVRDU.menu.01_variant.AVR32DU14.upload.maximum_data_size=4096
AVRDU.menu.01_variant.AVR32DU14.upload.maximum_size=32256
AVRDU.menu.01_variant.AVR32DU14=14pin AVR32DU14 (32KiB+4KiB)

AVRDU.menu.01_variant.AVR16DU14.build.board=AVR_AVR16DU14
AVRDU.menu.01_variant.AVR16DU14.build.mcu=avr16du14
AVRDU.menu.01_variant.AVR16DU14.build.variant=avr_du14
AVRDU.menu.01_variant.AVR16DU14.build.linker_script=avrxmega3_p512.x
AVRDU.menu.01_variant.AVR16DU14.upload.maximum_data_size=2048
AVRDU.menu.01_variant.AVR16DU14.upload.maximum_size=15872
AVRDU.menu.01_variant.AVR16DU14=14pin AVR16DU14 (16KiB+2KiB)

AVRDU.menu.02_clock.20MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.20MHz.build.f_cpu=20000000L
AVRDU.menu.02_clock.20MHz=Internal 20 MHz (recommend)

AVRDU.menu.02_clock.10MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.10MHz.build.f_cpu=10000000L
AVRDU.menu.02_clock.10MHz=Internal 10 MHz

AVRDU.menu.02_clock.5MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.5MHz.build.f_cpu=5000000L
AVRDU.menu.02_clock.5MHz=Internal 5 MHz

AVRDU.menu.02_clock.separator1=-

AVRDU.menu.02_clock.24MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.24MHz.build.f_cpu=24000000L
AVRDU.menu.02_clock.24MHz=Internal 24 MHz (default)

AVRDU.menu.02_clock.12MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.12MHz.build.f_cpu=12000000L
AVRDU.menu.02_clock.12MHz=Internal 12 MHz (The lowest limit for using USB peripherals)

AVRDU.menu.02_clock.6MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.6MHz.build.f_cpu=6000000L
AVRDU.menu.02_clock.6MHz=Internal 6 MHz

AVRDU.menu.02_clock.3MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.3MHz.build.f_cpu=3000000L
AVRDU.menu.02_clock.3MHz=Internal 3 MHz

AVRDU.menu.02_clock.separator2=-

AVRDU.menu.02_clock.16MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.16MHz.build.f_cpu=16000000L
AVRDU.menu.02_clock.16MHz=Internal 16 MHz

AVRDU.menu.02_clock.8MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.8MHz.build.f_cpu=8000000L
AVRDU.menu.02_clock.8MHz=Internal 8 MHz

AVRDU.menu.02_clock.4MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.4MHz.build.f_cpu=4000000L
AVRDU.menu.02_clock.4MHz=Internal 4 MHz

AVRDU.menu.02_clock.2MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.2MHz.build.f_cpu=2000000L
AVRDU.menu.02_clock.2MHz=Internal 2 MHz

AVRDU.menu.02_clock.1MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.1MHz.build.f_cpu=1000000L
AVRDU.menu.02_clock.1MHz=Internal 1 MHz

# AVRDU.menu.02_clock.separator3=-

# AVRDU.menu.02_clock.32MHz.bootloader.bod_sample=0
# AVRDU.menu.02_clock.32MHz.build.f_cpu=32000000L
# AVRDU.menu.02_clock.32MHz=Internal 32 MHz (OVERCLOCK)

# AVRDU.menu.02_clock.28MHz.bootloader.bod_sample=0
# AVRDU.menu.02_clock.28MHz.build.f_cpu=28000000L
# AVRDU.menu.02_clock.28MHz=Internal 28 MHz (OVERCLOCK)

# AVRDU.menu.02_clock.14MHz.bootloader.bod_sample=0
# AVRDU.menu.02_clock.14MHz.build.f_cpu=14000000L
# AVRDU.menu.02_clock.14MHz=Internal 14 MHz (OVERCLOCK)

# AVRDU.menu.02_clock.7MHz.bootloader.bod_sample=0
# AVRDU.menu.02_clock.7MHz.build.f_cpu=7000000L
# AVRDU.menu.02_clock.7MHz=Internal 7 MHz (OVERCLOCK)

AVRDU.menu.02_clock.separator4=-

AVRDU.menu.02_clock.32768Hz.bootloader.bod_sample=1
AVRDU.menu.02_clock.32768Hz.build.f_cpu=32768L
AVRDU.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRDU.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRDU.menu.11_BODMODE.Disabled=Disabled

# AVRDU.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRDU.menu.11_BODMODE.Enabled=Enabled

# AVRDU.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRDU.menu.11_BODMODE.Sampled=Sampled

# AVRDU.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRDU.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRDU.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDU.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDU.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDU.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDU.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDU.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDU.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDU.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRDU.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRDU.menu.21_resetpin.Reset=Reset

AVRDU.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRDU.menu.21_resetpin.Gpio=GPIO (input only)

# AVRDU.menu.22_updipin.Updi.bootloader.updi_bit=1
# AVRDU.menu.22_updipin.Updi=PF7 pin=UPDI (default)

# AVRDU.menu.22_updipin.Gpio.bootloader.updi_bit=0
# AVRDU.menu.22_updipin.Gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)

AVRDU.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRDU.menu.24_eeprom.Retained=Save guard "Retained"

AVRDU.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRDU.menu.24_eeprom.Erase=Save guard "Erase"

AVRDU.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRDU.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRDU.menu.24_eeprom.Upload=Upload ".eep" file

AVRDU.menu.25_bootrow.Retained.bootloader.browsave_bit=1
AVRDU.menu.25_bootrow.Retained=Save guard "Retained"

AVRDU.menu.25_bootrow.Erase.bootloader.browsave_bit=0
AVRDU.menu.25_bootrow.Erase=Save guard "Erase"

AVRDU.menu.25_bootrow.Upload.bootloader.browupload={bootloader.bootrow}
AVRDU.menu.25_bootrow.Upload=Upload ".brow" file

AVRDU.menu.26_userrow.Retained=Save guard "Retained"

AVRDU.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRDU.menu.26_userrow.Upload=Upload ".urow" file

AVRDU.menu.51_buildopt.Release=Release (default)

AVRDU.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRDU.menu.51_buildopt.Debug1=DEBUG=1

AVRDU.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRDU.menu.51_buildopt.Debug2=DEBUG=2

AVRDU.menu.52_macroapi.Enable=Macro API Enable (default)

AVRDU.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRDU.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRDU.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRDU.menu.52_macroapi.Disable.build.macroapi=
AVRDU.menu.52_macroapi.Disable=Macro API Disable

AVRDU.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRDU.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDU.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRDU.menu.53_printf.Default=Integer Only

AVRDU.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRDU.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDU.menu.53_printf.Full=Float Support

AVRDU.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU.menu.90_console_baud.9600bps=9600 bps (default)

AVRDU.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDU.menu.90_console_baud.38400bps=38400 bps

