askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDU.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDU.menu.90_console_baud.57600bps=57600 bps

AVRDU.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDU.menu.90_console_baud.115200bps=115200 bps

AVRDU.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDU.menu.90_console_baud.230400bps=230400 bps

AVRDU.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDU.menu.90_console_baud.500000bps=500000 bps

AVRDU.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDU.menu.90_console_baud.1000000bps=1000000 bps

AVRDU.menu.90_console_baud.separator1=-

AVRDU.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDU.menu.90_console_baud.2400bps=2400 bps (for ULP)

AVRDU.menu.95_bootloader.UART0_A0_LA7.bootloader.file=hex/boot_avrdu_UART0_A0_{upload.speed}_LA7.hex
AVRDU.menu.95_bootloader.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDU.menu.95_bootloader.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRDU.menu.95_bootloader.separator1=-

AVRDU.menu.95_bootloader.UART0_D4_LC3.bootloader.file=hex/boot_avrdu_UART0_D4_{upload.speed}_LC3.hex
AVRDU.menu.95_bootloader.UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVRDU.menu.95_bootloader.UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3 (14pin)

AVRDU.menu.95_bootloader.UART1_D6_LC3.bootloader.file=hex/boot_avrdu_UART1_D6_{upload.speed}_LC3.hex
AVRDU.menu.95_bootloader.UART1_D6_LC3.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PC3
AVRDU.menu.95_bootloader.UART1_D6_LC3=UART0 TX:PD6 RX:PD7 LED=PC3 (14pin)

AVRDU.menu.95_bootloader.separator2=-

AVRDU.menu.95_bootloader.UART1_D6_LF2_SF6_Curiosity=UART1 TX:PD6 RX:PD7 LED=PF2 SW=PF6 (AVR64DU32 Curiosity Nano)
AVRDU.menu.95_bootloader.UART1_D6_LF2_SF6_Curiosity.bootloader.file=hex/boot_avrdu_UART1_D6_{upload.speed}_LF2.hex
AVRDU.menu.95_bootloader.UART1_D6_LF2_SF6_Curiosity.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PF2 -DSW_BUILTIN=PIN_PF6


AVREA.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVREA.bootloader.OSCCFG=0x00
AVREA.bootloader.PINCFG=0x00
AVREA.bootloader.HWMONCFG=0x00
AVREA.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}00{bootloader.eesave_bit}
AVREA.bootloader.SYSCFG1=0x07
AVREA.bootloader.CODESIZE=0x00
AVREA.bootloader.BOOTSIZE=0x02
AVREA.bootloader.bod_lvl=000
AVREA.bootloader.bod_mode=00
AVREA.bootloader.bod_sample=0
AVREA.bootloader.eepupload=
AVREA.bootloader.browupload=
AVREA.bootloader.urowupload=
AVREA.bootloader.fuseupload={bootloader.fuses}
AVREA.bootloader.eesave_bit=1
AVREA.bootloader.reset_bit=1
AVREA.bootloader.updi_bit=1
AVREA.bootloader.tool=avrdude
AVREA.bootloader.programed_type=.with_bootloader
AVREA.build.export_merged_output=true
AVREA.build.text_section_start=.text=0x200
AVREA.build.buildopt=-DNDEBUG
AVREA.build.console_baud=-DCONSOLE_BAUD=9600
AVREA.build.macroapi=-DENABLE_MACRO_API
AVREA.build.printf=
AVREA.build.printflt=
AVREA.build.f_cpu=20000000L
AVREA.compiler.ldflags=
AVREA.compiler.c.elf.extra_flags=
AVREA.upload.protocol=arduino
AVREA.upload.speed=115200
AVREA.upload.tool=avrdude

AVREA.menu.01_variant.AVR64EA48.build.board=AVR_AVR64EA48
AVREA.menu.01_variant.AVR64EA48.build.mcu=avr64ea48
AVREA.menu.01_variant.AVR64EA48.build.variant=avr_ea48
AVREA.menu.01_variant.AVR64EA48.build.linker_script=avrxmega2_p128.x
AVREA.menu.01_variant.AVR64EA48.upload.maximum_data_size=6144
AVREA.menu.01_variant.AVR64EA48.upload.maximum_size=65024
AVREA.menu.01_variant.AVR64EA48=48pin AVR64EA48 (64KiB+6KiB)

AVREA.menu.01_variant.AVR32EA48.build.board=AVR_AVR32EA48
AVREA.menu.01_variant.AVR32EA48.build.mcu=avr32ea48
AVREA.menu.01_variant.AVR32EA48.build.variant=avr_ea48
AVREA.menu.01_variant.AVR32EA48.build.linker_script=avrxmega3_p64.x
AVREA.menu.01_variant.AVR32EA48.upload.maximum_data_size=4096
AVREA.menu.01_variant.AVR32EA48.upload.maximum_size=32256
AVREA.menu.01_variant.AVR32EA48=48pin AVR32EA48 (32KiB+4KiB)

AVREA.menu.01_variant.AVR16EA48.build.board=AVR_AVR16EA48
AVREA.menu.01_variant.AVR16EA48.build.mcu=avr16ea48
AVREA.menu.01_variant.AVR16EA48.build.variant=avr_ea48
AVREA.menu.01_variant.AVR16EA48.build.linker_script=avrxmega3_p64.x
AVREA.menu.01_variant.AVR16EA48.upload.maximum_data_size=2048
AVREA.menu.01_variant.AVR16EA48.upload.maximum_size=15872
AVREA.menu.01_variant.AVR16EA48=48pin AVR16EA48 (16KiB+2KiB)

AVREA.menu.01_variant.separator1=-

AVREA.menu.01_variant.AVR64EA32.build.board=AVR_AVR64EA32
AVREA.menu.01_variant.AVR64EA32.build.mcu=avr64ea32
AVREA.menu.01_variant.AVR64EA32.build.variant=avr_ea32
AVREA.menu.01_variant.AVR64EA32.build.linker_script=avrxmega2_p128.x
AVREA.menu.01_variant.AVR64EA32.upload.maximum_data_size=6144
AVREA.menu.01_variant.AVR64EA32.upload.maximum_size=65024
AVREA.menu.01_variant.AVR64EA32=32pin AVR64EA32 (64KiB+6KiB)

AVREA.menu.01_variant.AVR32EA32.build.board=AVR_AVR32EA32
AVREA.menu.01_variant.AVR32EA32.build.mcu=avr32ea32
AVREA.menu.01_variant.AVR32EA32.build.variant=avr_ea32
AVREA.menu.01_variant.AVR32EA32.build.linker_script=avrxmega3_p64.x
AVREA.menu.01_variant.AVR32EA32.upload.maximum_data_size=4096
AVREA.menu.01_variant.AVR32EA32.upload.maximum_size=32256
AVREA.menu.01_variant.AVR32EA32=32pin AVR32EA32 (32KiB+4KiB)

AVREA.menu.01_variant.AVR16EA32.build.board=AVR_AVR16EA32
AVREA.menu.01_variant.AVR16EA32.build.mcu=avr16ea32
AVREA.menu.01_variant.AVR16EA32.build.variant=avr_ea32
AVREA.menu.01_variant.AVR16EA32.build.linker_script=avrxmega3_p64.x
AVREA.menu.01_variant.AVR16EA32.upload.maximum_data_size=2048
AVREA.menu.01_variant.AVR16EA32.upload.maximum_size=15872
AVREA.menu.01_variant.AVR16EA32=32pin AVR16EA32 (16KiB+2KiB)

AVREA.menu.01_variant.separator2=-

AVREA.menu.01_variant.AVR64EA28.build.board=AVR_AVR64EA28
AVREA.menu.01_variant.AVR64EA28.build.mcu=avr64ea28
AVREA.menu.01_variant.AVR64EA28.build.variant=avr_ea28
AVREA.menu.01_variant.AVR64EA28.build.linker_script=avrxmega2_p128.x
AVREA.menu.01_variant.AVR64EA28.upload.maximum_data_size=6144
AVREA.menu.01_variant.AVR64EA28.upload.maximum_size=65024
AVREA.menu.01_variant.AVR64EA28=28pin AVR64EA28 (64KiB+6KiB)

AVREA.menu.01_variant.AVR32EA28.build.board=AVR_AVR32EA28
AVREA.menu.01_variant.AVR32EA28.build.mcu=avr32ea28
AVREA.menu.01_variant.AVR32EA28.build.variant=avr_ea28
AVREA.menu.01_variant.AVR32EA28.build.linker_script=avrxmega3_p64.x
AVREA.menu.01_variant.AVR32EA28.upload.maximum_data_size=4096
AVREA.menu.01_variant.AVR32EA28.upload.maximum_size=32256
AVREA.menu.01_variant.AVR32EA28=28pin AVR32EA28 (32KiB+4KiB)

AVREA.menu.01_variant.AVR16EA28.build.board=AVR_AVR16EA28
AVREA.menu.01_variant.AVR16EA28.build.mcu=avr16ea28
AVREA.menu.01_variant.AVR16EA28.build.variant=avr_ea28
AVREA.menu.01_variant.AVR16EA28.build.linker_script=avrxmega3_p64.x
AVREA.menu.01_variant.AVR16EA28.upload.maximum_data_size=2048
AVREA.menu.01_variant.AVR16EA28.upload.maximum_size=15872
AVREA.menu.01_variant.AVR16EA28=28pin AVR16EA28 (16KiB+2KiB)

AVREA.menu.03_clock.20MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.20MHz.build.f_cpu=20000000L
AVREA.menu.03_clock.20MHz=Internal 20 MHz

AVREA.menu.03_clock.10MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.10MHz.build.f_cpu=10000000L
AVREA.menu.03_clock.10MHz=Internal 10 MHz

AVREA.menu.03_clock.5MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.5MHz.build.f_cpu=5000000L
AVREA.menu.03_clock.5MHz=Internal 5 MHz

