askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVREA.menu.03_clock.separator1=-

AVREA.menu.03_clock.16MHz.bootloader.OSCCFG=0b00001000
AVREA.menu.03_clock.16MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.16MHz.build.f_cpu=16000000L
AVREA.menu.03_clock.16MHz=Internal 16 MHz

AVREA.menu.03_clock.8MHz.bootloader.OSCCFG=0b00001000
AVREA.menu.03_clock.8MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.8MHz.build.f_cpu=8000000L
AVREA.menu.03_clock.8MHz=Internal 8 MHz

AVREA.menu.03_clock.4MHz.bootloader.OSCCFG=0b00001000
AVREA.menu.03_clock.4MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.4MHz.build.f_cpu=4000000L
AVREA.menu.03_clock.4MHz=Internal 4 MHz

AVREA.menu.03_clock.1MHz.bootloader.OSCCFG=0b00001000
AVREA.menu.03_clock.1MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.1MHz.build.f_cpu=1000000L
AVREA.menu.03_clock.1MHz=Internal 1 MHz

AVREA.menu.03_clock.separator2=-

AVREA.menu.03_clock.2MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.2MHz.build.f_cpu=2000000L
AVREA.menu.03_clock.2MHz=Internal 2 MHz

AVREA.menu.03_clock.32768Hz.bootloader.bod_sample=1
AVREA.menu.03_clock.32768Hz.build.f_cpu=32768L
AVREA.menu.03_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVREA.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVREA.menu.11_BODMODE.Disabled=Disabled
# AVREA.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVREA.menu.11_BODMODE.Enabled=Enabled
# AVREA.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVREA.menu.11_BODMODE.Sampled=Sampled
# AVREA.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVREA.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVREA.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVREA.menu.12_BODLVL.BODLEVEL0=Level 1.75V (default)
# AVREA.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVREA.menu.12_BODLVL.BODLEVEL1=Level 1.90V
# AVREA.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVREA.menu.12_BODLVL.BODLEVEL2=Level 2.60V
# AVREA.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVREA.menu.12_BODLVL.BODLEVEL3=Level 4.30V

AVREA.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVREA.menu.21_resetpin.Reset=Reset

AVREA.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVREA.menu.21_resetpin.Gpio=GPIO (input only)

# AVREA.menu.22_updipin.Updi.bootloader.updi_bit=1
# AVREA.menu.22_updipin.Updi=PF7 pin=UPDI (default)

# AVREA.menu.22_updipin.Gpio.bootloader.updi_bit=0
# AVREA.menu.22_updipin.Gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)

AVREA.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVREA.menu.24_eeprom.Retained=Save guard "Retained"

AVREA.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVREA.menu.24_eeprom.Erase=Save guard "Erase"

AVREA.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVREA.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVREA.menu.24_eeprom.Upload=Upload ".eep" file

AVREA.menu.26_userrow.Retained=Save guard "Retained"

AVREA.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVREA.menu.26_userrow.Upload=Upload ".urow" file

AVREA.menu.51_buildopt.Release=Release (default)

AVREA.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVREA.menu.51_buildopt.Debug1=DEBUG=1

AVREA.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVREA.menu.51_buildopt.Debug2=DEBUG=2

AVREA.menu.52_macroapi.Enable=Macro API Enable (default)

AVREA.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVREA.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVREA.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVREA.menu.52_macroapi.Disable.build.macroapi=
AVREA.menu.52_macroapi.Disable=Macro API Disable

AVREA.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVREA.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVREA.menu.52_macroapi.AllDisable=Standard Library All Disable

AVREA.menu.53_printf.Default=Integer Only

AVREA.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVREA.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVREA.menu.53_printf.Full=Float Support

AVREA.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVREA.menu.90_console_baud.9600bps=9600 bps (default)

AVREA.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVREA.menu.90_console_baud.38400bps=38400 bps

AVREA.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVREA.menu.90_console_baud.57600bps=57600 bps

AVREA.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVREA.menu.90_console_baud.115200bps=115200 bps

AVREA.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVREA.menu.90_console_baud.230400bps=230400 bps

AVREA.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVREA.menu.90_console_baud.500000bps=500000 bps

AVREA.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVREA.menu.90_console_baud.1000000bps=1000000 bps

AVREA.menu.90_console_baud.separator1=-

AVREA.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVREA.menu.90_console_baud.2400bps=2400 bps (for ULP)

AVREA.menu.95_bootloader.UART0_A0_LA7.bootloader.file=hex/boot_avrea_UART0_A0_{upload.speed}_LA7.hex
AVREA.menu.95_bootloader.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVREA.menu.95_bootloader.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVREA.menu.95_bootloader.separator1=-

AVREA.menu.95_bootloader.UART2_F0_LA7.bootloader.file=hex/boot_avrea_UART2_F0_{upload.speed}_LA7.hex
AVREA.menu.95_bootloader.UART2_F0_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7
AVREA.menu.95_bootloader.UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7

AVREA.menu.95_bootloader.separator2=-

AVREA.menu.95_bootloader.UART1_C0_LB3_SC2_Curiosity=UART1 TX:PC0 RX:PC1 LED=PB3 SW=PB2 (AVR64EA48 Curiosity Nano)
AVREA.menu.95_bootloader.UART1_C0_LB3_SC2_Curiosity.bootloader.file=hex/boot_avrea_UART1_C0_{upload.speed}_LB3.hex
AVREA.menu.95_bootloader.UART1_C0_LB3_SC2_Curiosity.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PB3 -DSW_BUILTIN=PIN_PB2


AVREB.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVREB.bootloader.OSCCFG=0x00
AVREB.bootloader.PINCFG=0xFF
AVREB.bootloader.HWMONCFG=0xFF
AVREB.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.browsave_bit}{bootloader.eesave_bit}
AVREB.bootloader.SYSCFG1=0x07
AVREB.bootloader.CODESIZE=0x00
AVREB.bootloader.BOOTSIZE=0x02
AVREB.bootloader.bod_lvl=000
AVREB.bootloader.bod_mode=00
AVREB.bootloader.bod_sample=0
AVREB.bootloader.eepupload=
AVREB.bootloader.browupload=
AVREB.bootloader.urowupload=
AVREB.bootloader.fuseupload={bootloader.fuses}
AVREB.bootloader.eesave_bit=1
AVREB.bootloader.browsave_bit=1
AVREB.bootloader.reset_bit=1
AVREB.bootloader.updi_bit=1
AVREB.bootloader.tool=avrdude
AVREB.bootloader.programed_type=.with_bootloader
AVREB.build.export_merged_output=true
AVREB.build.text_section_start=.text=0x200
AVREB.build.buildopt=-DNDEBUG
AVREB.build.console_baud=-DCONSOLE_BAUD=9600
AVREB.build.macroapi=-DENABLE_MACRO_API
AVREB.build.printf=
AVREB.build.printflt=
AVREB.build.f_cpu=20000000L
AVREB.compiler.ldflags=
AVREB.compiler.c.elf.extra_flags=
AVREB.upload.protocol=arduino
AVREB.upload.speed=115200
AVREB.upload.tool=avrdude

AVREB.menu.01_variant.AVR32EB32.build.board=AVR_AVR32EB32
AVREB.menu.01_variant.AVR32EB32.build.mcu=avr32eb32
AVREB.menu.01_variant.AVR32EB32.build.variant=avr_eb32
AVREB.menu.01_variant.AVR32EB32.build.linker_script=avrxmega3_p64.x
AVREB.menu.01_variant.AVR32EB32.upload.maximum_data_size=3072
AVREB.menu.01_variant.AVR32EB32.upload.maximum_size=32256
AVREB.menu.01_variant.AVR32EB32=32pin AVR32EB32 (32KiB+3KiB)

AVREB.menu.01_variant.AVR16EB32.build.board=AVR_AVR16EB32
AVREB.menu.01_variant.AVR16EB32.build.mcu=avr16eb32
AVREB.menu.01_variant.AVR16EB32.build.variant=avr_eb32
AVREB.menu.01_variant.AVR16EB32.build.linker_script=avrxmega3_p64.x
AVREB.menu.01_variant.AVR16EB32.upload.maximum_data_size=2048
AVREB.menu.01_variant.AVR16EB32.upload.maximum_size=15872
AVREB.menu.01_variant.AVR16EB32=32pin AVR16EB32 (16KiB+2KiB)

AVREB.menu.01_variant.separator1=-

AVREB.menu.01_variant.AVR32EB28.build.board=AVR_AVR32EB28
AVREB.menu.01_variant.AVR32EB28.build.mcu=avr32eb28
AVREB.menu.01_variant.AVR32EB28.build.variant=avr_eb28
AVREB.menu.01_variant.AVR32EB28.build.linker_script=avrxmega3_p64.x
AVREB.menu.01_variant.AVR32EB28.upload.maximum_data_size=3072
AVREB.menu.01_variant.AVR32EB28.upload.maximum_size=32256
AVREB.menu.01_variant.AVR32EB28=28pin AVR32EB28 (32KiB+3KiB)

AVREB.menu.01_variant.AVR16EB28.build.board=AVR_AVR16EB28
AVREB.menu.01_variant.AVR16EB28.build.mcu=avr16eb28
AVREB.menu.01_variant.AVR16EB28.build.variant=avr_eb28
AVREB.menu.01_variant.AVR16EB28.build.linker_script=avrxmega3_p64.x
AVREB.menu.01_variant.AVR16EB28.upload.maximum_data_size=2048
AVREB.menu.01_variant.AVR16EB28.upload.maximum_size=15872
AVREB.menu.01_variant.AVR16EB28=28pin AVR16EB28 (16KiB+2KiB)

