askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVREB.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVREB.menu.90_console_baud.9600bps=9600 bps (default)

AVREB.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVREB.menu.90_console_baud.38400bps=38400 bps

AVREB.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVREB.menu.90_console_baud.57600bps=57600 bps

AVREB.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVREB.menu.90_console_baud.115200bps=115200 bps

AVREB.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVREB.menu.90_console_baud.230400bps=230400 bps

AVREB.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVREB.menu.90_console_baud.500000bps=500000 bps

AVREB.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVREB.menu.90_console_baud.1000000bps=1000000 bps

AVREB.menu.90_console_baud.separator1=-

AVREB.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVREB.menu.90_console_baud.2400bps=2400 bps (for ULP)

AVREB.menu.95_bootloader.UART0_A0_LA7.bootloader.file=hex/boot_avreb_UART0_A0_{upload.speed}_LA7.hex
AVREB.menu.95_bootloader.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVREB.menu.95_bootloader.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVREB.menu.95_bootloader.separator1=-

AVREB.menu.95_bootloader.UART0_D4_LC3.bootloader.file=hex/boot_avreb_UART0_D4_{upload.speed}_LC3.hex
AVREB.menu.95_bootloader.UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVREB.menu.95_bootloader.UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3 (14pin)

AVREB.menu.95_bootloader.separator1=-

AVREB.menu.95_bootloader.UART0_C1_LF5_SF6_Curiosity=UART0 TX:PC1 RX:PC2 LED=PF5 SW=PF6 (AVR16EB32 Curiosity Nano)
AVREB.menu.95_bootloader.UART0_C1_LF5_SF6_Curiosity.bootloader.file=hex/boot_avreb_UART0_C1_{upload.speed}_LF5.hex
AVREB.menu.95_bootloader.UART0_C1_LF5_SF6_Curiosity.build.console_select=-DSerial=Serial0E -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6


AVRLA.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRLA.bootloader.OSCCFG=0x00
AVRLA.bootloader.HWMONCFG=0x00
AVRLA.bootloader.PINCFG=0b000000{bootloader.updi_bit}{bootloader.reset_bit}
AVRLA.bootloader.SYSCFG0=0b000000{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRLA.bootloader.SYSCFG1=0x07
AVRLA.bootloader.CODESIZE=0x00
AVRLA.bootloader.BOOTSIZE=0x02
AVRLA.bootloader.bod_lvl=000
AVRLA.bootloader.bod_mode=00
AVRLA.bootloader.bod_sample=0
AVRLA.bootloader.eepupload=
AVRLA.bootloader.browupload=
AVRLA.bootloader.urowupload=
AVRLA.bootloader.fuseupload={bootloader.fuses}
AVRLA.bootloader.eesave_bit=1
AVRLA.bootloader.browsave_bit=1
AVRLA.bootloader.reset_bit=1
AVRLA.bootloader.updi_bit=1
AVRLA.bootloader.tool=avrdude
AVRLA.bootloader.programed_type=.with_bootloader
AVRLA.build.export_merged_output=true
AVRLA.build.text_section_start=.text=0x200
AVRLA.build.buildopt=-DNDEBUG
AVRLA.build.console_baud=-DCONSOLE_BAUD=9600
AVRLA.build.macroapi=-DENABLE_MACRO_API
AVRLA.build.printf=
AVRLA.build.printflt=
AVRLA.build.f_cpu=20000000L
AVRLA.compiler.ldflags=
AVRLA.compiler.c.elf.extra_flags=
AVRLA.upload.protocol=arduino
AVRLA.upload.speed=115200
AVRLA.upload.tool=avrdude

AVRLA.menu.01_variant.AVR32LA32.build.board=AVR_AVR32LA32
AVRLA.menu.01_variant.AVR32LA32.build.mcu=avr32la32
AVRLA.menu.01_variant.AVR32LA32.build.variant=avr_la32
AVRLA.menu.01_variant.AVR32LA32.build.linker_script=avrxmega3_p64.x
AVRLA.menu.01_variant.AVR32LA32.upload.maximum_data_size=3072
AVRLA.menu.01_variant.AVR32LA32.upload.maximum_size=32256
AVRLA.menu.01_variant.AVR32LA32=32pin AVR32LA32 (32KiB+3KiB)

AVRLA.menu.01_variant.separator1=-

AVRLA.menu.01_variant.AVR32LA28.build.board=AVR_AVR32LA28
AVRLA.menu.01_variant.AVR32LA28.build.mcu=avr32la28
AVRLA.menu.01_variant.AVR32LA28.build.variant=avr_la28
AVRLA.menu.01_variant.AVR32LA28.build.linker_script=avrxmega3_p64.x
AVRLA.menu.01_variant.AVR32LA28.upload.maximum_data_size=3072
AVRLA.menu.01_variant.AVR32LA28.upload.maximum_size=32256
AVRLA.menu.01_variant.AVR32LA28=28pin AVR32LA28 (32KiB+3KiB)

AVRLA.menu.01_variant.separator2=-

AVRLA.menu.01_variant.AVR32LA20.build.board=AVR_AVR32LA20
AVRLA.menu.01_variant.AVR32LA20.build.mcu=avr32la20
AVRLA.menu.01_variant.AVR32LA20.build.variant=avr_la20
AVRLA.menu.01_variant.AVR32LA20.build.linker_script=avrxmega3_p64.x
AVRLA.menu.01_variant.AVR32LA20.upload.maximum_data_size=3072
AVRLA.menu.01_variant.AVR32LA20.upload.maximum_size=32256
AVRLA.menu.01_variant.AVR32LA20=20pin AVR32LA20 (32KiB+3KiB)

AVRLA.menu.01_variant.separator3=-

AVRLA.menu.01_variant.AVR32LA14.build.board=AVR_AVR32LA14
AVRLA.menu.01_variant.AVR32LA14.build.mcu=avr32la14
AVRLA.menu.01_variant.AVR32LA14.build.variant=avr_la14
AVRLA.menu.01_variant.AVR32LA14.build.linker_script=avrxmega3_p64.x
AVRLA.menu.01_variant.AVR32LA14.upload.maximum_data_size=3072
AVRLA.menu.01_variant.AVR32LA14.upload.maximum_size=32256
AVRLA.menu.01_variant.AVR32LA14=14pin AVR32LA14 (32KiB+3KiB)

AVRLA.menu.03_clock.20MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.20MHz.build.f_cpu=20000000L
AVRLA.menu.03_clock.20MHz=Internal 20 MHz

AVRLA.menu.03_clock.10MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.10MHz.build.f_cpu=10000000L
AVRLA.menu.03_clock.10MHz=Internal 10 MHz

AVRLA.menu.03_clock.5MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.5MHz.build.f_cpu=5000000L
AVRLA.menu.03_clock.5MHz=Internal 5 MHz

AVRLA.menu.03_clock.separator1=-

AVRLA.menu.03_clock.16MHz.bootloader.OSCCFG=0b00001000
AVRLA.menu.03_clock.16MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.16MHz.build.f_cpu=16000000L
AVRLA.menu.03_clock.16MHz=Internal 16 MHz

AVRLA.menu.03_clock.8MHz.bootloader.OSCCFG=0b00001000
AVRLA.menu.03_clock.8MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.8MHz.build.f_cpu=8000000L
AVRLA.menu.03_clock.8MHz=Internal 8 MHz

AVRLA.menu.03_clock.4MHz.bootloader.OSCCFG=0b00001000
AVRLA.menu.03_clock.4MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.4MHz.build.f_cpu=4000000L
AVRLA.menu.03_clock.4MHz=Internal 4 MHz

