askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRLA.menu.03_clock.1MHz.bootloader.OSCCFG=0b00001000
AVRLA.menu.03_clock.1MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.1MHz.build.f_cpu=1000000L
AVRLA.menu.03_clock.1MHz=Internal 1 MHz

AVRLA.menu.03_clock.separator2=-

AVRLA.menu.03_clock.2MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.2MHz.build.f_cpu=2000000L
AVRLA.menu.03_clock.2MHz=Internal 2 MHz

AVRLA.menu.03_clock.32768Hz.bootloader.bod_sample=1
AVRLA.menu.03_clock.32768Hz.build.f_cpu=32768L
AVRLA.menu.03_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRLA.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRLA.menu.11_BODMODE.Disabled=Disabled

# AVRLA.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRLA.menu.11_BODMODE.Enabled=Enabled

# AVRLA.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRLA.menu.11_BODMODE.Sampled=Sampled

# AVRLA.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRLA.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRLA.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRLA.menu.12_BODLVL.BODLEVEL0=Level 1.65V (default)
# AVRLA.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRLA.menu.12_BODLVL.BODLEVEL1=Level 1.90V
# AVRLA.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRLA.menu.12_BODLVL.BODLEVEL2=Level 2.60V
# AVRLA.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRLA.menu.12_BODLVL.BODLEVEL3=Level 4.30V

AVRLA.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRLA.menu.21_resetpin.Reset=Reset

AVRLA.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRLA.menu.21_resetpin.Gpio=GPIO (input only)

# AVRLA.menu.22_updipin.Updi.bootloader.updi_bit=1
# AVRLA.menu.22_updipin.Updi=PF7 pin=UPDI (default)

# AVRLA.menu.22_updipin.Gpio.bootloader.updi_bit=0
# AVRLA.menu.22_updipin.Gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)

AVRLA.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRLA.menu.24_eeprom.Retained=Save guard "Retained"

AVRLA.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRLA.menu.24_eeprom.Erase=Save guard "Erase"

AVRLA.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRLA.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRLA.menu.24_eeprom.Upload=Upload ".eep" file

AVRLA.menu.25_bootrow.Retained.bootloader.browsave_bit=1
AVRLA.menu.25_bootrow.Retained=Save guard "Retained"

AVRLA.menu.25_bootrow.Erase.bootloader.browsave_bit=0
AVRLA.menu.25_bootrow.Erase=Save guard "Erase"

AVRLA.menu.25_bootrow.Upload.bootloader.browupload={bootloader.bootrow}
AVRLA.menu.25_bootrow.Upload=Upload ".brow" file

AVRLA.menu.26_userrow.Retained=Save guard "Retained"

AVRLA.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRLA.menu.26_userrow.Upload=Upload ".urow" file

AVRLA.menu.27_fusefile.Menu=Specify in the MENU

AVRLA.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
AVRLA.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

AVRLA.menu.51_buildopt.Release=Release (default)

AVRLA.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRLA.menu.51_buildopt.Debug1=DEBUG=1

AVRLA.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRLA.menu.51_buildopt.Debug2=DEBUG=2

AVRLA.menu.52_macroapi.Enable=Macro API Enable (default)

AVRLA.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRLA.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRLA.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRLA.menu.52_macroapi.Disable.build.macroapi=
AVRLA.menu.52_macroapi.Disable=Macro API Disable

AVRLA.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRLA.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRLA.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRLA.menu.53_printf.Default=Integer Only

AVRLA.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRLA.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRLA.menu.53_printf.Full=Float Support

AVRLA.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRLA.menu.90_console_baud.9600bps=9600 bps (default)

AVRLA.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRLA.menu.90_console_baud.38400bps=38400 bps

AVRLA.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRLA.menu.90_console_baud.57600bps=57600 bps

AVRLA.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRLA.menu.90_console_baud.115200bps=115200 bps

AVRLA.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRLA.menu.90_console_baud.230400bps=230400 bps

AVRLA.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRLA.menu.90_console_baud.500000bps=500000 bps

AVRLA.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRLA.menu.90_console_baud.1000000bps=1000000 bps

AVRLA.menu.90_console_baud.separator1=-

AVRLA.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRLA.menu.90_console_baud.2400bps=2400 bps (for ULP)

AVRLA.menu.95_bootloader.UART0_A0_LA7.bootloader.file=hex/boot_avrla_UART0_A0_{upload.speed}_LA7.hex
AVRLA.menu.95_bootloader.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRLA.menu.95_bootloader.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRLA.menu.95_bootloader.separator1=-

AVRLA.menu.95_bootloader.UART0_D4_LC3.bootloader.file=hex/boot_avrla_UART0_D4_{upload.speed}_LC3.hex
AVRLA.menu.95_bootloader.UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVRLA.menu.95_bootloader.UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3

AVRLA.menu.95_bootloader.separator2=-

AVRLA.menu.95_bootloader.UART0_C1_LF5_SC0_Curiosity=UART0 TX:PC1 RX:PC2 LED=PF5 SW=PC0 (AVR32LA32 Curiosity Nano)
AVRLA.menu.95_bootloader.UART0_C1_LF5_SC0_Curiosity.bootloader.file=hex/boot_avrla_UART0_C1_{upload.speed}_LF5.hex
AVRLA.menu.95_bootloader.UART0_C1_LF5_SC0_Curiosity.build.console_select=-DSerial=Serial0E -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PC0


AVRSD.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRSD.bootloader.OSCCFG=0x00
AVRSD.bootloader.PINCFG=0x00
AVRSD.bootloader.HWMONCFG=0x00
AVRSD.bootloader.SYSCFG0=0b000000{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRSD.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRSD.bootloader.CODESIZE=0x00
AVRSD.bootloader.BOOTSIZE=0x02
AVRSD.bootloader.bod_lvl=000
AVRSD.bootloader.bod_mode=00
AVRSD.bootloader.bod_sample=0
AVRSD.bootloader.eepupload=
AVRSD.bootloader.browupload=
AVRSD.bootloader.urowupload=
AVRSD.bootloader.fuseupload={bootloader.fuses}
AVRSD.bootloader.eesave_bit=1
AVRSD.bootloader.browsave_bit=1
AVRSD.bootloader.mvsys_bit=01
AVRSD.bootloader.tool=avrdude
AVRSD.bootloader.programed_type=.with_bootloader
AVRSD.build.export_merged_output=true
AVRSD.build.text_section_start=.text=0x400
AVRSD.build.buildopt=-DNDEBUG
AVRSD.build.console_baud=-DCONSOLE_BAUD=9600
AVRSD.build.macroapi=-DENABLE_MACRO_API
AVRSD.build.printf=
AVRSD.build.printflt=
AVRSD.build.f_cpu=20000000L
AVRSD.compiler.ldflags=
AVRSD.compiler.c.elf.extra_flags=
AVRSD.upload.protocol=arduino
AVRSD.upload.speed=115200
AVRSD.upload.tool=avrdude

AVRSD.menu.01_variant.AVR32SD32.build.board=AVR_AVR32SD32
AVRSD.menu.01_variant.AVR32SD32.build.mcu=avr32sd32
AVRSD.menu.01_variant.AVR32SD32.build.variant=avr_sd32
AVRSD.menu.01_variant.AVR32SD32.build.linker_script=avrxmega3_p512.x
AVRSD.menu.01_variant.AVR32SD32.upload.maximum_data_size=4096
AVRSD.menu.01_variant.AVR32SD32.upload.maximum_size=31744
AVRSD.menu.01_variant.AVR32SD32=32pin AVR32SD32 (32KiB+4KiB)

AVRSD.menu.01_variant.separator1=-

