askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRSD.menu.01_variant.AVR32SD28.build.board=AVR_AVR32SD28
AVRSD.menu.01_variant.AVR32SD28.build.mcu=avr32sd28
AVRSD.menu.01_variant.AVR32SD28.build.variant=avr_sd28
AVRSD.menu.01_variant.AVR32SD28.build.linker_script=avrxmega3_p512.x
AVRSD.menu.01_variant.AVR32SD28.upload.maximum_data_size=4096
AVRSD.menu.01_variant.AVR32SD28.upload.maximum_size=31744
AVRSD.menu.01_variant.AVR32SD28=28pin AVR32SD28 (32KiB+4KiB)

AVRSD.menu.01_variant.separator2=-

AVRSD.menu.01_variant.AVR32SD20.build.board=AVR_AVR32SD20
AVRSD.menu.01_variant.AVR32SD20.build.mcu=avr32sd20
AVRSD.menu.01_variant.AVR32SD20.build.variant=avr_sd20
AVRSD.menu.01_variant.AVR32SD20.build.linker_script=avrxmega3_p512.x
AVRSD.menu.01_variant.AVR32SD20.upload.maximum_data_size=4096
AVRSD.menu.01_variant.AVR32SD20.upload.maximum_size=31744
AVRSD.menu.01_variant.AVR32SD20=20pin AVR32SD20 (32KiB+4KiB)

AVRSD.menu.04_clock.20MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.20MHz.build.f_cpu=20000000L
AVRSD.menu.04_clock.20MHz=Internal 20 MHz

AVRSD.menu.04_clock.10MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.10MHz.build.f_cpu=10000000L
AVRSD.menu.04_clock.10MHz=Internal 10 MHz

AVRSD.menu.04_clock.5MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.5MHz.build.f_cpu=5000000L
AVRSD.menu.04_clock.5MHz=Internal 5 MHz

AVRSD.menu.04_clock.separator1=-

AVRSD.menu.04_clock.16MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.16MHz.build.f_cpu=16000000L
AVRSD.menu.04_clock.16MHz=Internal 16 MHz

AVRSD.menu.04_clock.8MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.8MHz.build.f_cpu=8000000L
AVRSD.menu.04_clock.8MHz=Internal 8 MHz

AVRSD.menu.04_clock.4MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.4MHz.build.f_cpu=4000000L
AVRSD.menu.04_clock.4MHz=Internal 4 MHz

AVRSD.menu.04_clock.separator2=-

AVRSD.menu.04_clock.21_12MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.21_12MHz.build.f_cpu=12000000L
AVRSD.menu.04_clock.21_12MHz=Internal 12 MHz

AVRSD.menu.04_clock.22_6MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.22_6MHz.build.f_cpu=6000000L
AVRSD.menu.04_clock.22_6MHz=Internal 6 MHz

AVRSD.menu.04_clock.23_3MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.23_3MHz.build.f_cpu=3000000L
AVRSD.menu.04_clock.23_3MHz=Internal 3 MHz

AVRSD.menu.04_clock.2MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.2MHz.build.f_cpu=2000000L
AVRSD.menu.04_clock.2MHz=Internal 2 MHz

AVRSD.menu.04_clock.1MHz.bootloader.bod_sample=0
AVRSD.menu.04_clock.1MHz.build.f_cpu=1000000L
AVRSD.menu.04_clock.1MHz=Internal 1 MHz

# AVRSD.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRSD.menu.11_BODMODE.Disabled=Disabled
# AVRSD.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRSD.menu.11_BODMODE.Enabled=Enabled
# AVRSD.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRSD.menu.11_BODMODE.Sampled=Sampled
# AVRSD.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRSD.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRSD.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRSD.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRSD.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRSD.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRSD.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRSD.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRSD.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRSD.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRSD.menu.23_mvsyscfg.Dual.bootloader.mvsys_bit=01
AVRSD.menu.23_mvsyscfg.Dual="Dual" (default)

AVRSD.menu.23_mvsyscfg.Single.bootloader.mvsys_bit=10
AVRSD.menu.23_mvsyscfg.Single="Single"

AVRSD.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRSD.menu.24_eeprom.Retained=Save guard "Retained"

AVRSD.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRSD.menu.24_eeprom.Erase=Save guard "Erase"

AVRSD.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRSD.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRSD.menu.24_eeprom.Upload=Upload ".eep" file

AVRSD.menu.25_bootrow.Retained.bootloader.browsave_bit=1
AVRSD.menu.25_bootrow.Retained=Save guard "Retained"

AVRSD.menu.25_bootrow.Erase.bootloader.browsave_bit=0
AVRSD.menu.25_bootrow.Erase=Save guard "Erase"

AVRSD.menu.25_bootrow.Upload.bootloader.browupload={bootloader.bootrow}
AVRSD.menu.25_bootrow.Upload=Upload ".brow" file

AVRSD.menu.26_userrow.Retained=Save guard "Retained"

AVRSD.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRSD.menu.26_userrow.Upload=Upload ".urow" file

AVRSD.menu.51_buildopt.Release=Release (default)

AVRSD.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRSD.menu.51_buildopt.Debug1=DEBUG=1

AVRSD.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRSD.menu.51_buildopt.Debug2=DEBUG=2

AVRSD.menu.52_macroapi.Enable=Macro API Enable (default)

AVRSD.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRSD.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRSD.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRSD.menu.52_macroapi.Disable.build.macroapi=
AVRSD.menu.52_macroapi.Disable=Macro API Disable

AVRSD.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRSD.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRSD.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRSD.menu.53_printf.Default=Integer Only

AVRSD.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRSD.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRSD.menu.53_printf.Full=Float Support

AVRSD.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRSD.menu.90_console_baud.9600bps=9600 bps (default)

AVRSD.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRSD.menu.90_console_baud.38400bps=38400 bps

AVRSD.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRSD.menu.90_console_baud.57600bps=57600 bps

AVRSD.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRSD.menu.90_console_baud.115200bps=115200 bps

AVRSD.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRSD.menu.90_console_baud.230400bps=230400 bps

AVRSD.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRSD.menu.90_console_baud.500000bps=500000 bps

AVRSD.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRSD.menu.90_console_baud.1000000bps=1000000 bps

