askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRSD.menu.90_console_baud.separator1=-

AVRSD.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRSD.menu.90_console_baud.2400bps=2400 bps (for ULP)

AVRSD.menu.95_bootloader.UART0_A0_LA7.bootloader.file=hex/boot_avrsd_UART0_A0_{upload.speed}_LA7.hex
AVRSD.menu.95_bootloader.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRSD.menu.95_bootloader.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRSD.menu.95_bootloader.separator1=-

AVRSD.menu.95_bootloader.UART1_D6_LC3.bootloader.file=hex/boot_avrsd_UART1_D6_{upload.speed}_LC3.hex
AVRSD.menu.95_bootloader.UART1_D6_LC3.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PC3
AVRSD.menu.95_bootloader.UART1_D6_LC3=UART1 TX:PD6 RX:PD7 LED=PC3

AVRSD.menu.95_bootloader.separator2=-

AVRSD.menu.95_bootloader.UART0_D4_LD2_SF2_Curiosity=UART0 TX:PD4 RX:PD5 LED=PD2 SW=PF2 (AVR32LA32 Curiosity Nano)
AVRSD.menu.95_bootloader.UART0_D4_LD2_SF2_Curiosity.bootloader.file=hex/boot_avrsd_UART0_D4_{upload.speed}_LD2.hex
AVRSD.menu.95_bootloader.UART0_D4_LD2_SF2_Curiosity.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PD2 -DSW_BUILTIN=PIN_PF2


AVRDU_usbloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDU_usbloader.bootloader.OSCCFG=0x00
AVRDU_usbloader.bootloader.PINCFG=0x00
AVRDU_usbloader.bootloader.HWMONCFG=0x00
AVRDU_usbloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRDU_usbloader.bootloader.SYSCFG1=0b000{bootloader.usbsink_bit}000
AVRDU_usbloader.bootloader.CODESIZE=0x00
AVRDU_usbloader.bootloader.BOOTSIZE=0x05
AVRDU_usbloader.bootloader.bod_lvl=000
AVRDU_usbloader.bootloader.bod_mode=00
AVRDU_usbloader.bootloader.bod_sample=0
AVRDU_usbloader.bootloader.eepupload=
AVRDU_usbloader.bootloader.browupload=
AVRDU_usbloader.bootloader.urowupload=
AVRDU_usbloader.bootloader.fuseupload={bootloader.fuses}
AVRDU_usbloader.bootloader.eesave_bit=1
AVRDU_usbloader.bootloader.browsave_bit=1
AVRDU_usbloader.bootloader.usbsink_bit=01
AVRDU_usbloader.bootloader.reset_bit=0
AVRDU_usbloader.bootloader.updi_bit=1
AVRDU_usbloader.bootloader.tool=avrdude
AVRDU_usbloader.bootloader.programed_type=.with_bootloader
AVRDU_usbloader.build.export_merged_output=true
AVRDU_usbloader.build.text_section_start=.text=0xA00
AVRDU_usbloader.build.buildopt=-DNDEBUG
AVRDU_usbloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU_usbloader.build.console_select=-DSerial=SerialUSB
AVRDU_usbloader.build.macroapi=-DENABLE_MACRO_API
AVRDU_usbloader.build.enableusb=-DENABLE_USBLOADER
AVRDU_usbloader.build.printf=
AVRDU_usbloader.build.printflt=
AVRDU_usbloader.build.f_cpu=20000000L
AVRDU_usbloader.compiler.ldflags=
AVRDU_usbloader.compiler.c.elf.extra_flags=
AVRDU_usbloader.upload.protocol=jtag3updi -Pusb:04D8:0B12
AVRDU_usbloader.upload.use_1200bps_touch=true
AVRDU_usbloader.upload.tool=avrdude_usb

AVRDU_usbloader.menu.01_variant.AVR64DU32.build.board=AVR_AVR64DU32
AVRDU_usbloader.menu.01_variant.AVR64DU32.build.mcu=avr64du32
AVRDU_usbloader.menu.01_variant.AVR64DU32.build.variant=avr_du32
AVRDU_usbloader.menu.01_variant.AVR64DU32.build.linker_script=avrxmega2_p512.x
AVRDU_usbloader.menu.01_variant.AVR64DU32.upload.maximum_data_size=8192
AVRDU_usbloader.menu.01_variant.AVR64DU32.upload.maximum_size=62976
AVRDU_usbloader.menu.01_variant.AVR64DU32=32pin AVR64DU32 (64KiB+8KiB)

AVRDU_usbloader.menu.01_variant.AVR32DU32.build.board=AVR_AVR32DU32
AVRDU_usbloader.menu.01_variant.AVR32DU32.build.mcu=avr32du32
AVRDU_usbloader.menu.01_variant.AVR32DU32.build.variant=avr_du32
AVRDU_usbloader.menu.01_variant.AVR32DU32.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.AVR32DU32.upload.maximum_data_size=4096
AVRDU_usbloader.menu.01_variant.AVR32DU32.upload.maximum_size=30208
AVRDU_usbloader.menu.01_variant.AVR32DU32=32pin AVR32DU32 (32KiB+4KiB)

AVRDU_usbloader.menu.01_variant.AVR16DU32.build.board=AVR_AVR16DU32
AVRDU_usbloader.menu.01_variant.AVR16DU32.build.mcu=avr16du32
AVRDU_usbloader.menu.01_variant.AVR16DU32.build.variant=avr_du32
AVRDU_usbloader.menu.01_variant.AVR16DU32.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.AVR16DU32.upload.maximum_data_size=2048
AVRDU_usbloader.menu.01_variant.AVR16DU32.upload.maximum_size=13824
AVRDU_usbloader.menu.01_variant.AVR16DU32=32pin AVR16DU32 (16KiB+2KiB)

AVRDU_usbloader.menu.01_variant.separator1=-

AVRDU_usbloader.menu.01_variant.AVR64DU28.build.board=AVR_AVR64DU28
AVRDU_usbloader.menu.01_variant.AVR64DU28.build.mcu=avr64du28
AVRDU_usbloader.menu.01_variant.AVR64DU28.build.variant=avr_du28
AVRDU_usbloader.menu.01_variant.AVR64DU28.build.linker_script=avrxmega2_p512.x
AVRDU_usbloader.menu.01_variant.AVR64DU28.upload.maximum_data_size=8192
AVRDU_usbloader.menu.01_variant.AVR64DU28.upload.maximum_size=62976
AVRDU_usbloader.menu.01_variant.AVR64DU28=28pin AVR64DU28 (64KiB+8KiB)

AVRDU_usbloader.menu.01_variant.AVR32DU28.build.board=AVR_AVR32DU28
AVRDU_usbloader.menu.01_variant.AVR32DU28.build.mcu=avr32du28
AVRDU_usbloader.menu.01_variant.AVR32DU28.build.variant=avr_du28
AVRDU_usbloader.menu.01_variant.AVR32DU28.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.AVR32DU28.upload.maximum_data_size=4096
AVRDU_usbloader.menu.01_variant.AVR32DU28.upload.maximum_size=30208
AVRDU_usbloader.menu.01_variant.AVR32DU28=28pin AVR32DU28 (32KiB+4KiB)

AVRDU_usbloader.menu.01_variant.AVR16DU28.build.board=AVR_AVR16DU28
AVRDU_usbloader.menu.01_variant.AVR16DU28.build.mcu=avr16du28
AVRDU_usbloader.menu.01_variant.AVR16DU28.build.variant=avr_du28
AVRDU_usbloader.menu.01_variant.AVR16DU28.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.AVR16DU28.upload.maximum_data_size=2048
AVRDU_usbloader.menu.01_variant.AVR16DU28.upload.maximum_size=13824
AVRDU_usbloader.menu.01_variant.AVR16DU28=28pin AVR16DU28 (16KiB+2KiB)

AVRDU_usbloader.menu.01_variant.separator2=-

AVRDU_usbloader.menu.01_variant.AVR32DU20.build.board=AVR_AVR32DU20
AVRDU_usbloader.menu.01_variant.AVR32DU20.build.mcu=avr32dU20
AVRDU_usbloader.menu.01_variant.AVR32DU20.build.variant=avr_dU20
AVRDU_usbloader.menu.01_variant.AVR32DU20.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.AVR32DU20.upload.maximum_data_size=4096
AVRDU_usbloader.menu.01_variant.AVR32DU20.upload.maximum_size=30208
AVRDU_usbloader.menu.01_variant.AVR32DU20=20pin AVR32DU20 (32KiB+4KiB)

