askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDU_usbloader.menu.01_variant.AVR16DU20.build.board=AVR_AVR16DU20
AVRDU_usbloader.menu.01_variant.AVR16DU20.build.mcu=avr16du20
AVRDU_usbloader.menu.01_variant.AVR16DU20.build.variant=avr_du20
AVRDU_usbloader.menu.01_variant.AVR16DU20.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.AVR16DU20.upload.maximum_data_size=2048
AVRDU_usbloader.menu.01_variant.AVR16DU20.upload.maximum_size=13824
AVRDU_usbloader.menu.01_variant.AVR16DU20=20pin AVR16DU20 (16KiB+2KiB)

AVRDU_usbloader.menu.01_variant.separator=-

AVRDU_usbloader.menu.01_variant.AVR32DU14.build.board=AVR_AVR32DU14
AVRDU_usbloader.menu.01_variant.AVR32DU14.build.mcu=avr32du14
AVRDU_usbloader.menu.01_variant.AVR32DU14.build.variant=avr_du14
AVRDU_usbloader.menu.01_variant.AVR32DU14.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.AVR32DU14.upload.maximum_data_size=4096
AVRDU_usbloader.menu.01_variant.AVR32DU14.upload.maximum_size=30208
AVRDU_usbloader.menu.01_variant.AVR32DU14=14pin AVR32DU14 (32KiB+4KiB)

AVRDU_usbloader.menu.01_variant.AVR16DU14.build.board=AVR_AVR16DU14
AVRDU_usbloader.menu.01_variant.AVR16DU14.build.mcu=avr16du14
AVRDU_usbloader.menu.01_variant.AVR16DU14.build.variant=avr_du14
AVRDU_usbloader.menu.01_variant.AVR16DU14.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.AVR16DU14.upload.maximum_data_size=2048
AVRDU_usbloader.menu.01_variant.AVR16DU14.upload.maximum_size=13824
AVRDU_usbloader.menu.01_variant.AVR16DU14=14pin AVR16DU14 (16KiB+2KiB)

AVRDU_usbloader.menu.02_clock.20MHz.bootloader.bod_sample=0
AVRDU_usbloader.menu.02_clock.20MHz.build.f_cpu=20000000L
AVRDU_usbloader.menu.02_clock.20MHz=Internal 20 MHz (recommend)

# AVRDU_usbloader.menu.02_clock.10MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.10MHz.build.f_cpu=10000000L
# AVRDU_usbloader.menu.02_clock.10MHz=Internal 10 MHz
# 
# AVRDU_usbloader.menu.02_clock.5MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.5MHz.build.f_cpu=5000000L
# AVRDU_usbloader.menu.02_clock.5MHz=Internal 5 MHz
# 
# AVRDU_usbloader.menu.02_clock.separator1=-

AVRDU_usbloader.menu.02_clock.16MHz.bootloader.bod_sample=0
AVRDU_usbloader.menu.02_clock.16MHz.build.f_cpu=16000000L
AVRDU_usbloader.menu.02_clock.16MHz=Internal 16 MHz

# AVRDU_usbloader.menu.02_clock.8MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.8MHz.build.f_cpu=8000000L
# AVRDU_usbloader.menu.02_clock.8MHz=Internal 8 MHz
# 
# AVRDU_usbloader.menu.02_clock.4MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.4MHz.build.f_cpu=4000000L
# AVRDU_usbloader.menu.02_clock.4MHz=Internal 4 MHz
# 
# AVRDU_usbloader.menu.02_clock.2MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.2MHz.build.f_cpu=2000000L
# AVRDU_usbloader.menu.02_clock.2MHz=Internal 2 MHz
# 
# AVRDU_usbloader.menu.02_clock.1MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.1MHz.build.f_cpu=1000000L
# AVRDU_usbloader.menu.02_clock.1MHz=Internal 1 MHz

# AVRDU_usbloader.menu.02_clock.separator2=-

AVRDU_usbloader.menu.02_clock.24MHz.bootloader.bod_sample=0
AVRDU_usbloader.menu.02_clock.24MHz.build.f_cpu=24000000L
AVRDU_usbloader.menu.02_clock.24MHz=Internal 24 MHz (default)

AVRDU_usbloader.menu.02_clock.12MHz.bootloader.bod_sample=0
AVRDU_usbloader.menu.02_clock.12MHz.build.f_cpu=12000000L
AVRDU_usbloader.menu.02_clock.12MHz=Internal 12 MHz (The lowest limit for using USB peripherals)

# AVRDU_usbloader.menu.02_clock.6MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.6MHz.build.f_cpu=6000000L
# AVRDU_usbloader.menu.02_clock.6MHz=Internal 6 MHz
# 
# AVRDU_usbloader.menu.02_clock.3MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.3MHz.build.f_cpu=3000000L
# AVRDU_usbloader.menu.02_clock.3MHz=Internal 3 MHz

# AVRDU_usbloader.menu.02_clock.separator3=-
# 
# AVRDU_usbloader.menu.02_clock.32MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.32MHz.build.f_cpu=32000000L
# AVRDU_usbloader.menu.02_clock.32MHz=Internal 32 MHz (OVERCLOCK)
# 
# AVRDU_usbloader.menu.02_clock.28MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.28MHz.build.f_cpu=28000000L
# AVRDU_usbloader.menu.02_clock.28MHz=Internal 28 MHz (OVERCLOCK)
# 
# AVRDU_usbloader.menu.02_clock.14MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.14MHz.build.f_cpu=14000000L
# AVRDU_usbloader.menu.02_clock.14MHz=Internal 14 MHz (OVERCLOCK)
# 
# AVRDU_usbloader.menu.02_clock.7MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.7MHz.build.f_cpu=7000000L
# AVRDU_usbloader.menu.02_clock.7MHz=Internal 7 MHz (OVERCLOCK)
# 
# AVRDU_usbloader.menu.02_clock.separator4=-
# 
# AVRDU_usbloader.menu.02_clock.32768Hz.bootloader.bod_sample=1
# AVRDU_usbloader.menu.02_clock.32768Hz.build.f_cpu=32256
# AVRDU_usbloader.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRDU_usbloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRDU_usbloader.menu.11_BODMODE.Disabled=Disabled
# AVRDU_usbloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRDU_usbloader.menu.11_BODMODE.Enabled=Enabled
# AVRDU_usbloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRDU_usbloader.menu.11_BODMODE.Sampled=Sampled
# AVRDU_usbloader.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRDU_usbloader.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRDU_usbloader.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRDU_usbloader.menu.21_resetpin.Gpio=GPIO (PF6 enables USB boot)

AVRDU_usbloader.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRDU_usbloader.menu.21_resetpin.Reset=Reset

# AVRDU_usbloader.menu.22_updipin.Updi.bootloader.updi_bit=1
# AVRDU_usbloader.menu.22_updipin.Updi=PF7 pin=UPDI (default)

# AVRDU_usbloader.menu.22_updipin.Gpio.bootloader.updi_bit=0
# AVRDU_usbloader.menu.22_updipin.Gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)

AVRDU_usbloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRDU_usbloader.menu.24_eeprom.Retained=Save guard "Retained"

