askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDU_usbloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRDU_usbloader.menu.24_eeprom.Erase=Save guard "Erase"

AVRDU_usbloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRDU_usbloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRDU_usbloader.menu.24_eeprom.Upload=Upload ".eep" file

AVRDU_usbloader.menu.25_bootrow.Retained.bootloader.browsave_bit=1
AVRDU_usbloader.menu.25_bootrow.Retained=Save guard "Retained"

AVRDU_usbloader.menu.25_bootrow.Erase.bootloader.browsave_bit=0
AVRDU_usbloader.menu.25_bootrow.Erase=Save guard "Erase"

AVRDU_usbloader.menu.25_bootrow.Upload.bootloader.browupload={bootloader.bootrow}
AVRDU_usbloader.menu.25_bootrow.Upload=Upload ".brow" file

AVRDU_usbloader.menu.26_userrow.Retained=Save guard "Retained"

AVRDU_usbloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRDU_usbloader.menu.26_userrow.Upload=Upload ".urow" file

AVRDU_usbloader.menu.51_buildopt.Release=Release (default)

AVRDU_usbloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRDU_usbloader.menu.51_buildopt.Debug1=DEBUG=1

AVRDU_usbloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRDU_usbloader.menu.51_buildopt.Debug2=DEBUG=2

AVRDU_usbloader.menu.52_macroapi.Enable=Macro API Enable (default)

AVRDU_usbloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRDU_usbloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRDU_usbloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRDU_usbloader.menu.52_macroapi.Disable.build.macroapi=
AVRDU_usbloader.menu.52_macroapi.Disable=Macro API Disable

AVRDU_usbloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRDU_usbloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDU_usbloader.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRDU_usbloader.menu.53_printf.Default=Integer Only

AVRDU_usbloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRDU_usbloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDU_usbloader.menu.53_printf.Full=Float Support

AVRDU_usbloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU_usbloader.menu.90_console_baud.9600bps=9600 bps (default)

AVRDU_usbloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDU_usbloader.menu.90_console_baud.38400bps=38400 bps

AVRDU_usbloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDU_usbloader.menu.90_console_baud.57600bps=57600 bps

AVRDU_usbloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDU_usbloader.menu.90_console_baud.115200bps=115200 bps

AVRDU_usbloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDU_usbloader.menu.90_console_baud.230400bps=230400 bps

AVRDU_usbloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDU_usbloader.menu.90_console_baud.500000bps=500000 bps

AVRDU_usbloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDU_usbloader.menu.90_console_baud.1000000bps=1000000 bps

AVRDU_usbloader.menu.90_console_baud.separator1=-

AVRDU_usbloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDU_usbloader.menu.90_console_baud.2400bps=2400 bps (for ULP)

AVRDU_usbloader.menu.96_usbbootloader.euboot_LA7_SF6=USB0 +UART0(PA0:1) LED=PA7 SW=PF6
AVRDU_usbloader.menu.96_usbbootloader.euboot_LA7_SF6.bootloader.file=hex/euboot_LA7_SF6.hex
AVRDU_usbloader.menu.96_usbbootloader.euboot_LA7_SF6.build.console_select=-DSerial=SerialUSB -DSerialDBG=Serial0A -DLED_BUILTIN=PIN_PA7 -DSW_BUILTIN=PIN_PF6

AVRDU_usbloader.menu.96_usbbootloader.separator1=-

AVRDU_usbloader.menu.96_usbbootloader.euboot_LC3_SF6=USB0 +UART1(PD4:5) LED=PC3 SW=PF6 (14pin)
AVRDU_usbloader.menu.96_usbbootloader.euboot_LC3_SF6.bootloader.file=hex/euboot_LC3_SF6.hex
AVRDU_usbloader.menu.96_usbbootloader.euboot_LC3_SF6.build.console_select=-DSerial=SerialUSB -DSerialDBG=Serial0D -DLED_BUILTIN=PIN_PC3 -DSW_BUILTIN=PIN_PF6

AVRDU_usbloader.menu.96_usbbootloader.separator2=-

AVRDU_usbloader.menu.96_usbbootloader.euboot_LF2_SF6_Curiosity=USB0 +UART1(PD6:7) LED=PF2 SW=PF6 (AVR64DU32 Curiosity Nano)
AVRDU_usbloader.menu.96_usbbootloader.euboot_LF2_SF6_Curiosity.bootloader.file=hex/euboot_LF2_SF6.hex
AVRDU_usbloader.menu.96_usbbootloader.euboot_LF2_SF6_Curiosity.build.console_select=-DSerial=SerialUSB -DSerialDBG=Serial1C -DLED_BUILTIN=PIN_PF2 -DSW_BUILTIN=PIN_PF6


AVRDB_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDB_noloader.bootloader.OSCCFG=0x00
AVRDB_noloader.bootloader.PINCFG=0x00
AVRDB_noloader.bootloader.HWMONCFG=0x00
AVRDB_noloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}00{bootloader.eesave_bit}
AVRDB_noloader.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDB_noloader.bootloader.CODESIZE=0x00
AVRDB_noloader.bootloader.BOOTSIZE=0x00
AVRDB_noloader.bootloader.bod_lvl=000
AVRDB_noloader.bootloader.bod_mode=00
AVRDB_noloader.bootloader.bod_sample=0
AVRDB_noloader.bootloader.eepupload=
AVRDB_noloader.bootloader.browupload=
AVRDB_noloader.bootloader.urowupload=
AVRDB_noloader.bootloader.fuseupload={bootloader.fuses}
AVRDB_noloader.bootloader.eesave_bit=1
AVRDB_noloader.bootloader.mvsys_bit=01
AVRDB_noloader.bootloader.reset_bit=1
AVRDB_noloader.bootloader.updi_bit=1
AVRDB_noloader.bootloader.tool=avrdude
AVRDB_noloader.bootloader.file=empty/empty.hex
AVRDB_noloader.bootloader.programed_type=
AVRDB_noloader.build.console_select=
AVRDB_noloader.build.export_merged_output=false
AVRDB_noloader.build.text_section_start=.text=0x0
AVRDB_noloader.build.buildopt=-DNDEBUG
AVRDB_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB_noloader.build.macroapi=-DENABLE_MACRO_API
AVRDB_noloader.build.printf=
AVRDB_noloader.build.printflt=
AVRDB_noloader.build.f_cpu=24000000L
AVRDB_noloader.compiler.ldflags=
AVRDB_noloader.compiler.c.elf.extra_flags=
AVRDB_noloader.upload.speed=115200
AVRDB_noloader.upload.tool=

AVRDB_noloader.menu.01_variant.AVR128DB64.build.board=AVR_AVR128DB64
AVRDB_noloader.menu.01_variant.AVR128DB64.build.mcu=avr128db64
AVRDB_noloader.menu.01_variant.AVR128DB64.build.variant=avr_db64
AVRDB_noloader.menu.01_variant.AVR128DB64.build.linker_script=avrxmega4_p512.x
AVRDB_noloader.menu.01_variant.AVR128DB64.upload.maximum_data_size=16384
AVRDB_noloader.menu.01_variant.AVR128DB64.upload.maximum_size=131072
AVRDB_noloader.menu.01_variant.AVR128DB64=64pin AVR128DB64 (128KiB+16KiB)

