askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDB_noloader.menu.01_variant.AVR64DB64.build.board=AVR_AVR64DB64
AVRDB_noloader.menu.01_variant.AVR64DB64.build.mcu=avr64db64
AVRDB_noloader.menu.01_variant.AVR64DB64.build.variant=avr_db64
AVRDB_noloader.menu.01_variant.AVR64DB64.build.linker_script=avrxmega2_p512.x
AVRDB_noloader.menu.01_variant.AVR64DB64.upload.maximum_data_size=8192
AVRDB_noloader.menu.01_variant.AVR64DB64.upload.maximum_size=65536
AVRDB_noloader.menu.01_variant.AVR64DB64=64pin AVR64DB64 (64KiB+8KiB)

AVRDB_noloader.menu.01_variant.separator1=-

AVRDB_noloader.menu.01_variant.AVR128DB48.build.board=AVR_AVR128DB48
AVRDB_noloader.menu.01_variant.AVR128DB48.build.mcu=avr128db48
AVRDB_noloader.menu.01_variant.AVR128DB48.build.variant=avr_db48
AVRDB_noloader.menu.01_variant.AVR128DB48.build.linker_script=avrxmega4_p512.x
AVRDB_noloader.menu.01_variant.AVR128DB48.upload.maximum_data_size=16384
AVRDB_noloader.menu.01_variant.AVR128DB48.upload.maximum_size=131072
AVRDB_noloader.menu.01_variant.AVR128DB48=48pin AVR128DB48 (128KiB+16KiB)

AVRDB_noloader.menu.01_variant.AVR64DB48.build.board=AVR_AVR64DB48
AVRDB_noloader.menu.01_variant.AVR64DB48.build.mcu=avr64db48
AVRDB_noloader.menu.01_variant.AVR64DB48.build.variant=avr_db48
AVRDB_noloader.menu.01_variant.AVR64DB48.build.linker_script=avrxmega2_p512.x
AVRDB_noloader.menu.01_variant.AVR64DB48.upload.maximum_data_size=8192
AVRDB_noloader.menu.01_variant.AVR64DB48.upload.maximum_size=65536
AVRDB_noloader.menu.01_variant.AVR64DB48=48pin AVR64DB48 (64KiB+8KiB)

AVRDB_noloader.menu.01_variant.AVR32DB48.build.board=AVR_AVR32DB48
AVRDB_noloader.menu.01_variant.AVR32DB48.build.mcu=avr32db48
AVRDB_noloader.menu.01_variant.AVR32DB48.build.variant=avr_db48
AVRDB_noloader.menu.01_variant.AVR32DB48.build.linker_script=avrxmega3_p512.x
AVRDB_noloader.menu.01_variant.AVR32DB48.upload.maximum_data_size=4096
AVRDB_noloader.menu.01_variant.AVR32DB48.upload.maximum_size=32768
AVRDB_noloader.menu.01_variant.AVR32DB48=48pin AVR32DB48 (32KiB+4KiB)

AVRDB_noloader.menu.01_variant.separator2=-

AVRDB_noloader.menu.01_variant.AVR128DB32.build.board=AVR_AVR128DB32
AVRDB_noloader.menu.01_variant.AVR128DB32.build.mcu=avr128db32
AVRDB_noloader.menu.01_variant.AVR128DB32.build.variant=avr_db32
AVRDB_noloader.menu.01_variant.AVR128DB32.build.linker_script=avrxmega4_p512.x
AVRDB_noloader.menu.01_variant.AVR128DB32.upload.maximum_data_size=16384
AVRDB_noloader.menu.01_variant.AVR128DB32.upload.maximum_size=131072
AVRDB_noloader.menu.01_variant.AVR128DB32=32pin AVR128DB32 (128KiB+16KiB)

AVRDB_noloader.menu.01_variant.AVR64DB32.build.board=AVR_AVR64DB32
AVRDB_noloader.menu.01_variant.AVR64DB32.build.mcu=avr64db32
AVRDB_noloader.menu.01_variant.AVR64DB32.build.variant=avr_db32
AVRDB_noloader.menu.01_variant.AVR64DB32.build.linker_script=avrxmega2_p512.x
AVRDB_noloader.menu.01_variant.AVR64DB32.upload.maximum_data_size=8192
AVRDB_noloader.menu.01_variant.AVR64DB32.upload.maximum_size=65536
AVRDB_noloader.menu.01_variant.AVR64DB32=32pin AVR64DB32 (64KiB+8KiB)

AVRDB_noloader.menu.01_variant.AVR32DB32.build.board=AVR_AVR32DB32
AVRDB_noloader.menu.01_variant.AVR32DB32.build.mcu=avr32db32
AVRDB_noloader.menu.01_variant.AVR32DB32.build.variant=avr_db32
AVRDB_noloader.menu.01_variant.AVR32DB32.build.linker_script=avrxmega3_p512.x
AVRDB_noloader.menu.01_variant.AVR32DB32.upload.maximum_data_size=4096
AVRDB_noloader.menu.01_variant.AVR32DB32.upload.maximum_size=32768
AVRDB_noloader.menu.01_variant.AVR32DB32=32pin AVR32DB32 (32KiB+4KiB)

AVRDB_noloader.menu.01_variant.separator3=-

AVRDB_noloader.menu.01_variant.AVR128DB28.build.board=AVR_AVR128DB28
AVRDB_noloader.menu.01_variant.AVR128DB28.build.mcu=avr128db28
AVRDB_noloader.menu.01_variant.AVR128DB28.build.variant=avr_db28
AVRDB_noloader.menu.01_variant.AVR128DB28.build.linker_script=avrxmega4_p512.x
AVRDB_noloader.menu.01_variant.AVR128DB28.upload.maximum_data_size=16384
AVRDB_noloader.menu.01_variant.AVR128DB28.upload.maximum_size=131072
AVRDB_noloader.menu.01_variant.AVR128DB28=28pin AVR128DB28 (128KiB+16KiB)

AVRDB_noloader.menu.01_variant.AVR64DB28.build.board=AVR_AVR64DB28
AVRDB_noloader.menu.01_variant.AVR64DB28.build.mcu=avr64db28
AVRDB_noloader.menu.01_variant.AVR64DB28.build.variant=avr_db28
AVRDB_noloader.menu.01_variant.AVR64DB28.build.linker_script=avrxmega2_p512.x
AVRDB_noloader.menu.01_variant.AVR64DB28.upload.maximum_data_size=8192
AVRDB_noloader.menu.01_variant.AVR64DB28.upload.maximum_size=65536
AVRDB_noloader.menu.01_variant.AVR64DB28=28pin AVR64DB28 (64KiB+8KiB)

AVRDB_noloader.menu.01_variant.AVR32DB28.build.board=AVR_AVR32DB28
AVRDB_noloader.menu.01_variant.AVR32DB28.build.mcu=avr32db28
AVRDB_noloader.menu.01_variant.AVR32DB28.build.variant=avr_db28
AVRDB_noloader.menu.01_variant.AVR32DB28.build.linker_script=avrxmega3_p512.x
AVRDB_noloader.menu.01_variant.AVR32DB28.upload.maximum_data_size=4096
AVRDB_noloader.menu.01_variant.AVR32DB28.upload.maximum_size=32768
AVRDB_noloader.menu.01_variant.AVR32DB28=28pin AVR32DB28 (32KiB+4KiB)

AVRDB_noloader.menu.02_clock.24MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.24MHz.build.f_cpu=24000000L
AVRDB_noloader.menu.02_clock.24MHz=Internal 24 MHz (default)

AVRDB_noloader.menu.02_clock.12MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.12MHz.build.f_cpu=12000000L
AVRDB_noloader.menu.02_clock.12MHz=Internal 12 MHz

AVRDB_noloader.menu.02_clock.6MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.6MHz.build.f_cpu=6000000L
AVRDB_noloader.menu.02_clock.6MHz=Internal 6 MHz

AVRDB_noloader.menu.02_clock.3MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.3MHz.build.f_cpu=3000000L
AVRDB_noloader.menu.02_clock.3MHz=Internal 3 MHz

AVRDB_noloader.menu.02_clock.separator1=-

AVRDB_noloader.menu.02_clock.20MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.20MHz.build.f_cpu=20000000L
AVRDB_noloader.menu.02_clock.20MHz=Internal 20 MHz

AVRDB_noloader.menu.02_clock.10MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.10MHz.build.f_cpu=10000000L
AVRDB_noloader.menu.02_clock.10MHz=Internal 10 MHz

