askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDB_noloader.menu.02_clock.5MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.5MHz.build.f_cpu=5000000L
AVRDB_noloader.menu.02_clock.5MHz=Internal 5 MHz

AVRDB_noloader.menu.02_clock.separator2=-

AVRDB_noloader.menu.02_clock.16MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.16MHz.build.f_cpu=16000000L
AVRDB_noloader.menu.02_clock.16MHz=Internal 16 MHz

AVRDB_noloader.menu.02_clock.8MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.8MHz.build.f_cpu=8000000L
AVRDB_noloader.menu.02_clock.8MHz=Internal 8 MHz

AVRDB_noloader.menu.02_clock.4MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.4MHz.build.f_cpu=4000000L
AVRDB_noloader.menu.02_clock.4MHz=Internal 4 MHz

AVRDB_noloader.menu.02_clock.2MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.2MHz.build.f_cpu=2000000L
AVRDB_noloader.menu.02_clock.2MHz=Internal 2 MHz

AVRDB_noloader.menu.02_clock.1MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.1MHz.build.f_cpu=1000000L
AVRDB_noloader.menu.02_clock.1MHz=Internal 1 MHz

AVRDB_noloader.menu.02_clock.separator3=-

AVRDB_noloader.menu.02_clock.32MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.32MHz.build.f_cpu=32000000L
AVRDB_noloader.menu.02_clock.32MHz=Internal 32 MHz (OVERCLOCK)

AVRDB_noloader.menu.02_clock.28MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.28MHz.build.f_cpu=28000000L
AVRDB_noloader.menu.02_clock.28MHz=Internal 28 MHz (OVERCLOCK)

AVRDB_noloader.menu.02_clock.14MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.14MHz.build.f_cpu=14000000L
AVRDB_noloader.menu.02_clock.14MHz=Internal 14 MHz (OVERCLOCK)

AVRDB_noloader.menu.02_clock.7MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.7MHz.build.f_cpu=7000000L
AVRDB_noloader.menu.02_clock.7MHz=Internal 7 MHz (OVERCLOCK)

AVRDB_noloader.menu.02_clock.separator4=-

AVRDB_noloader.menu.02_clock.32768Hz.bootloader.bod_sample=1
AVRDB_noloader.menu.02_clock.32768Hz.build.f_cpu=32768L
AVRDB_noloader.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRDB_noloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRDB_noloader.menu.11_BODMODE.Disabled=Disabled
# AVRDB_noloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRDB_noloader.menu.11_BODMODE.Enabled=Enabled
# AVRDB_noloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRDB_noloader.menu.11_BODMODE.Sampled=Sampled
# AVRDB_noloader.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRDB_noloader.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRDB_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDB_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDB_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDB_noloader.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDB_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDB_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDB_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDB_noloader.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRDB_noloader.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRDB_noloader.menu.21_resetpin.Reset=Reset

AVRDB_noloader.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRDB_noloader.menu.21_resetpin.Gpio=GPIO (input only)

AVRDB_noloader.menu.23_mvsyscfg.Dual.bootloader.mvsys_bit=01
AVRDB_noloader.menu.23_mvsyscfg.Dual="Dual" (default)

AVRDB_noloader.menu.23_mvsyscfg.Single.bootloader.mvsys_bit=10
AVRDB_noloader.menu.23_mvsyscfg.Single="Single"

AVRDB_noloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRDB_noloader.menu.24_eeprom.Retained=Save guard "Retained"

AVRDB_noloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRDB_noloader.menu.24_eeprom.Erase=Save guard "Erase"

AVRDB_noloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRDB_noloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRDB_noloader.menu.24_eeprom.Upload=Upload ".eep" file

AVRDB_noloader.menu.26_userrow.Retained=Save guard "Retained"

AVRDB_noloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRDB_noloader.menu.26_userrow.Upload=Upload ".urow" file

AVRDB_noloader.menu.27_fusefile.Menu=Specify in the MENU

AVRDB_noloader.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
AVRDB_noloader.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

AVRDB_noloader.menu.51_buildopt.Release=Release (default)

AVRDB_noloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRDB_noloader.menu.51_buildopt.Debug1=DEBUG=1

AVRDB_noloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRDB_noloader.menu.51_buildopt.Debug2=DEBUG=2

AVRDB_noloader.menu.52_macroapi.Enable=Macro API Enable (default)

AVRDB_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRDB_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRDB_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRDB_noloader.menu.52_macroapi.Disable.build.macroapi=
AVRDB_noloader.menu.52_macroapi.Disable=Macro API Disable

AVRDB_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRDB_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDB_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRDB_noloader.menu.53_printf.Default=Integer Only

AVRDB_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRDB_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDB_noloader.menu.53_printf.Full=Float Support

AVRDB_noloader.menu.54_console_select.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDB_noloader.menu.54_console_select.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRDB_noloader.menu.54_console_select.separator1=-

AVRDB_noloader.menu.54_console_select.UART2_F0_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7
AVRDB_noloader.menu.54_console_select.UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7

AVRDB_noloader.menu.54_console_select.UART2_F4_LA7.build.console_select=-DSerial=Serial2B -DLED_BUILTIN=PIN_PA7
AVRDB_noloader.menu.54_console_select.UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48/64pin only)

AVRDB_noloader.menu.54_console_select.separator1=-

AVRDB_noloader.menu.54_console_select.UART3_B0_LB3_SB2_Curiosity=UART3 TX:PB0 RX:PB1 LED=PB3 SW=PB2 (AVR128DB48 Curiosity Nano)
AVRDB_noloader.menu.54_console_select.UART3_B0_LB3_SB2_Curiosity.build.console_select=-DSerial=Serial3A -DLED_BUILTIN=PIN_PB3 -DSW_BUILTIN=PIN_PB2

AVRDB_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB_noloader.menu.90_console_baud.9600bps=9600 bps (default)

AVRDB_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDB_noloader.menu.90_console_baud.38400bps=38400 bps

