askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDB_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDB_noloader.menu.90_console_baud.57600bps=57600 bps

AVRDB_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDB_noloader.menu.90_console_baud.115200bps=115200 bps

AVRDB_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDB_noloader.menu.90_console_baud.230400bps=230400 bps

AVRDB_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDB_noloader.menu.90_console_baud.500000bps=500000 bps

AVRDB_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDB_noloader.menu.90_console_baud.1000000bps=1000000 bps

AVRDB_noloader.menu.90_console_baud.separator1=-

AVRDB_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDB_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)


AVRDA_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDA_noloader.bootloader.OSCCFG=0x00
AVRDA_noloader.bootloader.PINCFG=0x00
AVRDA_noloader.bootloader.HWMONCFG=0x00
AVRDA_noloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}00{bootloader.eesave_bit}
AVRDA_noloader.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDA_noloader.bootloader.CODESIZE=0x00
AVRDA_noloader.bootloader.BOOTSIZE=0x00
AVRDA_noloader.bootloader.bod_lvl=000
AVRDA_noloader.bootloader.bod_mode=00
AVRDA_noloader.bootloader.bod_sample=0
AVRDA_noloader.bootloader.eepupload=
AVRDA_noloader.bootloader.browupload=
AVRDA_noloader.bootloader.urowupload=
AVRDA_noloader.bootloader.fuseupload={bootloader.fuses}
AVRDA_noloader.bootloader.eesave_bit=1
AVRDA_noloader.bootloader.mvsys_bit=01
AVRDA_noloader.bootloader.reset_bit=1
AVRDA_noloader.bootloader.updi_bit=1
AVRDA_noloader.bootloader.tool=avrdude
AVRDA_noloader.bootloader.file=empty/empty.hex
AVRDA_noloader.bootloader.programed_type=
AVRDA_noloader.build.console_select=
AVRDA_noloader.build.export_merged_output=false
AVRDA_noloader.build.text_section_start=.text=0x0
AVRDA_noloader.build.buildopt=-DNDEBUG
AVRDA_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRDA_noloader.build.macroapi=-DENABLE_MACRO_API
AVRDA_noloader.build.printf=
AVRDA_noloader.build.printflt=
AVRDA_noloader.build.f_cpu=24000000L
AVRDA_noloader.compiler.ldflags=
AVRDA_noloader.compiler.c.elf.extra_flags=
AVRDA_noloader.upload.speed=115200
AVRDA_noloader.upload.tool=

AVRDA_noloader.menu.01_variant.AVR128DA64.build.board=AVR_AVR128DA64
AVRDA_noloader.menu.01_variant.AVR128DA64.build.mcu=avr128da64
AVRDA_noloader.menu.01_variant.AVR128DA64.build.variant=avr_da64
AVRDA_noloader.menu.01_variant.AVR128DA64.build.linker_script=avrxmega4_p512.x
AVRDA_noloader.menu.01_variant.AVR128DA64.upload.maximum_data_size=16384
AVRDA_noloader.menu.01_variant.AVR128DA64.upload.maximum_size=131072
AVRDA_noloader.menu.01_variant.AVR128DA64=64pin AVR128DA64 (128KiB+16KiB)

AVRDA_noloader.menu.01_variant.AVR128DA64S.build.board=AVR_AVR128DA64S
AVRDA_noloader.menu.01_variant.AVR128DA64S.build.mcu=avr128da64s
AVRDA_noloader.menu.01_variant.AVR128DA64S.build.variant=avr_da64
AVRDA_noloader.menu.01_variant.AVR128DA64S.build.linker_script=avrxmega4_p512.x
AVRDA_noloader.menu.01_variant.AVR128DA64S.upload.maximum_data_size=16384
AVRDA_noloader.menu.01_variant.AVR128DA64S.upload.maximum_size=131072
AVRDA_noloader.menu.01_variant.AVR128DA64S=64pin AVR128DA64S (128KiB+16KiB)

AVRDA_noloader.menu.01_variant.AVR64DA64.build.board=AVR_AVR64DA64
AVRDA_noloader.menu.01_variant.AVR64DA64.build.mcu=avr64da64
AVRDA_noloader.menu.01_variant.AVR64DA64.build.variant=avr_da64
AVRDA_noloader.menu.01_variant.AVR64DA64.build.linker_script=avrxmega2_p512.x
AVRDA_noloader.menu.01_variant.AVR64DA64.upload.maximum_data_size=8192
AVRDA_noloader.menu.01_variant.AVR64DA64.upload.maximum_size=65536
AVRDA_noloader.menu.01_variant.AVR64DA64=64pin AVR64DA64 (64KiB+8KiB)

AVRDA_noloader.menu.01_variant.separator1=-

AVRDA_noloader.menu.01_variant.AVR128DA48.build.board=AVR_AVR128DA48
AVRDA_noloader.menu.01_variant.AVR128DA48.build.mcu=avr128da48
AVRDA_noloader.menu.01_variant.AVR128DA48.build.variant=avr_da48
AVRDA_noloader.menu.01_variant.AVR128DA48.build.linker_script=avrxmega4_p512.x
AVRDA_noloader.menu.01_variant.AVR128DA48.upload.maximum_data_size=16384
AVRDA_noloader.menu.01_variant.AVR128DA48.upload.maximum_size=131072
AVRDA_noloader.menu.01_variant.AVR128DA48=48pin AVR128DA48 (128KiB+16KiB)

AVRDA_noloader.menu.01_variant.AVR128DA48S.build.board=AVR_AVR128DA48S
AVRDA_noloader.menu.01_variant.AVR128DA48S.build.mcu=avr128da48s
AVRDA_noloader.menu.01_variant.AVR128DA48S.build.variant=avr_da48
AVRDA_noloader.menu.01_variant.AVR128DA48S.build.linker_script=avrxmega4_p512.x
AVRDA_noloader.menu.01_variant.AVR128DA48S.upload.maximum_data_size=16384
AVRDA_noloader.menu.01_variant.AVR128DA48S.upload.maximum_size=131072
AVRDA_noloader.menu.01_variant.AVR128DA48S=48pin AVR128DA48S (128KiB+16KiB)

AVRDA_noloader.menu.01_variant.AVR64DA48.build.board=AVR_AVR64DA48
AVRDA_noloader.menu.01_variant.AVR64DA48.build.mcu=avr64da48
AVRDA_noloader.menu.01_variant.AVR64DA48.build.variant=avr_da48
AVRDA_noloader.menu.01_variant.AVR64DA48.build.linker_script=avrxmega2_p512.x
AVRDA_noloader.menu.01_variant.AVR64DA48.upload.maximum_data_size=8192
AVRDA_noloader.menu.01_variant.AVR64DA48.upload.maximum_size=65536
AVRDA_noloader.menu.01_variant.AVR64DA48=48pin AVR64DA48 (64KiB+8KiB)

AVRDA_noloader.menu.01_variant.AVR64DA48S.build.board=AVR_AVR64DA48S
AVRDA_noloader.menu.01_variant.AVR64DA48S.build.mcu=avr64da48s
AVRDA_noloader.menu.01_variant.AVR64DA48S.build.variant=avr_da48
AVRDA_noloader.menu.01_variant.AVR64DA48S.build.linker_script=avrxmega2_p512.x
AVRDA_noloader.menu.01_variant.AVR64DA48S.upload.maximum_data_size=8192
AVRDA_noloader.menu.01_variant.AVR64DA48S.upload.maximum_size=65536
AVRDA_noloader.menu.01_variant.AVR64DA48S=48pin AVR64DA48S (64KiB+8KiB)

AVRDA_noloader.menu.01_variant.AVR32DA48.build.board=AVR_AVR32DA48
AVRDA_noloader.menu.01_variant.AVR32DA48.build.mcu=avr32da48
AVRDA_noloader.menu.01_variant.AVR32DA48.build.variant=avr_da48
AVRDA_noloader.menu.01_variant.AVR32DA48.build.linker_script=avrxmega3_p512.x
AVRDA_noloader.menu.01_variant.AVR32DA48.upload.maximum_data_size=4096
AVRDA_noloader.menu.01_variant.AVR32DA48.upload.maximum_size=32768
AVRDA_noloader.menu.01_variant.AVR32DA48=48pin AVR32DA48 (32KiB+4KiB)

AVRDA_noloader.menu.01_variant.AVR32DA48S.build.board=AVR_AVR32DA48S
AVRDA_noloader.menu.01_variant.AVR32DA48S.build.mcu=avr32da48s
AVRDA_noloader.menu.01_variant.AVR32DA48S.build.variant=avr_da48
AVRDA_noloader.menu.01_variant.AVR32DA48S.build.linker_script=avrxmega3_p512.x
AVRDA_noloader.menu.01_variant.AVR32DA48S.upload.maximum_data_size=4096
AVRDA_noloader.menu.01_variant.AVR32DA48S.upload.maximum_size=32768
AVRDA_noloader.menu.01_variant.AVR32DA48S=48pin AVR32DA48S (32KiB+4KiB)

AVRDA_noloader.menu.01_variant.separator1=-

AVRDA_noloader.menu.01_variant.AVR128DA32.build.board=AVR_AVR128DA32
AVRDA_noloader.menu.01_variant.AVR128DA32.build.mcu=avr128da32
AVRDA_noloader.menu.01_variant.AVR128DA32.build.variant=avr_da32
AVRDA_noloader.menu.01_variant.AVR128DA32.build.linker_script=avrxmega4_p512.x
AVRDA_noloader.menu.01_variant.AVR128DA32.upload.maximum_data_size=16384
AVRDA_noloader.menu.01_variant.AVR128DA32.upload.maximum_size=131072
AVRDA_noloader.menu.01_variant.AVR128DA32=32pin AVR128DA32 (128KiB+16KiB)

AVRDA_noloader.menu.01_variant.AVR128DA32S.build.board=AVR_AVR128DA32S
AVRDA_noloader.menu.01_variant.AVR128DA32S.build.mcu=avr128da32s
AVRDA_noloader.menu.01_variant.AVR128DA32S.build.variant=avr_da32
AVRDA_noloader.menu.01_variant.AVR128DA32S.build.linker_script=avrxmega4_p512.x
AVRDA_noloader.menu.01_variant.AVR128DA32S.upload.maximum_data_size=16384
AVRDA_noloader.menu.01_variant.AVR128DA32S.upload.maximum_size=131072
AVRDA_noloader.menu.01_variant.AVR128DA32S=32pin AVR128DA32S (128KiB+16KiB)

AVRDA_noloader.menu.01_variant.AVR64DA32.build.board=AVR_AVR64DA32
AVRDA_noloader.menu.01_variant.AVR64DA32.build.mcu=avr64da32
AVRDA_noloader.menu.01_variant.AVR64DA32.build.variant=avr_da32
AVRDA_noloader.menu.01_variant.AVR64DA32.build.linker_script=avrxmega2_p512.x
AVRDA_noloader.menu.01_variant.AVR64DA32.upload.maximum_data_size=8192
AVRDA_noloader.menu.01_variant.AVR64DA32.upload.maximum_size=65536
AVRDA_noloader.menu.01_variant.AVR64DA32=32pin AVR64DA32 (64KiB+8KiB)

AVRDA_noloader.menu.01_variant.AVR64DA32S.build.board=AVR_AVR64DA32S
AVRDA_noloader.menu.01_variant.AVR64DA32S.build.mcu=avr64da32s
AVRDA_noloader.menu.01_variant.AVR64DA32S.build.variant=avr_da32
AVRDA_noloader.menu.01_variant.AVR64DA32S.build.linker_script=avrxmega2_p512.x
AVRDA_noloader.menu.01_variant.AVR64DA32S.upload.maximum_data_size=8192
AVRDA_noloader.menu.01_variant.AVR64DA32S.upload.maximum_size=65536
AVRDA_noloader.menu.01_variant.AVR64DA32S=32pin AVR64DA32S (64KiB+8KiB)

AVRDA_noloader.menu.01_variant.AVR32DA32.build.board=AVR_AVR32DA32
AVRDA_noloader.menu.01_variant.AVR32DA32.build.mcu=avr32da32
AVRDA_noloader.menu.01_variant.AVR32DA32.build.variant=avr_da32
AVRDA_noloader.menu.01_variant.AVR32DA32.build.linker_script=avrxmega3_p512.x
AVRDA_noloader.menu.01_variant.AVR32DA32.upload.maximum_data_size=4096
AVRDA_noloader.menu.01_variant.AVR32DA32.upload.maximum_size=32768
AVRDA_noloader.menu.01_variant.AVR32DA32=32pin AVR32DA32 (32KiB+4KiB)

