askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDA_noloader.menu.01_variant.AVR32DA32S.build.board=AVR_AVR32DA32S
AVRDA_noloader.menu.01_variant.AVR32DA32S.build.mcu=avr32da32s
AVRDA_noloader.menu.01_variant.AVR32DA32S.build.variant=avr_da32
AVRDA_noloader.menu.01_variant.AVR32DA32S.build.linker_script=avrxmega3_p512.x
AVRDA_noloader.menu.01_variant.AVR32DA32S.upload.maximum_data_size=4096
AVRDA_noloader.menu.01_variant.AVR32DA32S.upload.maximum_size=32768
AVRDA_noloader.menu.01_variant.AVR32DA32S=32pin AVR32DA32S (32KiB+4KiB)

AVRDA_noloader.menu.01_variant.separator2=-

AVRDA_noloader.menu.01_variant.AVR128DA28.build.board=AVR_AVR128DA28
AVRDA_noloader.menu.01_variant.AVR128DA28.build.mcu=avr128da28
AVRDA_noloader.menu.01_variant.AVR128DA28.build.variant=avr_da28
AVRDA_noloader.menu.01_variant.AVR128DA28.build.linker_script=avrxmega4_p512.x
AVRDA_noloader.menu.01_variant.AVR128DA28.upload.maximum_data_size=16384
AVRDA_noloader.menu.01_variant.AVR128DA28.upload.maximum_size=131072
AVRDA_noloader.menu.01_variant.AVR128DA28=28pin AVR128DA28 (128KiB+16KiB)

AVRDA_noloader.menu.01_variant.AVR128DA28S.build.board=AVR_AVR128DA28S
AVRDA_noloader.menu.01_variant.AVR128DA28S.build.mcu=avr128da28s
AVRDA_noloader.menu.01_variant.AVR128DA28S.build.variant=avr_da28
AVRDA_noloader.menu.01_variant.AVR128DA28S.build.linker_script=avrxmega4_p512.x
AVRDA_noloader.menu.01_variant.AVR128DA28S.upload.maximum_data_size=16384
AVRDA_noloader.menu.01_variant.AVR128DA28S.upload.maximum_size=131072
AVRDA_noloader.menu.01_variant.AVR128DA28S=28pin AVR128DA28S (128KiB+16KiB)

AVRDA_noloader.menu.01_variant.AVR64DA28.build.board=AVR_AVR64DA28
AVRDA_noloader.menu.01_variant.AVR64DA28.build.mcu=avr64da28
AVRDA_noloader.menu.01_variant.AVR64DA28.build.variant=avr_da28
AVRDA_noloader.menu.01_variant.AVR64DA28.build.linker_script=avrxmega2_p512.x
AVRDA_noloader.menu.01_variant.AVR64DA28.upload.maximum_data_size=8192
AVRDA_noloader.menu.01_variant.AVR64DA28.upload.maximum_size=65536
AVRDA_noloader.menu.01_variant.AVR64DA28=28pin AVR64DA28 (64KiB+8KiB)

AVRDA_noloader.menu.01_variant.AVR64DA28S.build.board=AVR_AVR64DA28S
AVRDA_noloader.menu.01_variant.AVR64DA28S.build.mcu=avr64da28s
AVRDA_noloader.menu.01_variant.AVR64DA28S.build.variant=avr_da28
AVRDA_noloader.menu.01_variant.AVR64DA28S.build.linker_script=avrxmega2_p512.x
AVRDA_noloader.menu.01_variant.AVR64DA28S.upload.maximum_data_size=8192
AVRDA_noloader.menu.01_variant.AVR64DA28S.upload.maximum_size=65536
AVRDA_noloader.menu.01_variant.AVR64DA28S=28pin AVR64DA28S (64KiB+8KiB)

AVRDA_noloader.menu.01_variant.AVR32DA28.build.board=AVR_AVR32DA28
AVRDA_noloader.menu.01_variant.AVR32DA28.build.mcu=avr32da28
AVRDA_noloader.menu.01_variant.AVR32DA28.build.variant=avr_da28
AVRDA_noloader.menu.01_variant.AVR32DA28.build.linker_script=avrxmega3_p512.x
AVRDA_noloader.menu.01_variant.AVR32DA28.upload.maximum_data_size=4096
AVRDA_noloader.menu.01_variant.AVR32DA28.upload.maximum_size=32768
AVRDA_noloader.menu.01_variant.AVR32DA28=28pin AVR32DA28 (32KiB+4KiB)

AVRDA_noloader.menu.01_variant.AVR32DA28S.build.board=AVR_AVR32DA28S
AVRDA_noloader.menu.01_variant.AVR32DA28S.build.mcu=avr32da28s
AVRDA_noloader.menu.01_variant.AVR32DA28S.build.variant=avr_da28
AVRDA_noloader.menu.01_variant.AVR32DA28S.build.linker_script=avrxmega3_p512.x
AVRDA_noloader.menu.01_variant.AVR32DA28S.upload.maximum_data_size=4096
AVRDA_noloader.menu.01_variant.AVR32DA28S.upload.maximum_size=32768
AVRDA_noloader.menu.01_variant.AVR32DA28S=28pin AVR32DA28S (32KiB+4KiB)

AVRDA_noloader.menu.02_clock.24MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.24MHz.build.f_cpu=24000000L
AVRDA_noloader.menu.02_clock.24MHz=Internal 24 MHz (default)

AVRDA_noloader.menu.02_clock.12MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.12MHz.build.f_cpu=12000000L
AVRDA_noloader.menu.02_clock.12MHz=Internal 12 MHz

AVRDA_noloader.menu.02_clock.6MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.6MHz.build.f_cpu=6000000L
AVRDA_noloader.menu.02_clock.6MHz=Internal 6 MHz

AVRDA_noloader.menu.02_clock.3MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.3MHz.build.f_cpu=3000000L
AVRDA_noloader.menu.02_clock.3MHz=Internal 3 MHz

AVRDA_noloader.menu.02_clock.separator1=-

AVRDA_noloader.menu.02_clock.20MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.20MHz.build.f_cpu=20000000L
AVRDA_noloader.menu.02_clock.20MHz=Internal 20 MHz

AVRDA_noloader.menu.02_clock.10MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.10MHz.build.f_cpu=10000000L
AVRDA_noloader.menu.02_clock.10MHz=Internal 10 MHz

AVRDA_noloader.menu.02_clock.5MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.5MHz.build.f_cpu=5000000L
AVRDA_noloader.menu.02_clock.5MHz=Internal 5 MHz

AVRDA_noloader.menu.02_clock.separator2=-

AVRDA_noloader.menu.02_clock.16MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.16MHz.build.f_cpu=16000000L
AVRDA_noloader.menu.02_clock.16MHz=Internal 16 MHz

AVRDA_noloader.menu.02_clock.8MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.8MHz.build.f_cpu=8000000L
AVRDA_noloader.menu.02_clock.8MHz=Internal 8 MHz

AVRDA_noloader.menu.02_clock.4MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.4MHz.build.f_cpu=4000000L
AVRDA_noloader.menu.02_clock.4MHz=Internal 4 MHz

AVRDA_noloader.menu.02_clock.2MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.2MHz.build.f_cpu=2000000L
AVRDA_noloader.menu.02_clock.2MHz=Internal 2 MHz

AVRDA_noloader.menu.02_clock.1MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.1MHz.build.f_cpu=1000000L
AVRDA_noloader.menu.02_clock.1MHz=Internal 1 MHz

AVRDA_noloader.menu.02_clock.separator3=-

AVRDA_noloader.menu.02_clock.32MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.32MHz.build.f_cpu=32000000L
AVRDA_noloader.menu.02_clock.32MHz=Internal 32 MHz (OVERCLOCK)

AVRDA_noloader.menu.02_clock.28MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.28MHz.build.f_cpu=28000000L
AVRDA_noloader.menu.02_clock.28MHz=Internal 28 MHz (OVERCLOCK)

AVRDA_noloader.menu.02_clock.14MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.14MHz.build.f_cpu=14000000L
AVRDA_noloader.menu.02_clock.14MHz=Internal 14 MHz (OVERCLOCK)

AVRDA_noloader.menu.02_clock.7MHz.bootloader.bod_sample=0
AVRDA_noloader.menu.02_clock.7MHz.build.f_cpu=7000000L
AVRDA_noloader.menu.02_clock.7MHz=Internal 7 MHz (OVERCLOCK)

AVRDA_noloader.menu.02_clock.separator4=-

AVRDA_noloader.menu.02_clock.32768Hz.bootloader.bod_sample=1
AVRDA_noloader.menu.02_clock.32768Hz.build.f_cpu=32768L
AVRDA_noloader.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRDA_noloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRDA_noloader.menu.11_BODMODE.Disabled=Disabled
# AVRDA_noloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRDA_noloader.menu.11_BODMODE.Enabled=Enabled
# AVRDA_noloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRDA_noloader.menu.11_BODMODE.Sampled=Sampled
# AVRDA_noloader.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRDA_noloader.menu.11_BODMODE.EnableWait=Enabled hold wakeup

