askn37/multix-zinnia-sdk-modernAVR/boards.txt
# AVRDA_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDA_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDA_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDA_noloader.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDA_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDA_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDA_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDA_noloader.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRDA_noloader.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRDA_noloader.menu.21_resetpin.Reset=Reset

AVRDA_noloader.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRDA_noloader.menu.21_resetpin.Gpio=GPIO (input only)

AVRDA_noloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRDA_noloader.menu.24_eeprom.Retained=Save guard "Retained"

AVRDA_noloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRDA_noloader.menu.24_eeprom.Erase=Save guard "Erase"

AVRDA_noloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRDA_noloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRDA_noloader.menu.24_eeprom.Upload=Upload ".eep" file

AVRDA_noloader.menu.26_userrow.Retained=Save guard "Retained"

AVRDA_noloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRDA_noloader.menu.26_userrow.Upload=Upload ".urow" file

AVRDA_noloader.menu.27_fusefile.Menu=Specify in the MENU

AVRDA_noloader.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
AVRDA_noloader.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

AVRDA_noloader.menu.51_buildopt.Release=Release (default)

AVRDA_noloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRDA_noloader.menu.51_buildopt.Debug1=DEBUG=1

AVRDA_noloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRDA_noloader.menu.51_buildopt.Debug2=DEBUG=2

AVRDA_noloader.menu.52_macroapi.Enable=Macro API Enable (default)

AVRDA_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRDA_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRDA_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRDA_noloader.menu.52_macroapi.Disable.build.macroapi=
AVRDA_noloader.menu.52_macroapi.Disable=Macro API Disable

AVRDA_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRDA_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDA_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRDA_noloader.menu.53_printf.Default=Integer Only

AVRDA_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRDA_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDA_noloader.menu.53_printf.Full=Float Support

AVRDA_noloader.menu.54_console_select.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDA_noloader.menu.54_console_select.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRDA_noloader.menu.54_console_select.separator1=-

AVRDA_noloader.menu.54_console_select.UART2_F0_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7
AVRDA_noloader.menu.54_console_select.UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7

AVRDA_noloader.menu.54_console_select.UART2_F4_LA7.build.console_select=-DSerial=Serial2B -DLED_BUILTIN=PIN_PA7
AVRDA_noloader.menu.54_console_select.UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48/64pin only)

AVRDA_noloader.menu.54_console_select.separator1=-

AVRDA_noloader.menu.54_console_select.UART1_C0_LC6_SC7_Curiosity=UART1 TX:PC0 RX:PC1 LED=PC6 SW=PC7 (AVR128DA48 Curiosity Nano)
AVRDA_noloader.menu.54_console_select.UART1_C0_LC6_SC7_Curiosity.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PC6 -DSW_BUILTIN=PIN_PC7

AVRDA_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDA_noloader.menu.90_console_baud.9600bps=9600 bps (default)

AVRDA_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDA_noloader.menu.90_console_baud.38400bps=38400 bps

AVRDA_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDA_noloader.menu.90_console_baud.57600bps=57600 bps

AVRDA_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDA_noloader.menu.90_console_baud.115200bps=115200 bps

AVRDA_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDA_noloader.menu.90_console_baud.230400bps=230400 bps

AVRDA_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDA_noloader.menu.90_console_baud.500000bps=500000 bps

AVRDA_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDA_noloader.menu.90_console_baud.1000000bps=1000000 bps

AVRDA_noloader.menu.90_console_baud.separator1=-

AVRDA_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDA_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)


AVRDD_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDD_noloader.bootloader.OSCCFG=0x00
AVRDD_noloader.bootloader.PINCFG=0x00
AVRDD_noloader.bootloader.HWMONCFG=0x00
AVRDD_noloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}00{bootloader.eesave_bit}
AVRDD_noloader.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDD_noloader.bootloader.CODESIZE=0x00
AVRDD_noloader.bootloader.BOOTSIZE=0x00
AVRDD_noloader.bootloader.bod_lvl=000
AVRDD_noloader.bootloader.bod_mode=00
AVRDD_noloader.bootloader.bod_sample=0
AVRDD_noloader.bootloader.eepupload=
AVRDD_noloader.bootloader.browupload=
AVRDD_noloader.bootloader.urowupload=
AVRDD_noloader.bootloader.fuseupload={bootloader.fuses}
AVRDD_noloader.bootloader.eesave_bit=1
AVRDD_noloader.bootloader.mvsys_bit=01
AVRDD_noloader.bootloader.reset_bit=1
AVRDD_noloader.bootloader.updi_bit=1
AVRDD_noloader.bootloader.tool=avrdude
AVRDD_noloader.bootloader.file=empty/empty.hex
AVRDD_noloader.bootloader.programed_type=
AVRDD_noloader.build.console_select=
AVRDD_noloader.build.export_merged_output=false
AVRDD_noloader.build.text_section_start=.text=0x0
AVRDD_noloader.build.buildopt=-DNDEBUG
AVRDD_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD_noloader.build.macroapi=-DENABLE_MACRO_API
AVRDD_noloader.build.printf=
AVRDD_noloader.build.printflt=
AVRDD_noloader.build.f_cpu=24000000L
AVRDD_noloader.compiler.ldflags=
AVRDD_noloader.compiler.c.elf.extra_flags=
AVRDD_noloader.upload.speed=115200
AVRDD_noloader.upload.tool=

AVRDD_noloader.menu.01_variant.AVR64DD32.build.board=AVR_AVR64DD32
AVRDD_noloader.menu.01_variant.AVR64DD32.build.mcu=avr64dd32
AVRDD_noloader.menu.01_variant.AVR64DD32.build.variant=avr_dd32
AVRDD_noloader.menu.01_variant.AVR64DD32.build.linker_script=avrxmega2_p512.x
AVRDD_noloader.menu.01_variant.AVR64DD32.upload.maximum_data_size=8192
AVRDD_noloader.menu.01_variant.AVR64DD32.upload.maximum_size=65536
AVRDD_noloader.menu.01_variant.AVR64DD32=32pin AVR64DD32 (64KiB+8KiB)

AVRDD_noloader.menu.01_variant.AVR32DD32.build.board=AVR_AVR32DD32
AVRDD_noloader.menu.01_variant.AVR32DD32.build.mcu=avr32dd32
AVRDD_noloader.menu.01_variant.AVR32DD32.build.variant=avr_dd32
AVRDD_noloader.menu.01_variant.AVR32DD32.build.linker_script=avrxmega3_p512.x
AVRDD_noloader.menu.01_variant.AVR32DD32.upload.maximum_data_size=4096
AVRDD_noloader.menu.01_variant.AVR32DD32.upload.maximum_size=32768
AVRDD_noloader.menu.01_variant.AVR32DD32=32pin AVR32DD32 (32KiB+4KiB)

