askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDD_noloader.menu.01_variant.AVR16DD32.build.board=AVR_AVR16DD32
AVRDD_noloader.menu.01_variant.AVR16DD32.build.mcu=avr16dd32
AVRDD_noloader.menu.01_variant.AVR16DD32.build.variant=avr_dd32
AVRDD_noloader.menu.01_variant.AVR16DD32.build.linker_script=avrxmega3_p512.x
AVRDD_noloader.menu.01_variant.AVR16DD32.upload.maximum_data_size=2048
AVRDD_noloader.menu.01_variant.AVR16DD32.upload.maximum_size=16384
AVRDD_noloader.menu.01_variant.AVR16DD32=32pin AVR16DD32 (16KiB+2KiB)

AVRDD_noloader.menu.01_variant.separator1=-

AVRDD_noloader.menu.01_variant.AVR64DD28.build.board=AVR_AVR64DD28
AVRDD_noloader.menu.01_variant.AVR64DD28.build.mcu=avr64dd28
AVRDD_noloader.menu.01_variant.AVR64DD28.build.variant=avr_dd28
AVRDD_noloader.menu.01_variant.AVR64DD28.build.linker_script=avrxmega2_p512.x
AVRDD_noloader.menu.01_variant.AVR64DD28.upload.maximum_data_size=8192
AVRDD_noloader.menu.01_variant.AVR64DD28.upload.maximum_size=65536
AVRDD_noloader.menu.01_variant.AVR64DD28=28pin AVR64DD28 (64KiB+8KiB)

AVRDD_noloader.menu.01_variant.AVR32DD28.build.board=AVR_AVR32DD28
AVRDD_noloader.menu.01_variant.AVR32DD28.build.mcu=avr32dd28
AVRDD_noloader.menu.01_variant.AVR32DD28.build.variant=avr_dd28
AVRDD_noloader.menu.01_variant.AVR32DD28.build.linker_script=avrxmega3_p512.x
AVRDD_noloader.menu.01_variant.AVR32DD28.upload.maximum_data_size=4096
AVRDD_noloader.menu.01_variant.AVR32DD28.upload.maximum_size=32768
AVRDD_noloader.menu.01_variant.AVR32DD28=28pin AVR32DD28 (32KiB+4KiB)

AVRDD_noloader.menu.01_variant.AVR16DD28.build.board=AVR_AVR16DD28
AVRDD_noloader.menu.01_variant.AVR16DD28.build.mcu=avr16dd28
AVRDD_noloader.menu.01_variant.AVR16DD28.build.variant=avr_dd28
AVRDD_noloader.menu.01_variant.AVR16DD28.build.linker_script=avrxmega3_p512.x
AVRDD_noloader.menu.01_variant.AVR16DD28.upload.maximum_data_size=2048
AVRDD_noloader.menu.01_variant.AVR16DD28.upload.maximum_size=16384
AVRDD_noloader.menu.01_variant.AVR16DD28=28pin AVR16DD28 (16KiB+2KiB)

AVRDD_noloader.menu.01_variant.separator2=-

AVRDD_noloader.menu.01_variant.AVR64DD20.build.board=AVR_AVR64DD20
AVRDD_noloader.menu.01_variant.AVR64DD20.build.mcu=avr64dd20
AVRDD_noloader.menu.01_variant.AVR64DD20.build.variant=avr_dd20
AVRDD_noloader.menu.01_variant.AVR64DD20.build.linker_script=avrxmega2_p512.x
AVRDD_noloader.menu.01_variant.AVR64DD20.upload.maximum_data_size=8192
AVRDD_noloader.menu.01_variant.AVR64DD20.upload.maximum_size=65536
AVRDD_noloader.menu.01_variant.AVR64DD20=20pin AVR64DD20 (64KiB+8KiB)

AVRDD_noloader.menu.01_variant.AVR32DD20.build.board=AVR_AVR32DD20
AVRDD_noloader.menu.01_variant.AVR32DD20.build.mcu=avr32dd20
AVRDD_noloader.menu.01_variant.AVR32DD20.build.variant=avr_dd20
AVRDD_noloader.menu.01_variant.AVR32DD20.build.linker_script=avrxmega3_p512.x
AVRDD_noloader.menu.01_variant.AVR32DD20.upload.maximum_data_size=4096
AVRDD_noloader.menu.01_variant.AVR32DD20.upload.maximum_size=32768
AVRDD_noloader.menu.01_variant.AVR32DD20=20pin AVR32DD20 (32KiB+4KiB)

AVRDD_noloader.menu.01_variant.AVR16DD20.build.board=AVR_AVR16DD20
AVRDD_noloader.menu.01_variant.AVR16DD20.build.mcu=avr16dd20
AVRDD_noloader.menu.01_variant.AVR16DD20.build.variant=avr_dd20
AVRDD_noloader.menu.01_variant.AVR16DD20.build.linker_script=avrxmega3_p512.x
AVRDD_noloader.menu.01_variant.AVR16DD20.upload.maximum_data_size=2048
AVRDD_noloader.menu.01_variant.AVR16DD20.upload.maximum_size=16384
AVRDD_noloader.menu.01_variant.AVR16DD20=20pin AVR16DD20 (16KiB+2KiB)

AVRDD_noloader.menu.01_variant.separator3=-

AVRDD_noloader.menu.01_variant.AVR64DD14.build.board=AVR_AVR64DD14
AVRDD_noloader.menu.01_variant.AVR64DD14.build.mcu=avr64dd14
AVRDD_noloader.menu.01_variant.AVR64DD14.build.variant=avr_dd14
AVRDD_noloader.menu.01_variant.AVR64DD14.build.linker_script=avrxmega2_p512.x
AVRDD_noloader.menu.01_variant.AVR64DD14.upload.maximum_data_size=8192
AVRDD_noloader.menu.01_variant.AVR64DD14.upload.maximum_size=65536
AVRDD_noloader.menu.01_variant.AVR64DD14=14pin AVR64DD14 (64KiB+8KiB)

AVRDD_noloader.menu.01_variant.AVR32DD14.build.board=AVR_AVR32DD14
AVRDD_noloader.menu.01_variant.AVR32DD14.build.mcu=avr32dd14
AVRDD_noloader.menu.01_variant.AVR32DD14.build.variant=avr_dd14
AVRDD_noloader.menu.01_variant.AVR32DD14.build.linker_script=avrxmega3_p512.x
AVRDD_noloader.menu.01_variant.AVR32DD14.upload.maximum_data_size=4096
AVRDD_noloader.menu.01_variant.AVR32DD14.upload.maximum_size=32768
AVRDD_noloader.menu.01_variant.AVR32DD14=14pin AVR32DD14 (32KiB+4KiB)

AVRDD_noloader.menu.01_variant.AVR16DD14.build.board=AVR_AVR16DD14
AVRDD_noloader.menu.01_variant.AVR16DD14.build.mcu=avr16dd14
AVRDD_noloader.menu.01_variant.AVR16DD14.build.variant=avr_dd14
AVRDD_noloader.menu.01_variant.AVR16DD14.build.linker_script=avrxmega3_p512.x
AVRDD_noloader.menu.01_variant.AVR16DD14.upload.maximum_data_size=2048
AVRDD_noloader.menu.01_variant.AVR16DD14.upload.maximum_size=16384
AVRDD_noloader.menu.01_variant.AVR16DD14=14pin AVR16DD14 (16KiB+2KiB)

AVRDD_noloader.menu.02_clock.24MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.24MHz.build.f_cpu=24000000L
AVRDD_noloader.menu.02_clock.24MHz=Internal 24 MHz (default)

AVRDD_noloader.menu.02_clock.12MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.12MHz.build.f_cpu=12000000L
AVRDD_noloader.menu.02_clock.12MHz=Internal 12 MHz

AVRDD_noloader.menu.02_clock.6MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.6MHz.build.f_cpu=6000000L
AVRDD_noloader.menu.02_clock.6MHz=Internal 6 MHz

AVRDD_noloader.menu.02_clock.3MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.3MHz.build.f_cpu=3000000L
AVRDD_noloader.menu.02_clock.3MHz=Internal 3 MHz

AVRDD_noloader.menu.02_clock.separator1=-

AVRDD_noloader.menu.02_clock.20MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.20MHz.build.f_cpu=20000000L
AVRDD_noloader.menu.02_clock.20MHz=Internal 20 MHz

AVRDD_noloader.menu.02_clock.10MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.10MHz.build.f_cpu=10000000L
AVRDD_noloader.menu.02_clock.10MHz=Internal 10 MHz

AVRDD_noloader.menu.02_clock.5MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.5MHz.build.f_cpu=5000000L
AVRDD_noloader.menu.02_clock.5MHz=Internal 5 MHz

