askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDD_noloader.menu.02_clock.separator2=-

AVRDD_noloader.menu.02_clock.16MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.16MHz.build.f_cpu=16000000L
AVRDD_noloader.menu.02_clock.16MHz=Internal 16 MHz

AVRDD_noloader.menu.02_clock.8MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.8MHz.build.f_cpu=8000000L
AVRDD_noloader.menu.02_clock.8MHz=Internal 8 MHz

AVRDD_noloader.menu.02_clock.4MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.4MHz.build.f_cpu=4000000L
AVRDD_noloader.menu.02_clock.4MHz=Internal 4 MHz

AVRDD_noloader.menu.02_clock.2MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.2MHz.build.f_cpu=2000000L
AVRDD_noloader.menu.02_clock.2MHz=Internal 2 MHz

AVRDD_noloader.menu.02_clock.1MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.1MHz.build.f_cpu=1000000L
AVRDD_noloader.menu.02_clock.1MHz=Internal 1 MHz

AVRDD_noloader.menu.02_clock.separator3=-

AVRDD_noloader.menu.02_clock.32MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.32MHz.build.f_cpu=32000000L
AVRDD_noloader.menu.02_clock.32MHz=Internal 32 MHz (OVERCLOCK)

AVRDD_noloader.menu.02_clock.28MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.28MHz.build.f_cpu=28000000L
AVRDD_noloader.menu.02_clock.28MHz=Internal 28 MHz (OVERCLOCK)

AVRDD_noloader.menu.02_clock.14MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.14MHz.build.f_cpu=14000000L
AVRDD_noloader.menu.02_clock.14MHz=Internal 14 MHz (OVERCLOCK)

AVRDD_noloader.menu.02_clock.7MHz.bootloader.bod_sample=0
AVRDD_noloader.menu.02_clock.7MHz.build.f_cpu=7000000L
AVRDD_noloader.menu.02_clock.7MHz=Internal 7 MHz (OVERCLOCK)

AVRDD_noloader.menu.02_clock.separator4=-

AVRDD_noloader.menu.02_clock.32768Hz.bootloader.bod_sample=1
AVRDD_noloader.menu.02_clock.32768Hz.build.f_cpu=32768L
AVRDD_noloader.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRDD_noloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRDD_noloader.menu.11_BODMODE.Disabled=Disabled
# AVRDD_noloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRDD_noloader.menu.11_BODMODE.Enabled=Enabled
# AVRDD_noloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRDD_noloader.menu.11_BODMODE.Sampled=Sampled
# AVRDD_noloader.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRDD_noloader.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRDD_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDD_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDD_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDD_noloader.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDD_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDD_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDD_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDD_noloader.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRDD_noloader.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRDD_noloader.menu.21_resetpin.Reset=Reset

AVRDD_noloader.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRDD_noloader.menu.21_resetpin.Gpio=GPIO (input only)

# AVRDD_noloader.menu.22_updipin.Updi.bootloader.updi_bit=1
# AVRDD_noloader.menu.22_updipin.Updi=PF7 pin=UPDI (default)

# AVRDD_noloader.menu.22_updipin.Gpio.bootloader.updi_bit=0
# AVRDD_noloader.menu.22_updipin.Gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)

AVRDD_noloader.menu.23_mvsyscfg.Dual.bootloader.mvsys_bit=01
AVRDD_noloader.menu.23_mvsyscfg.Dual="Dual" (default)

AVRDD_noloader.menu.23_mvsyscfg.Single.bootloader.mvsys_bit=10
AVRDD_noloader.menu.23_mvsyscfg.Single="Single"

AVRDD_noloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRDD_noloader.menu.24_eeprom.Retained=Save guard "Retained"

AVRDD_noloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRDD_noloader.menu.24_eeprom.Erase=Save guard "Erase"

AVRDD_noloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRDD_noloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRDD_noloader.menu.24_eeprom.Upload=Upload ".eep" file

AVRDD_noloader.menu.26_userrow.Retained=Save guard "Retained"

AVRDD_noloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRDD_noloader.menu.26_userrow.Upload=Upload ".urow" file

AVRDD_noloader.menu.27_fusefile.Menu=Specify in the MENU

AVRDD_noloader.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
AVRDD_noloader.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

AVRDD_noloader.menu.51_buildopt.Release=Release (default)

AVRDD_noloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRDD_noloader.menu.51_buildopt.Debug1=DEBUG=1

AVRDD_noloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRDD_noloader.menu.51_buildopt.Debug2=DEBUG=2

AVRDD_noloader.menu.52_macroapi.Enable=Macro API Enable (default)

AVRDD_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRDD_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRDD_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRDD_noloader.menu.52_macroapi.Disable.build.macroapi=
AVRDD_noloader.menu.52_macroapi.Disable=Macro API Disable

AVRDD_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRDD_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDD_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRDD_noloader.menu.53_printf.Default=Integer Only

AVRDD_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRDD_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDD_noloader.menu.53_printf.Full=Float Support

AVRDD_noloader.menu.54_console_select.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDD_noloader.menu.54_console_select.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRDD_noloader.menu.54_console_select.separator1=-

AVRDD_noloader.menu.54_console_select.UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVRDD_noloader.menu.54_console_select.UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3 (14pin)

