askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDD_noloader.menu.54_console_select.UART1_D6_LC3.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PC3
AVRDD_noloader.menu.54_console_select.UART1_D6_LC3=UART1 TX:PD6 RX:PD7 LED=PC3 (14pin)

AVRDD_noloader.menu.54_console_select.separator1=-

AVRDD_noloader.menu.54_console_select.UART0_D4_LF5_SF6_Curiosity=UART0 TX:PD4 RX:PD5 LED=PF5 SW=PF6 (AVR64DD32 Curiosity Nano)
AVRDD_noloader.menu.54_console_select.UART0_D4_LF5_SF6_Curiosity.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6

AVRDD_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD_noloader.menu.90_console_baud.9600bps=9600 bps (default)

AVRDD_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDD_noloader.menu.90_console_baud.38400bps=38400 bps

AVRDD_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDD_noloader.menu.90_console_baud.57600bps=57600 bps

AVRDD_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDD_noloader.menu.90_console_baud.115200bps=115200 bps

AVRDD_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDD_noloader.menu.90_console_baud.230400bps=230400 bps

AVRDD_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDD_noloader.menu.90_console_baud.500000bps=500000 bps

AVRDD_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDD_noloader.menu.90_console_baud.1000000bps=1000000 bps

AVRDD_noloader.menu.90_console_baud.separator1=-

AVRDD_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDD_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)


AVRDU_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDU_noloader.bootloader.OSCCFG=0x00
AVRDU_noloader.bootloader.PINCFG=0x00
AVRDU_noloader.bootloader.HWMONCFG=0x00
AVRDU_noloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRDU_noloader.bootloader.SYSCFG1=0b000{bootloader.usbsink_bit}000
AVRDU_noloader.bootloader.CODESIZE=0x00
AVRDU_noloader.bootloader.BOOTSIZE=0x00
AVRDU_noloader.bootloader.bod_lvl=000
AVRDU_noloader.bootloader.bod_mode=00
AVRDU_noloader.bootloader.bod_sample=0
AVRDU_noloader.bootloader.eepupload=
AVRDU_noloader.bootloader.browupload=
AVRDU_noloader.bootloader.urowupload=
AVRDU_noloader.bootloader.fuseupload={bootloader.fuses}
AVRDU_noloader.bootloader.eesave_bit=1
AVRDU_noloader.bootloader.browsave_bit=1
AVRDU_noloader.bootloader.usbsink_bit=01
AVRDU_noloader.bootloader.reset_bit=1
AVRDU_noloader.bootloader.updi_bit=1
AVRDU_noloader.bootloader.tool=avrdude
AVRDU_noloader.bootloader.file=empty/empty.hex
AVRDU_noloader.bootloader.programed_type=
AVRDU_noloader.build.console_select=
AVRDU_noloader.build.export_merged_output=false
AVRDU_noloader.build.text_section_start=.text=0x0
AVRDU_noloader.build.buildopt=-DNDEBUG
AVRDU_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU_noloader.build.macroapi=-DENABLE_MACRO_API
AVRDU_noloader.build.printf=
AVRDU_noloader.build.printflt=
AVRDU_noloader.build.f_cpu=20000000L
AVRDU_noloader.compiler.ldflags=
AVRDU_noloader.compiler.c.elf.extra_flags=
AVRDU_noloader.upload.speed=115200
AVRDU_noloader.upload.tool=

AVRDU_noloader.menu.01_variant.AVR64DU32.build.board=AVR_AVR64DU32
AVRDU_noloader.menu.01_variant.AVR64DU32.build.mcu=avr64du32
AVRDU_noloader.menu.01_variant.AVR64DU32.build.variant=avr_du32
AVRDU_noloader.menu.01_variant.AVR64DU32.build.linker_script=avrxmega2_p512.x
AVRDU_noloader.menu.01_variant.AVR64DU32.upload.maximum_data_size=8192
AVRDU_noloader.menu.01_variant.AVR64DU32.upload.maximum_size=65536
AVRDU_noloader.menu.01_variant.AVR64DU32=32pin AVR64DU32 (64KiB+8KiB)

AVRDU_noloader.menu.01_variant.AVR32DU32.build.board=AVR_AVR32DU32
AVRDU_noloader.menu.01_variant.AVR32DU32.build.mcu=avr32du32
AVRDU_noloader.menu.01_variant.AVR32DU32.build.variant=avr_du32
AVRDU_noloader.menu.01_variant.AVR32DU32.build.linker_script=avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.AVR32DU32.upload.maximum_data_size=4096
AVRDU_noloader.menu.01_variant.AVR32DU32.upload.maximum_size=32768
AVRDU_noloader.menu.01_variant.AVR32DU32=32pin AVR32DU32 (32KiB+4KiB)

AVRDU_noloader.menu.01_variant.AVR16DU32.build.board=AVR_AVR16DU32
AVRDU_noloader.menu.01_variant.AVR16DU32.build.mcu=avr16du32
AVRDU_noloader.menu.01_variant.AVR16DU32.build.variant=avr_du32
AVRDU_noloader.menu.01_variant.AVR16DU32.build.linker_script=avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.AVR16DU32.upload.maximum_data_size=2048
AVRDU_noloader.menu.01_variant.AVR16DU32.upload.maximum_size=16384
AVRDU_noloader.menu.01_variant.AVR16DU32=32pin AVR16DU32 (16KiB+2KiB)

AVRDU_noloader.menu.01_variant.separator1=-

AVRDU_noloader.menu.01_variant.AVR64DU28.build.board=AVR_AVR64DU28
AVRDU_noloader.menu.01_variant.AVR64DU28.build.mcu=avr64du28
AVRDU_noloader.menu.01_variant.AVR64DU28.build.variant=avr_du28
AVRDU_noloader.menu.01_variant.AVR64DU28.build.linker_script=avrxmega2_p512.x
AVRDU_noloader.menu.01_variant.AVR64DU28.upload.maximum_data_size=8192
AVRDU_noloader.menu.01_variant.AVR64DU28.upload.maximum_size=65536
AVRDU_noloader.menu.01_variant.AVR64DU28=28pin AVR64DU28 (64KiB+8KiB)

AVRDU_noloader.menu.01_variant.AVR32DU28.build.board=AVR_AVR32DU28
AVRDU_noloader.menu.01_variant.AVR32DU28.build.mcu=avr32du28
AVRDU_noloader.menu.01_variant.AVR32DU28.build.variant=avr_du28
AVRDU_noloader.menu.01_variant.AVR32DU28.build.linker_script=avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.AVR32DU28.upload.maximum_data_size=4096
AVRDU_noloader.menu.01_variant.AVR32DU28.upload.maximum_size=32768
AVRDU_noloader.menu.01_variant.AVR32DU28=28pin AVR32DU28 (32KiB+4KiB)

AVRDU_noloader.menu.01_variant.AVR16DU28.build.board=AVR_AVR16DU28
AVRDU_noloader.menu.01_variant.AVR16DU28.build.mcu=avr16du28
AVRDU_noloader.menu.01_variant.AVR16DU28.build.variant=avr_du28
AVRDU_noloader.menu.01_variant.AVR16DU28.build.linker_script=avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.AVR16DU28.upload.maximum_data_size=2048
AVRDU_noloader.menu.01_variant.AVR16DU28.upload.maximum_size=16384
AVRDU_noloader.menu.01_variant.AVR16DU28=28pin AVR16DU28 (16KiB+2KiB)

AVRDU_noloader.menu.01_variant.separator2=-

AVRDU_noloader.menu.01_variant.AVR32DU20.build.board=AVR_AVR32DU20
AVRDU_noloader.menu.01_variant.AVR32DU20.build.mcu=avr32dU20
AVRDU_noloader.menu.01_variant.AVR32DU20.build.variant=avr_dU20
AVRDU_noloader.menu.01_variant.AVR32DU20.build.linker_script=avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.AVR32DU20.upload.maximum_data_size=4096
AVRDU_noloader.menu.01_variant.AVR32DU20.upload.maximum_size=32768
AVRDU_noloader.menu.01_variant.AVR32DU20=20pin AVR32DU20 (32KiB+4KiB)

AVRDU_noloader.menu.01_variant.AVR16DU20.build.board=AVR_AVR16DU20
AVRDU_noloader.menu.01_variant.AVR16DU20.build.mcu=avr16du20
AVRDU_noloader.menu.01_variant.AVR16DU20.build.variant=avr_du20
AVRDU_noloader.menu.01_variant.AVR16DU20.build.linker_script=avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.AVR16DU20.upload.maximum_data_size=2048
AVRDU_noloader.menu.01_variant.AVR16DU20.upload.maximum_size=16384
AVRDU_noloader.menu.01_variant.AVR16DU20=20pin AVR16DU20 (16KiB+2KiB)

AVRDU_noloader.menu.01_variant.separator3=-

AVRDU_noloader.menu.01_variant.AVR32DU14.build.board=AVR_AVR32DU14
AVRDU_noloader.menu.01_variant.AVR32DU14.build.mcu=avr32du14
AVRDU_noloader.menu.01_variant.AVR32DU14.build.variant=avr_du14
AVRDU_noloader.menu.01_variant.AVR32DU14.build.linker_script=avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.AVR32DU14.upload.maximum_data_size=4096
AVRDU_noloader.menu.01_variant.AVR32DU14.upload.maximum_size=32768
AVRDU_noloader.menu.01_variant.AVR32DU14=14pin AVR32DU14 (32KiB+4KiB)

AVRDU_noloader.menu.01_variant.AVR16DU14.build.board=AVR_AVR16DU14
AVRDU_noloader.menu.01_variant.AVR16DU14.build.mcu=avr16du14
AVRDU_noloader.menu.01_variant.AVR16DU14.build.variant=avr_du14
AVRDU_noloader.menu.01_variant.AVR16DU14.build.linker_script=avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.AVR16DU14.upload.maximum_data_size=2048
AVRDU_noloader.menu.01_variant.AVR16DU14.upload.maximum_size=16384
AVRDU_noloader.menu.01_variant.AVR16DU14=14pin AVR16DU14 (16KiB+2KiB)

