askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDU_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRDU_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRDU_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRDU_noloader.menu.52_macroapi.Disable.build.macroapi=
AVRDU_noloader.menu.52_macroapi.Disable=Macro API Disable

AVRDU_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRDU_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDU_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRDU_noloader.menu.53_printf.Default=Integer Only

AVRDU_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRDU_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDU_noloader.menu.53_printf.Full=Float Support

AVRDU_noloader.menu.54_console_select.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDU_noloader.menu.54_console_select.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRDU_noloader.menu.54_console_select.separator1=-

AVRDU_noloader.menu.54_console_select.UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVRDU_noloader.menu.54_console_select.UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3 (14pin)

AVRDU_noloader.menu.54_console_select.UART1_D6_LC3.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PC3
AVRDU_noloader.menu.54_console_select.UART1_D6_LC3=UART1 TX:PD6 RX:PD7 LED=PC3 (14pin)

AVRDU_noloader.menu.54_console_select.separator1=-

AVRDU_noloader.menu.54_console_select.UART1_D6_LF2_SF6_Curiosity=UART1 TX:PD6 RX:PD7 LED=PF2 SW=PF6 (AVR64DU32 Curiosity Nano)
AVRDU_noloader.menu.54_console_select.UART1_D6_LF2_SF6_Curiosity.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PF2 -DSW_BUILTIN=PIN_PF6

AVRDU_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU_noloader.menu.90_console_baud.9600bps=9600 bps (default)

AVRDU_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDU_noloader.menu.90_console_baud.38400bps=38400 bps

AVRDU_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDU_noloader.menu.90_console_baud.57600bps=57600 bps

AVRDU_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDU_noloader.menu.90_console_baud.115200bps=115200 bps

AVRDU_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDU_noloader.menu.90_console_baud.230400bps=230400 bps

AVRDU_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDU_noloader.menu.90_console_baud.500000bps=500000 bps

AVRDU_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDU_noloader.menu.90_console_baud.1000000bps=1000000 bps

AVRDU_noloader.menu.90_console_baud.separator1=-

AVRDU_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDU_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)


AVREA_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVREA_noloader.bootloader.OSCCFG=0x00
AVREA_noloader.bootloader.PINCFG=0x00
AVREA_noloader.bootloader.HWMONCFG=0x00
AVREA_noloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}01{bootloader.eesave_bit}
AVREA_noloader.bootloader.SYSCFG1=0x07
AVREA_noloader.bootloader.CODESIZE=0x00
AVREA_noloader.bootloader.BOOTSIZE=0x00
AVREA_noloader.bootloader.bod_lvl=000
AVREA_noloader.bootloader.bod_mode=00
AVREA_noloader.bootloader.bod_sample=0
AVREA_noloader.bootloader.eepupload=
AVREA_noloader.bootloader.browupload=
AVREA_noloader.bootloader.urowupload=
AVREA_noloader.bootloader.fuseupload={bootloader.fuses}
AVREA_noloader.bootloader.eesave_bit=1
AVREA_noloader.bootloader.reset_bit=1
AVREA_noloader.bootloader.updi_bit=1
AVREA_noloader.bootloader.tool=avrdude
AVREA_noloader.bootloader.file=empty/empty.hex
AVREA_noloader.bootloader.programed_type=
AVREA_noloader.build.console_select=
AVREA_noloader.build.export_merged_output=false
AVREA_noloader.build.text_section_start=.text=0x0
AVREA_noloader.build.buildopt=-DNDEBUG
AVREA_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVREA_noloader.build.macroapi=-DENABLE_MACRO_API
AVREA_noloader.build.printf=
AVREA_noloader.build.printflt=
AVREA_noloader.build.f_cpu=20000000L
AVREA_noloader.compiler.ldflags=
AVREA_noloader.compiler.c.elf.extra_flags=
AVREA_noloader.upload.speed=115200
AVREA_noloader.upload.tool=

AVREA_noloader.menu.01_variant.AVR64EA48.build.board=AVR_AVR64EA48
AVREA_noloader.menu.01_variant.AVR64EA48.build.mcu=avr64ea48
AVREA_noloader.menu.01_variant.AVR64EA48.build.variant=avr_ea48
AVREA_noloader.menu.01_variant.AVR64EA48.build.linker_script=avrxmega2_p128.x
AVREA_noloader.menu.01_variant.AVR64EA48.upload.maximum_data_size=6144
AVREA_noloader.menu.01_variant.AVR64EA48.upload.maximum_size=65536
AVREA_noloader.menu.01_variant.AVR64EA48=48pin AVR64EA48 (64KiB+6KiB)

AVREA_noloader.menu.01_variant.AVR32EA48.build.board=AVR_AVR32EA48
AVREA_noloader.menu.01_variant.AVR32EA48.build.mcu=avr32ea48
AVREA_noloader.menu.01_variant.AVR32EA48.build.variant=avr_ea48
AVREA_noloader.menu.01_variant.AVR32EA48.build.linker_script=avrxmega3_p64.x
AVREA_noloader.menu.01_variant.AVR32EA48.upload.maximum_data_size=4096
AVREA_noloader.menu.01_variant.AVR32EA48.upload.maximum_size=32768
AVREA_noloader.menu.01_variant.AVR32EA48=48pin AVR32EA48 (32KiB+4KiB)

AVREA_noloader.menu.01_variant.AVR16EA48.build.board=AVR_AVR16EA48
AVREA_noloader.menu.01_variant.AVR16EA48.build.mcu=avr16ea48
AVREA_noloader.menu.01_variant.AVR16EA48.build.variant=avr_ea48
AVREA_noloader.menu.01_variant.AVR16EA48.build.linker_script=avrxmega3_p64.x
AVREA_noloader.menu.01_variant.AVR16EA48.upload.maximum_data_size=2048
AVREA_noloader.menu.01_variant.AVR16EA48.upload.maximum_size=16384
AVREA_noloader.menu.01_variant.AVR16EA48=48pin AVR16EA48 (16KiB+2KiB)

AVREA_noloader.menu.01_variant.separator1=-

AVREA_noloader.menu.01_variant.AVR64EA32.build.board=AVR_AVR64EA32
AVREA_noloader.menu.01_variant.AVR64EA32.build.mcu=avr64ea32
AVREA_noloader.menu.01_variant.AVR64EA32.build.variant=avr_ea32
AVREA_noloader.menu.01_variant.AVR64EA32.build.linker_script=avrxmega2_p128.x
AVREA_noloader.menu.01_variant.AVR64EA32.upload.maximum_data_size=6144
AVREA_noloader.menu.01_variant.AVR64EA32.upload.maximum_size=65536
AVREA_noloader.menu.01_variant.AVR64EA32=32pin AVR64EA32 (64KiB+6KiB)

AVREA_noloader.menu.01_variant.AVR32EA32.build.board=AVR_AVR32EA32
AVREA_noloader.menu.01_variant.AVR32EA32.build.mcu=avr32ea32
AVREA_noloader.menu.01_variant.AVR32EA32.build.variant=avr_ea32
AVREA_noloader.menu.01_variant.AVR32EA32.build.linker_script=avrxmega3_p64.x
AVREA_noloader.menu.01_variant.AVR32EA32.upload.maximum_data_size=4096
AVREA_noloader.menu.01_variant.AVR32EA32.upload.maximum_size=32768
AVREA_noloader.menu.01_variant.AVR32EA32=32pin AVR32EA32 (32KiB+4KiB)

