askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVREA_noloader.menu.01_variant.AVR16EA32.build.board=AVR_AVR16EA32
AVREA_noloader.menu.01_variant.AVR16EA32.build.mcu=avr16ea32
AVREA_noloader.menu.01_variant.AVR16EA32.build.variant=avr_ea32
AVREA_noloader.menu.01_variant.AVR16EA32.build.linker_script=avrxmega3_p64.x
AVREA_noloader.menu.01_variant.AVR16EA32.upload.maximum_data_size=2048
AVREA_noloader.menu.01_variant.AVR16EA32.upload.maximum_size=16384
AVREA_noloader.menu.01_variant.AVR16EA32=32pin AVR16EA32 (16KiB+2KiB)

AVREA_noloader.menu.01_variant.separator2=-

AVREA_noloader.menu.01_variant.AVR64EA28.build.board=AVR_AVR64EA28
AVREA_noloader.menu.01_variant.AVR64EA28.build.mcu=avr64ea28
AVREA_noloader.menu.01_variant.AVR64EA28.build.variant=avr_ea28
AVREA_noloader.menu.01_variant.AVR64EA28.build.linker_script=avrxmega2_p128.x
AVREA_noloader.menu.01_variant.AVR64EA28.upload.maximum_data_size=6144
AVREA_noloader.menu.01_variant.AVR64EA28.upload.maximum_size=65536
AVREA_noloader.menu.01_variant.AVR64EA28=28pin AVR64EA28 (64KiB+6KiB)

AVREA_noloader.menu.01_variant.AVR32EA28.build.board=AVR_AVR32EA28
AVREA_noloader.menu.01_variant.AVR32EA28.build.mcu=avr32ea28
AVREA_noloader.menu.01_variant.AVR32EA28.build.variant=avr_ea28
AVREA_noloader.menu.01_variant.AVR32EA28.build.linker_script=avrxmega3_p64.x
AVREA_noloader.menu.01_variant.AVR32EA28.upload.maximum_data_size=4096
AVREA_noloader.menu.01_variant.AVR32EA28.upload.maximum_size=32768
AVREA_noloader.menu.01_variant.AVR32EA28=28pin AVR32EA28 (32KiB+4KiB)

AVREA_noloader.menu.01_variant.AVR16EA28.build.board=AVR_AVR16EA28
AVREA_noloader.menu.01_variant.AVR16EA28.build.mcu=avr16ea28
AVREA_noloader.menu.01_variant.AVR16EA28.build.variant=avr_ea28
AVREA_noloader.menu.01_variant.AVR16EA28.build.linker_script=avrxmega3_p64.x
AVREA_noloader.menu.01_variant.AVR16EA28.upload.maximum_data_size=2048
AVREA_noloader.menu.01_variant.AVR16EA28.upload.maximum_size=16384
AVREA_noloader.menu.01_variant.AVR16EA28=28pin AVR16EA28 (16KiB+2KiB)

AVREA_noloader.menu.03_clock.20MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.20MHz.build.f_cpu=20000000L
AVREA_noloader.menu.03_clock.20MHz=Internal 20 MHz

AVREA_noloader.menu.03_clock.10MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.10MHz.build.f_cpu=10000000L
AVREA_noloader.menu.03_clock.10MHz=Internal 10 MHz

AVREA_noloader.menu.03_clock.5MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.5MHz.build.f_cpu=5000000L
AVREA_noloader.menu.03_clock.5MHz=Internal 5 MHz

AVREA_noloader.menu.03_clock.separator1=-

AVREA_noloader.menu.03_clock.16MHz.bootloader.OSCCFG=0b00001000
AVREA_noloader.menu.03_clock.16MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.16MHz.build.f_cpu=16000000L
AVREA_noloader.menu.03_clock.16MHz=Internal 16 MHz

AVREA_noloader.menu.03_clock.8MHz.bootloader.OSCCFG=0b00001000
AVREA_noloader.menu.03_clock.8MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.8MHz.build.f_cpu=8000000L
AVREA_noloader.menu.03_clock.8MHz=Internal 8 MHz

AVREA_noloader.menu.03_clock.4MHz.bootloader.OSCCFG=0b00001000
AVREA_noloader.menu.03_clock.4MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.4MHz.build.f_cpu=4000000L

AVREA_noloader.menu.03_clock.4MHz=Internal 4 MHz

AVREA_noloader.menu.03_clock.1MHz.bootloader.OSCCFG=0b00001000
AVREA_noloader.menu.03_clock.1MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.1MHz.build.f_cpu=1000000L

AVREA_noloader.menu.03_clock.1MHz=Internal 1 MHz

AVREA_noloader.menu.03_clock.separator2=-

AVREA_noloader.menu.03_clock.2MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.2MHz.build.f_cpu=2000000L
AVREA_noloader.menu.03_clock.2MHz=Internal 2 MHz

AVREA_noloader.menu.03_clock.32768Hz.bootloader.bod_sample=1
AVREA_noloader.menu.03_clock.32768Hz.build.f_cpu=32768L
AVREA_noloader.menu.03_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVREA_noloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVREA_noloader.menu.11_BODMODE.Disabled=Disabled
# AVREA_noloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVREA_noloader.menu.11_BODMODE.Enabled=Enabled
# AVREA_noloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVREA_noloader.menu.11_BODMODE.Sampled=Sampled
# AVREA_noloader.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVREA_noloader.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVREA_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVREA_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.75V (default)
# AVREA_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVREA_noloader.menu.12_BODLVL.BODLEVEL1=Level 1.90V
# AVREA_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVREA_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.60V
# AVREA_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVREA_noloader.menu.12_BODLVL.BODLEVEL3=Level 4.30V

AVREA_noloader.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVREA_noloader.menu.21_resetpin.Reset=Reset

AVREA_noloader.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVREA_noloader.menu.21_resetpin.Gpio=GPIO (input only)

# AVREA_noloader.menu.22_updipin.Updi.bootloader.updi_bit=1
# AVREA_noloader.menu.22_updipin.Updi=PF7 pin=UPDI (default)

# AVREA_noloader.menu.22_updipin.Gpio.bootloader.updi_bit=0
# AVREA_noloader.menu.22_updipin.Gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)

AVREA_noloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVREA_noloader.menu.24_eeprom.Retained=Save guard "Retained"

AVREA_noloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVREA_noloader.menu.24_eeprom.Erase=Save guard "Erase"

AVREA_noloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVREA_noloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVREA_noloader.menu.24_eeprom.Upload=Upload ".eep" file

AVREA_noloader.menu.26_userrow.Retained=Save guard "Retained"

AVREA_noloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVREA_noloader.menu.26_userrow.Upload=Upload ".urow" file

AVREA_noloader.menu.27_fusefile.Menu=Specify in the MENU

AVREA_noloader.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
AVREA_noloader.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

