askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVREA_noloader.menu.51_buildopt.Release=Release (default)

AVREA_noloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVREA_noloader.menu.51_buildopt.Debug1=DEBUG=1

AVREA_noloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVREA_noloader.menu.51_buildopt.Debug2=DEBUG=2

AVREA_noloader.menu.52_macroapi.Enable=Macro API Enable (default)

AVREA_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVREA_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVREA_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVREA_noloader.menu.52_macroapi.Disable.build.macroapi=
AVREA_noloader.menu.52_macroapi.Disable=Macro API Disable

AVREA_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVREA_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVREA_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

AVREA_noloader.menu.53_printf.Default=Integer Only

AVREA_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVREA_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVREA_noloader.menu.53_printf.Full=Float Support

AVREA_noloader.menu.54_console_select.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVREA_noloader.menu.54_console_select.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVREA_noloader.menu.54_console_select.separator1=-

AVREA_noloader.menu.54_console_select.UART1_C0_LA7.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PA7
AVREA_noloader.menu.54_console_select.UART1_C0_LA7=UART1 TX:PC0 RX:PC1 LED=PA7

AVREA_noloader.menu.54_console_select.UART2_F0_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7
AVREA_noloader.menu.54_console_select.UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7

AVREA_noloader.menu.54_console_select.separator1=-

AVREA_noloader.menu.54_console_select.UART1_C0_LB3_SC2_Curiosity=UART1 TX:PC0 RX:PC1 LED=PB3 SW=PB2 (AVR64EA48 Curiosity Nano)
AVREA_noloader.menu.54_console_select.UART1_C0_LB3_SC2_Curiosity.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PB3 -DSW_BUILTIN=PIN_PB2

AVREA_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVREA_noloader.menu.90_console_baud.9600bps=9600 bps (default)

AVREA_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVREA_noloader.menu.90_console_baud.38400bps=38400 bps

AVREA_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVREA_noloader.menu.90_console_baud.57600bps=57600 bps

AVREA_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVREA_noloader.menu.90_console_baud.115200bps=115200 bps

AVREA_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVREA_noloader.menu.90_console_baud.230400bps=230400 bps

AVREA_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVREA_noloader.menu.90_console_baud.500000bps=500000 bps

AVREA_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVREA_noloader.menu.90_console_baud.1000000bps=1000000 bps

AVREA_noloader.menu.90_console_baud.separator1=-

AVREA_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVREA_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)


AVREB_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVREB_noloader.bootloader.OSCCFG=0x00
AVREB_noloader.bootloader.PINCFG=0xFF
AVREB_noloader.bootloader.HWMONCFG=0xFF
AVREB_noloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.browsave_bit}{bootloader.eesave_bit}
AVREB_noloader.bootloader.SYSCFG1=0x07
AVREB_noloader.bootloader.CODESIZE=0x00
AVREB_noloader.bootloader.BOOTSIZE=0x00
AVREB_noloader.bootloader.bod_lvl=000
AVREB_noloader.bootloader.bod_mode=00
AVREB_noloader.bootloader.bod_sample=0
AVREB_noloader.bootloader.eepupload=
AVREB_noloader.bootloader.browupload=
AVREB_noloader.bootloader.urowupload=
AVREB_noloader.bootloader.fuseupload={bootloader.fuses}
AVREB_noloader.bootloader.eesave_bit=1
AVREB_noloader.bootloader.browsave_bit=1
AVREB_noloader.bootloader.reset_bit=1
AVREB_noloader.bootloader.updi_bit=1
AVREB_noloader.bootloader.tool=avrdude
AVREB_noloader.bootloader.file=empty/empty.hex
AVREB_noloader.bootloader.programed_type=
AVREB_noloader.build.console_select=
AVREB_noloader.build.export_merged_output=false
AVREB_noloader.build.text_section_start=.text=0x0
AVREB_noloader.build.buildopt=-DNDEBUG
AVREB_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVREB_noloader.build.macroapi=-DENABLE_MACRO_API
AVREB_noloader.build.printf=
AVREB_noloader.build.printflt=
AVREB_noloader.build.f_cpu=20000000L
AVREB_noloader.compiler.ldflags=
AVREB_noloader.compiler.c.elf.extra_flags=
AVREB_noloader.upload.speed=115200
AVREB_noloader.upload.tool=

AVREB_noloader.menu.01_variant.AVR32EB32.build.board=AVR_AVR32EB32
AVREB_noloader.menu.01_variant.AVR32EB32.build.mcu=avr32eb32
AVREB_noloader.menu.01_variant.AVR32EB32.build.variant=avr_eb32
AVREB_noloader.menu.01_variant.AVR32EB32.build.linker_script=avrxmega3_p64.x
AVREB_noloader.menu.01_variant.AVR32EB32.upload.maximum_data_size=3072
AVREB_noloader.menu.01_variant.AVR32EB32.upload.maximum_size=32768
AVREB_noloader.menu.01_variant.AVR32EB32=32pin AVR32EB32 (32KiB+3KiB)

AVREB_noloader.menu.01_variant.AVR16EB32.build.board=AVR_AVR16EB32
AVREB_noloader.menu.01_variant.AVR16EB32.build.mcu=avr16eb32
AVREB_noloader.menu.01_variant.AVR16EB32.build.variant=avr_eb32
AVREB_noloader.menu.01_variant.AVR16EB32.build.linker_script=avrxmega3_p64.x
AVREB_noloader.menu.01_variant.AVR16EB32.upload.maximum_data_size=2048
AVREB_noloader.menu.01_variant.AVR16EB32.upload.maximum_size=16384
AVREB_noloader.menu.01_variant.AVR16EB32=32pin AVR16EB32 (16KiB+2KiB)

AVREB_noloader.menu.01_variant.separator1=-

AVREB_noloader.menu.01_variant.AVR32EB28.build.board=AVR_AVR32EB28
AVREB_noloader.menu.01_variant.AVR32EB28.build.mcu=avr32eb28
AVREB_noloader.menu.01_variant.AVR32EB28.build.variant=avr_eb28
AVREB_noloader.menu.01_variant.AVR32EB28.build.linker_script=avrxmega3_p64.x
AVREB_noloader.menu.01_variant.AVR32EB28.upload.maximum_data_size=3072
AVREB_noloader.menu.01_variant.AVR32EB28.upload.maximum_size=32768
AVREB_noloader.menu.01_variant.AVR32EB28=28pin AVR32EB28 (32KiB+3KiB)

AVREB_noloader.menu.01_variant.AVR16EB28.build.board=AVR_AVR16EB28
AVREB_noloader.menu.01_variant.AVR16EB28.build.mcu=avr16eb28
AVREB_noloader.menu.01_variant.AVR16EB28.build.variant=avr_eb28
AVREB_noloader.menu.01_variant.AVR16EB28.build.linker_script=avrxmega3_p64.x
AVREB_noloader.menu.01_variant.AVR16EB28.upload.maximum_data_size=2048
AVREB_noloader.menu.01_variant.AVR16EB28.upload.maximum_size=16384
AVREB_noloader.menu.01_variant.AVR16EB28=28pin AVR16EB28 (16KiB+2KiB)

AVREB_noloader.menu.01_variant.separator2=-

