askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVREB_noloader.menu.01_variant.AVR32EB20.build.board=AVR_AVR32EB20
AVREB_noloader.menu.01_variant.AVR32EB20.build.mcu=avr32eb20
AVREB_noloader.menu.01_variant.AVR32EB20.build.variant=avr_eb20
AVREB_noloader.menu.01_variant.AVR32EB20.build.linker_script=avrxmega3_p64.x
AVREB_noloader.menu.01_variant.AVR32EB20.upload.maximum_data_size=3072
AVREB_noloader.menu.01_variant.AVR32EB20.upload.maximum_size=32768
AVREB_noloader.menu.01_variant.AVR32EB20=20pin AVR32EB20 (32KiB+3KiB)

AVREB_noloader.menu.01_variant.AVR16EB20.build.board=AVR_AVR16EB20
AVREB_noloader.menu.01_variant.AVR16EB20.build.mcu=avr16eb20
AVREB_noloader.menu.01_variant.AVR16EB20.build.variant=avr_eb20
AVREB_noloader.menu.01_variant.AVR16EB20.build.linker_script=avrxmega3_p64.x
AVREB_noloader.menu.01_variant.AVR16EB20.upload.maximum_data_size=2048
AVREB_noloader.menu.01_variant.AVR16EB20.upload.maximum_size=16384
AVREB_noloader.menu.01_variant.AVR16EB20=20pin AVR16EB20 (16KiB+2KiB)

AVREB_noloader.menu.01_variant.separator3=-

AVREB_noloader.menu.01_variant.AVR32EB14.build.board=AVR_AVR32EB14
AVREB_noloader.menu.01_variant.AVR32EB14.build.mcu=avr32eb14
AVREB_noloader.menu.01_variant.AVR32EB14.build.variant=avr_eb14
AVREB_noloader.menu.01_variant.AVR32EB14.build.linker_script=avrxmega3_p64.x
AVREB_noloader.menu.01_variant.AVR32EB14.upload.maximum_data_size=3072
AVREB_noloader.menu.01_variant.AVR32EB14.upload.maximum_size=32768
AVREB_noloader.menu.01_variant.AVR32EB14=14pin AVR32EB14 (32KiB+3KiB)

AVREB_noloader.menu.01_variant.AVR16EB14.build.board=AVR_AVR16EB14
AVREB_noloader.menu.01_variant.AVR16EB14.build.mcu=avr16eb14
AVREB_noloader.menu.01_variant.AVR16EB14.build.variant=avr_eb14
AVREB_noloader.menu.01_variant.AVR16EB14.build.linker_script=avrxmega3_p64.x
AVREB_noloader.menu.01_variant.AVR16EB14.upload.maximum_data_size=2048
AVREB_noloader.menu.01_variant.AVR16EB14.upload.maximum_size=16384
AVREB_noloader.menu.01_variant.AVR16EB14=14pin AVR16EB14 (16KiB+2KiB)

AVREB_noloader.menu.03_clock.20MHz.bootloader.bod_sample=0
AVREB_noloader.menu.03_clock.20MHz.build.f_cpu=20000000L
AVREB_noloader.menu.03_clock.20MHz=Internal 20 MHz

AVREB_noloader.menu.03_clock.10MHz.bootloader.bod_sample=0
AVREB_noloader.menu.03_clock.10MHz.build.f_cpu=10000000L
AVREB_noloader.menu.03_clock.10MHz=Internal 10 MHz

AVREB_noloader.menu.03_clock.5MHz.bootloader.bod_sample=0
AVREB_noloader.menu.03_clock.5MHz.build.f_cpu=5000000L
AVREB_noloader.menu.03_clock.5MHz=Internal 5 MHz

AVREB_noloader.menu.03_clock.separator1=-

AVREB_noloader.menu.03_clock.16MHz.bootloader.OSCCFG=0b00001000
AVREB_noloader.menu.03_clock.16MHz.bootloader.bod_sample=0
AVREB_noloader.menu.03_clock.16MHz.build.f_cpu=16000000L
AVREB_noloader.menu.03_clock.16MHz=Internal 16 MHz

AVREB_noloader.menu.03_clock.8MHz.bootloader.OSCCFG=0b00001000
AVREB_noloader.menu.03_clock.8MHz.bootloader.bod_sample=0
AVREB_noloader.menu.03_clock.8MHz.build.f_cpu=8000000L
AVREB_noloader.menu.03_clock.8MHz=Internal 8 MHz

AVREB_noloader.menu.03_clock.4MHz.bootloader.OSCCFG=0b00001000
AVREB_noloader.menu.03_clock.4MHz.bootloader.bod_sample=0
AVREB_noloader.menu.03_clock.4MHz.build.f_cpu=4000000L
AVREB_noloader.menu.03_clock.4MHz=Internal 4 MHz

AVREB_noloader.menu.03_clock.1MHz.bootloader.OSCCFG=0b00001000
AVREB_noloader.menu.03_clock.1MHz.bootloader.bod_sample=0
AVREB_noloader.menu.03_clock.1MHz.build.f_cpu=1000000L
AVREB_noloader.menu.03_clock.1MHz=Internal 1 MHz

AVREB_noloader.menu.03_clock.separator2=-

AVREB_noloader.menu.03_clock.2MHz.bootloader.bod_sample=0
AVREB_noloader.menu.03_clock.2MHz.build.f_cpu=2000000L
AVREB_noloader.menu.03_clock.2MHz=Internal 2 MHz

AVREB_noloader.menu.03_clock.32768Hz.bootloader.bod_sample=1
AVREB_noloader.menu.03_clock.32768Hz.build.f_cpu=32768L
AVREB_noloader.menu.03_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVREB_noloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVREB_noloader.menu.11_BODMODE.Disabled=Disabled
# AVREB_noloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVREB_noloader.menu.11_BODMODE.Enabled=Enabled
# AVREB_noloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVREB_noloader.menu.11_BODMODE.Sampled=Sampled
# AVREB_noloader.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVREB_noloader.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVREB_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVREB_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.75V (default)
# AVREB_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVREB_noloader.menu.12_BODLVL.BODLEVEL1=Level 1.90V
# AVREB_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVREB_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.60V
# AVREB_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVREB_noloader.menu.12_BODLVL.BODLEVEL3=Level 4.30V

AVREB_noloader.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVREB_noloader.menu.21_resetpin.Reset=Reset

AVREB_noloader.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVREB_noloader.menu.21_resetpin.Gpio=GPIO (input only)

# AVREB_noloader.menu.22_updipin.Updi.bootloader.updi_bit=1
# AVREB_noloader.menu.22_updipin.Updi=PF7 pin=UPDI (default)

# AVREB_noloader.menu.22_updipin.Gpio.bootloader.updi_bit=0
# AVREB_noloader.menu.22_updipin.Gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)

AVREB_noloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVREB_noloader.menu.24_eeprom.Retained=Save guard "Retained"

AVREB_noloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVREB_noloader.menu.24_eeprom.Erase=Save guard "Erase"

AVREB_noloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVREB_noloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVREB_noloader.menu.24_eeprom.Upload=Upload ".eep" file

AVREB_noloader.menu.25_bootrow.Retained.bootloader.browsave_bit=1
AVREB_noloader.menu.25_bootrow.Retained=Save guard "Retained"

AVREB_noloader.menu.25_bootrow.Erase.bootloader.browsave_bit=0
AVREB_noloader.menu.25_bootrow.Erase=Save guard "Erase"

AVREB_noloader.menu.25_bootrow.Upload.bootloader.browupload={bootloader.bootrow}
AVREB_noloader.menu.25_bootrow.Upload=Upload ".brow" file

