askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVREB_noloader.menu.26_userrow.Retained=Save guard "Retained"

AVREB_noloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVREB_noloader.menu.26_userrow.Upload=Upload ".urow" file

AVREB_noloader.menu.27_fusefile.Menu=Specify in the MENU

AVREB_noloader.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
AVREB_noloader.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

AVREB_noloader.menu.51_buildopt.Release=Release (default)

AVREB_noloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVREB_noloader.menu.51_buildopt.Debug1=DEBUG=1

AVREB_noloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVREB_noloader.menu.51_buildopt.Debug2=DEBUG=2

AVREB_noloader.menu.52_macroapi.Enable=Macro API Enable (default)

AVREB_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVREB_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVREB_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVREB_noloader.menu.52_macroapi.Disable.build.macroapi=
AVREB_noloader.menu.52_macroapi.Disable=Macro API Disable

AVREB_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVREB_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVREB_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

AVREB_noloader.menu.53_printf.Default=Integer Only

AVREB_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVREB_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVREB_noloader.menu.53_printf.Full=Float Support

AVREB_noloader.menu.54_console_select.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVREB_noloader.menu.54_console_select.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVREB_noloader.menu.54_console_select.separator1=-

AVREB_noloader.menu.54_console_select.UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVREB_noloader.menu.54_console_select.UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3 (14pin)

AVREB_noloader.menu.54_console_select.separator2=-

AVREB_noloader.menu.54_console_select.UART0_C1_LF5_SF6_Curiosity=UART0 TX:PC1 RX:PC2 LED=PF5 SW=PF6 (AVR16EB32 Curiosity Nano)
AVREB_noloader.menu.54_console_select.UART0_C1_LF5_SF6_Curiosity.build.console_select=-DSerial=Serial0E -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6

AVREB_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVREB_noloader.menu.90_console_baud.9600bps=9600 bps (default)

AVREB_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVREB_noloader.menu.90_console_baud.38400bps=38400 bps

AVREB_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVREB_noloader.menu.90_console_baud.57600bps=57600 bps

AVREB_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVREB_noloader.menu.90_console_baud.115200bps=115200 bps

AVREB_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVREB_noloader.menu.90_console_baud.230400bps=230400 bps

AVREB_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVREB_noloader.menu.90_console_baud.500000bps=500000 bps

AVREB_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVREB_noloader.menu.90_console_baud.1000000bps=1000000 bps

AVREB_noloader.menu.90_console_baud.separator1=-

AVREB_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVREB_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)


AVRLA_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRLA_noloader.bootloader.OSCCFG=0x00
AVRLA_noloader.bootloader.PINCFG=0b000000{bootloader.updi_bit}{bootloader.reset_bit}
AVRLA_noloader.bootloader.HWMONCFG=0x00
AVRLA_noloader.bootloader.SYSCFG0=0b000000{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRLA_noloader.bootloader.SYSCFG1=0x07
AVRLA_noloader.bootloader.CODESIZE=0x00
AVRLA_noloader.bootloader.BOOTSIZE=0x00
AVRLA_noloader.bootloader.bod_lvl=000
AVRLA_noloader.bootloader.bod_mode=00
AVRLA_noloader.bootloader.bod_sample=0
AVRLA_noloader.bootloader.eepupload=
AVRLA_noloader.bootloader.browupload=
AVRLA_noloader.bootloader.urowupload=
AVRLA_noloader.bootloader.fuseupload={bootloader.fuses}
AVRLA_noloader.bootloader.eesave_bit=1
AVRLA_noloader.bootloader.browsave_bit=1
AVRLA_noloader.bootloader.reset_bit=1
AVRLA_noloader.bootloader.updi_bit=1
AVRLA_noloader.bootloader.tool=avrdude
AVRLA_noloader.bootloader.file=empty/empty.hex
AVRLA_noloader.bootloader.programed_type=
AVRLA_noloader.build.console_select=
AVRLA_noloader.build.export_merged_output=false
AVRLA_noloader.build.text_section_start=.text=0x0
AVRLA_noloader.build.buildopt=-DNDEBUG
AVRLA_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRLA_noloader.build.macroapi=-DENABLE_MACRO_API
AVRLA_noloader.build.printf=
AVRLA_noloader.build.printflt=
AVRLA_noloader.build.f_cpu=20000000L
AVRLA_noloader.compiler.ldflags=
AVRLA_noloader.compiler.c.elf.extra_flags=
AVRLA_noloader.upload.speed=115200
AVRLA_noloader.upload.tool=

AVRLA_noloader.menu.01_variant.AVR32LA32.build.board=AVR_AVR32LA32
AVRLA_noloader.menu.01_variant.AVR32LA32.build.mcu=avr32la32
AVRLA_noloader.menu.01_variant.AVR32LA32.build.variant=avr_la32
AVRLA_noloader.menu.01_variant.AVR32LA32.build.linker_script=avrxmega3_p64.x
AVRLA_noloader.menu.01_variant.AVR32LA32.upload.maximum_data_size=2048
AVRLA_noloader.menu.01_variant.AVR32LA32.upload.maximum_size=32768
AVRLA_noloader.menu.01_variant.AVR32LA32=32pin AVR32LA32 (32KiB+3KiB)

AVRLA_noloader.menu.01_variant.separator1=-

AVRLA_noloader.menu.01_variant.AVR32LA28.build.board=AVR_AVR32LA28
AVRLA_noloader.menu.01_variant.AVR32LA28.build.mcu=avr32la28
AVRLA_noloader.menu.01_variant.AVR32LA28.build.variant=avr_la28
AVRLA_noloader.menu.01_variant.AVR32LA28.build.linker_script=avrxmega3_p64.x
AVRLA_noloader.menu.01_variant.AVR32LA28.upload.maximum_data_size=2048
AVRLA_noloader.menu.01_variant.AVR32LA28.upload.maximum_size=32768
AVRLA_noloader.menu.01_variant.AVR32LA28=28pin AVR32LA28 (32KiB+3KiB)

AVRLA_noloader.menu.01_variant.separator2=-

