askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRLA_noloader.menu.01_variant.AVR32LA20.build.board=AVR_AVR32LA20
AVRLA_noloader.menu.01_variant.AVR32LA20.build.mcu=avr32la20
AVRLA_noloader.menu.01_variant.AVR32LA20.build.variant=avr_la20
AVRLA_noloader.menu.01_variant.AVR32LA20.build.linker_script=avrxmega3_p64.x
AVRLA_noloader.menu.01_variant.AVR32LA20.upload.maximum_data_size=2048
AVRLA_noloader.menu.01_variant.AVR32LA20.upload.maximum_size=32768
AVRLA_noloader.menu.01_variant.AVR32LA20=20pin AVR32LA20 (32KiB+3KiB)

AVRLA_noloader.menu.01_variant.separator3=-

AVRLA_noloader.menu.01_variant.AVR32LA14.build.board=AVR_AVR32LA14
AVRLA_noloader.menu.01_variant.AVR32LA14.build.mcu=avr32la14
AVRLA_noloader.menu.01_variant.AVR32LA14.build.variant=avr_la14
AVRLA_noloader.menu.01_variant.AVR32LA14.build.linker_script=avrxmega3_p64.x
AVRLA_noloader.menu.01_variant.AVR32LA14.upload.maximum_data_size=2048
AVRLA_noloader.menu.01_variant.AVR32LA14.upload.maximum_size=32768
AVRLA_noloader.menu.01_variant.AVR32LA14=14pin AVR32LA14 (32KiB+3KiB)

AVRLA_noloader.menu.03_clock.20MHz.bootloader.bod_sample=0
AVRLA_noloader.menu.03_clock.20MHz.build.f_cpu=20000000L
AVRLA_noloader.menu.03_clock.20MHz=Internal 20 MHz

AVRLA_noloader.menu.03_clock.10MHz.bootloader.bod_sample=0
AVRLA_noloader.menu.03_clock.10MHz.build.f_cpu=10000000L
AVRLA_noloader.menu.03_clock.10MHz=Internal 10 MHz

AVRLA_noloader.menu.03_clock.5MHz.bootloader.bod_sample=0
AVRLA_noloader.menu.03_clock.5MHz.build.f_cpu=5000000L
AVRLA_noloader.menu.03_clock.5MHz=Internal 5 MHz

AVRLA_noloader.menu.03_clock.separator1=-

AVRLA_noloader.menu.03_clock.16MHz.bootloader.OSCCFG=0b00001000
AVRLA_noloader.menu.03_clock.16MHz.bootloader.bod_sample=0
AVRLA_noloader.menu.03_clock.16MHz.build.f_cpu=16000000L
AVRLA_noloader.menu.03_clock.16MHz=Internal 16 MHz

AVRLA_noloader.menu.03_clock.8MHz.bootloader.OSCCFG=0b00001000
AVRLA_noloader.menu.03_clock.8MHz.bootloader.bod_sample=0
AVRLA_noloader.menu.03_clock.8MHz.build.f_cpu=8000000L
AVRLA_noloader.menu.03_clock.8MHz=Internal 8 MHz

AVRLA_noloader.menu.03_clock.4MHz.bootloader.OSCCFG=0b00001000
AVRLA_noloader.menu.03_clock.4MHz.bootloader.bod_sample=0
AVRLA_noloader.menu.03_clock.4MHz.build.f_cpu=4000000L
AVRLA_noloader.menu.03_clock.4MHz=Internal 4 MHz

AVRLA_noloader.menu.03_clock.1MHz.bootloader.OSCCFG=0b00001000
AVRLA_noloader.menu.03_clock.1MHz.bootloader.bod_sample=0
AVRLA_noloader.menu.03_clock.1MHz.build.f_cpu=1000000L
AVRLA_noloader.menu.03_clock.1MHz=Internal 1 MHz

AVRLA_noloader.menu.03_clock.separator2=-

AVRLA_noloader.menu.03_clock.2MHz.bootloader.bod_sample=0
AVRLA_noloader.menu.03_clock.2MHz.build.f_cpu=2000000L
AVRLA_noloader.menu.03_clock.2MHz=Internal 2 MHz

AVRLA_noloader.menu.03_clock.32768Hz.bootloader.bod_sample=1
AVRLA_noloader.menu.03_clock.32768Hz.build.f_cpu=32768L
AVRLA_noloader.menu.03_clock.32768Hz=Internal 32.768 kHz (ULP)

# AVRLA_noloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRLA_noloader.menu.11_BODMODE.Disabled=Disabled
# AVRLA_noloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRLA_noloader.menu.11_BODMODE.Enabled=Enabled
# AVRLA_noloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRLA_noloader.menu.11_BODMODE.Sampled=Sampled
# AVRLA_noloader.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRLA_noloader.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRLA_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRLA_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.65V (default)
# AVRLA_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRLA_noloader.menu.12_BODLVL.BODLEVEL1=Level 1.90V
# AVRLA_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRLA_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.60V
# AVRLA_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRLA_noloader.menu.12_BODLVL.BODLEVEL3=Level 4.30V

AVRLA_noloader.menu.21_resetpin.Reset.bootloader.reset_bit=1
AVRLA_noloader.menu.21_resetpin.Reset=Reset

AVRLA_noloader.menu.21_resetpin.Gpio.bootloader.reset_bit=0
AVRLA_noloader.menu.21_resetpin.Gpio=GPIO (input only)

# AVRLA_noloader.menu.22_updipin.Updi.bootloader.updi_bit=1
# AVRLA_noloader.menu.22_updipin.Updi=PF7 pin=UPDI (default)

# AVRLA_noloader.menu.22_updipin.Gpio.bootloader.updi_bit=0
# AVRLA_noloader.menu.22_updipin.Gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)

AVRLA_noloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRLA_noloader.menu.24_eeprom.Retained=Save guard "Retained"

AVRLA_noloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRLA_noloader.menu.24_eeprom.Erase=Save guard "Erase"

AVRLA_noloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRLA_noloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRLA_noloader.menu.24_eeprom.Upload=Upload ".eep" file

AVRLA_noloader.menu.25_bootrow.Retained.bootloader.browsave_bit=1
AVRLA_noloader.menu.25_bootrow.Retained=Save guard "Retained"

AVRLA_noloader.menu.25_bootrow.Erase.bootloader.browsave_bit=0
AVRLA_noloader.menu.25_bootrow.Erase=Save guard "Erase"

AVRLA_noloader.menu.25_bootrow.Upload.bootloader.browupload={bootloader.bootrow}
AVRLA_noloader.menu.25_bootrow.Upload=Upload ".brow" file

AVRLA_noloader.menu.26_userrow.Retained=Save guard "Retained"

AVRLA_noloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRLA_noloader.menu.26_userrow.Upload=Upload ".urow" file

AVRLA_noloader.menu.27_fusefile.Menu=Specify in the MENU

AVRLA_noloader.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
AVRLA_noloader.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

AVRLA_noloader.menu.51_buildopt.Release=Release (default)

AVRLA_noloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRLA_noloader.menu.51_buildopt.Debug1=DEBUG=1

AVRLA_noloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRLA_noloader.menu.51_buildopt.Debug2=DEBUG=2

AVRLA_noloader.menu.52_macroapi.Enable=Macro API Enable (default)

AVRLA_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRLA_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRLA_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRLA_noloader.menu.52_macroapi.Disable.build.macroapi=
AVRLA_noloader.menu.52_macroapi.Disable=Macro API Disable

AVRLA_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRLA_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRLA_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRLA_noloader.menu.53_printf.Default=Integer Only

AVRLA_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRLA_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRLA_noloader.menu.53_printf.Full=Float Support

