askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRLA_noloader.menu.54_console_select.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRLA_noloader.menu.54_console_select.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRLA_noloader.menu.54_console_select.separator1=-

AVRLA_noloader.menu.54_console_select.UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVRLA_noloader.menu.54_console_select.UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3

AVRLA_noloader.menu.54_console_select.separator2=-

AVRLA_noloader.menu.54_console_select.UART0_C1_LF5_SC0_Curiosity=UART0 TX:PC1 RX:PC2 LED=PF5 SW=PC0 (AVR32LA32 Curiosity Nano)
AVRLA_noloader.menu.54_console_select.UART0_C1_LF5_SC0_Curiosity.build.console_select=-DSerial=Serial0E -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PC0

AVRLA_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRLA_noloader.menu.90_console_baud.9600bps=9600 bps (default)

AVRLA_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRLA_noloader.menu.90_console_baud.38400bps=38400 bps

AVRLA_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRLA_noloader.menu.90_console_baud.57600bps=57600 bps

AVRLA_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRLA_noloader.menu.90_console_baud.115200bps=115200 bps

AVRLA_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRLA_noloader.menu.90_console_baud.230400bps=230400 bps

AVRLA_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRLA_noloader.menu.90_console_baud.500000bps=500000 bps

AVRLA_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRLA_noloader.menu.90_console_baud.1000000bps=1000000 bps

AVRLA_noloader.menu.90_console_baud.separator1=-

AVRLA_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRLA_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)


AVRSD_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRSD_noloader.bootloader.OSCCFG=0x00
AVRSD_noloader.bootloader.PINCFG=0x00
AVRSD_noloader.bootloader.HWMONCFG=0x00
AVRSD_noloader.bootloader.SYSCFG0=0b000000{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRSD_noloader.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRSD_noloader.bootloader.CODESIZE=0x00
AVRSD_noloader.bootloader.BOOTSIZE=0x00
AVRSD_noloader.bootloader.bod_lvl=000
AVRSD_noloader.bootloader.bod_mode=00
AVRSD_noloader.bootloader.bod_sample=0
AVRSD_noloader.bootloader.eepupload=
AVRSD_noloader.bootloader.browupload=
AVRSD_noloader.bootloader.urowupload=
AVRSD_noloader.bootloader.fuseupload={bootloader.fuses}
AVRSD_noloader.bootloader.eesave_bit=1
AVRSD_noloader.bootloader.browsave_bit=1
AVRSD_noloader.bootloader.mvsys_bit=01
AVRSD_noloader.bootloader.tool=avrdude
AVRSD_noloader.bootloader.file=empty/empty.hex
AVRSD_noloader.bootloader.programed_type=
AVRSD_noloader.build.console_select=
AVRSD_noloader.build.export_merged_output=false
AVRSD_noloader.build.text_section_start=.text=0x0
AVRSD_noloader.build.buildopt=-DNDEBUG
AVRSD_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRSD_noloader.build.macroapi=-DENABLE_MACRO_API
AVRSD_noloader.build.printf=
AVRSD_noloader.build.printflt=
AVRSD_noloader.build.f_cpu=20000000L
AVRSD_noloader.compiler.ldflags=
AVRSD_noloader.compiler.c.elf.extra_flags=
AVRSD_noloader.upload.speed=115200
AVRSD_noloader.upload.tool=

AVRSD_noloader.menu.01_variant.AVR32SD32.build.board=AVR_AVR32SD32
AVRSD_noloader.menu.01_variant.AVR32SD32.build.mcu=avr32sd32
AVRSD_noloader.menu.01_variant.AVR32SD32.build.variant=avr_sd32
AVRSD_noloader.menu.01_variant.AVR32SD32.build.linker_script=avrxmega3_p512.x
AVRSD_noloader.menu.01_variant.AVR32SD32.upload.maximum_data_size=4096
AVRSD_noloader.menu.01_variant.AVR32SD32.upload.maximum_size=32768
AVRSD_noloader.menu.01_variant.AVR32SD32=32pin AVR32SD32 (32KiB+4KiB)

AVRSD_noloader.menu.01_variant.separator1=-

AVRSD_noloader.menu.01_variant.AVR32SD28.build.board=AVR_AVR32SD28
AVRSD_noloader.menu.01_variant.AVR32SD28.build.mcu=avr32sd28
AVRSD_noloader.menu.01_variant.AVR32SD28.build.variant=avr_sd28
AVRSD_noloader.menu.01_variant.AVR32SD28.build.linker_script=avrxmega3_p512.x
AVRSD_noloader.menu.01_variant.AVR32SD28.upload.maximum_data_size=4096
AVRSD_noloader.menu.01_variant.AVR32SD28.upload.maximum_size=32768
AVRSD_noloader.menu.01_variant.AVR32SD28=28pin AVR32SD28 (32KiB+4KiB)

AVRSD_noloader.menu.01_variant.separator2=-

AVRSD_noloader.menu.01_variant.AVR32SD20.build.board=AVR_AVR32SD20
AVRSD_noloader.menu.01_variant.AVR32SD20.build.mcu=avr32sd20
AVRSD_noloader.menu.01_variant.AVR32SD20.build.variant=avr_sd20
AVRSD_noloader.menu.01_variant.AVR32SD20.build.linker_script=avrxmega3_p512.x
AVRSD_noloader.menu.01_variant.AVR32SD20.upload.maximum_data_size=4096
AVRSD_noloader.menu.01_variant.AVR32SD20.upload.maximum_size=32768
AVRSD_noloader.menu.01_variant.AVR32SD20=20pin AVR32SD20 (32KiB+4KiB)

AVRSD_noloader.menu.04_clock.20MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.20MHz.build.f_cpu=20000000L
AVRSD_noloader.menu.04_clock.20MHz=Internal 20 MHz

AVRSD_noloader.menu.04_clock.10MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.10MHz.build.f_cpu=10000000L
AVRSD_noloader.menu.04_clock.10MHz=Internal 10 MHz

AVRSD_noloader.menu.04_clock.5MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.5MHz.build.f_cpu=5000000L
AVRSD_noloader.menu.04_clock.5MHz=Internal 5 MHz

AVRSD_noloader.menu.04_clock.separator1=-

AVRSD_noloader.menu.04_clock.16MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.16MHz.build.f_cpu=16000000L
AVRSD_noloader.menu.04_clock.16MHz=Internal 16 MHz

AVRSD_noloader.menu.04_clock.8MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.8MHz.build.f_cpu=8000000L
AVRSD_noloader.menu.04_clock.8MHz=Internal 8 MHz

AVRSD_noloader.menu.04_clock.4MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.4MHz.build.f_cpu=4000000L
AVRSD_noloader.menu.04_clock.4MHz=Internal 4 MHz

