askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRSD_noloader.menu.04_clock.separator2=-

AVRSD_noloader.menu.04_clock.12MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.12MHz.build.f_cpu=12000000L
AVRSD_noloader.menu.04_clock.12MHz=Internal 12 MHz

AVRSD_noloader.menu.04_clock.6MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.6MHz.build.f_cpu=6000000L
AVRSD_noloader.menu.04_clock.6MHz=Internal 6 MHz

AVRSD_noloader.menu.04_clock.3MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.3MHz.build.f_cpu=3000000L
AVRSD_noloader.menu.04_clock.3MHz=Internal 3 MHz

AVRSD_noloader.menu.04_clock.2MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.2MHz.build.f_cpu=2000000L
AVRSD_noloader.menu.04_clock.2MHz=Internal 2 MHz

AVRSD_noloader.menu.04_clock.1MHz.bootloader.bod_sample=0
AVRSD_noloader.menu.04_clock.1MHz.build.f_cpu=1000000L
AVRSD_noloader.menu.04_clock.1MHz=Internal 1 MHz

# AVRSD_noloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# AVRSD_noloader.menu.11_BODMODE.Disabled=Disabled
# AVRSD_noloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# AVRSD_noloader.menu.11_BODMODE.Enabled=Enabled
# AVRSD_noloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# AVRSD_noloader.menu.11_BODMODE.Sampled=Sampled
# AVRSD_noloader.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# AVRSD_noloader.menu.11_BODMODE.EnableWait=Enabled hold wakeup

# AVRSD_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRSD_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRSD_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRSD_noloader.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRSD_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRSD_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRSD_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRSD_noloader.menu.12_BODLVL.BODLEVEL3=Level 2.85V

AVRSD_noloader.menu.23_mvsyscfg.Dual.bootloader.mvsys_bit=01
AVRSD_noloader.menu.23_mvsyscfg.Dual="Dual" (default)

AVRSD_noloader.menu.23_mvsyscfg.Single.bootloader.mvsys_bit=10
AVRSD_noloader.menu.23_mvsyscfg.Single="Single"

AVRSD_noloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
AVRSD_noloader.menu.24_eeprom.Retained=Save guard "Retained"

AVRSD_noloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
AVRSD_noloader.menu.24_eeprom.Erase=Save guard "Erase"

AVRSD_noloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
AVRSD_noloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
AVRSD_noloader.menu.24_eeprom.Upload=Upload ".eep" file

AVRSD_noloader.menu.25_bootrow.Retained.bootloader.browsave_bit=1
AVRSD_noloader.menu.25_bootrow.Retained=Save guard "Retained"

AVRSD_noloader.menu.25_bootrow.Erase.bootloader.browsave_bit=0
AVRSD_noloader.menu.25_bootrow.Erase=Save guard "Erase"

AVRSD_noloader.menu.25_bootrow.Upload.bootloader.browupload={bootloader.bootrow}
AVRSD_noloader.menu.25_bootrow.Upload=Upload ".brow" file

AVRSD_noloader.menu.26_userrow.Retained=Save guard "Retained"

AVRSD_noloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
AVRSD_noloader.menu.26_userrow.Upload=Upload ".urow" file

AVRSD_noloader.menu.27_fusefile.Menu=Specify in the MENU

AVRSD_noloader.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
AVRSD_noloader.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

AVRSD_noloader.menu.51_buildopt.Release=Release (default)

AVRSD_noloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
AVRSD_noloader.menu.51_buildopt.Debug1=DEBUG=1

AVRSD_noloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
AVRSD_noloader.menu.51_buildopt.Debug2=DEBUG=2

AVRSD_noloader.menu.52_macroapi.Enable=Macro API Enable (default)

AVRSD_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
AVRSD_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
AVRSD_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

AVRSD_noloader.menu.52_macroapi.Disable.build.macroapi=
AVRSD_noloader.menu.52_macroapi.Disable=Macro API Disable

AVRSD_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
AVRSD_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRSD_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

AVRSD_noloader.menu.53_printf.Default=Integer Only

AVRSD_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
AVRSD_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRSD_noloader.menu.53_printf.Full=Float Support

AVRSD_noloader.menu.54_console_select.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRSD_noloader.menu.54_console_select.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

AVRSD_noloader.menu.54_console_select.separator1=-

AVRSD_noloader.menu.54_console_select.UART1_D6_LC3.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PC3
AVRSD_noloader.menu.54_console_select.UART1_D6_LC3=UART1 TX:PD6 RX:PD7 LED=PC3

AVRSD_noloader.menu.54_console_select.separator1=-

AVRSD_noloader.menu.54_console_select.UART0_D4_LD2_SF2_Curiosity=UART0 TX:PD4 RX:PD5 LED0=PD2 LED1=PF5 SW=PF2 (AVR32SD32 Curiosity Nano)
AVRSD_noloader.menu.54_console_select.UART0_D4_LD2_SF2_Curiosity.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PD2 -DLED1_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF2

AVRSD_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRSD_noloader.menu.90_console_baud.9600bps=9600 bps (default)

AVRSD_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRSD_noloader.menu.90_console_baud.38400bps=38400 bps

AVRSD_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRSD_noloader.menu.90_console_baud.57600bps=57600 bps

AVRSD_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRSD_noloader.menu.90_console_baud.115200bps=115200 bps

AVRSD_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRSD_noloader.menu.90_console_baud.230400bps=230400 bps

AVRSD_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRSD_noloader.menu.90_console_baud.500000bps=500000 bps

AVRSD_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRSD_noloader.menu.90_console_baud.1000000bps=1000000 bps

AVRSD_noloader.menu.90_console_baud.separator1=-

AVRSD_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRSD_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)


