askn37/multix-zinnia-sdk-modernAVR/boards.txt
CNANO.bootloader.WDTCFG=0x00
CNANO.bootloader.BODCFG=0x00
CNANO.bootloader.OSCCFG=0x00
CNANO.bootloader.PINCFG=0x00
CNANO.bootloader.HWMONCFG=0x00
CNANO.bootloader.SYSCFG0=0b11011011
CNANO.bootloader.SYSCFG1=0x07
CNANO.bootloader.CODESIZE=0x00
CNANO.bootloader.BOOTSIZE=0x00
CNANO.bootloader.eepupload=
CNANO.bootloader.browupload=
CNANO.bootloader.urowupload=
CNANO.bootloader.fuseupload={bootloader.fuses}
CNANO.bootloader.eesave_bit=1
CNANO.bootloader.reset_bit=1
CNANO.bootloader.tool=avrdude
CNANO.bootloader.file=empty/empty.hex
CNANO.bootloader.programed_type=
CNANO.build.console_select=
CNANO.build.export_merged_output=false
CNANO.build.text_section_start=.text=0x0
CNANO.build.buildopt=-DNDEBUG
CNANO.build.console_baud=-DCONSOLE_BAUD=115200
CNANO.build.macroapi=-DENABLE_MACRO_API
CNANO.build.printf=
CNANO.build.printflt=
CNANO.build.f_cpu=24000000L
CNANO.build.SYSCFG0_R=0b11011011
CNANO.build.SYSCFG0_G=0b11010011
CNANO.build.PINCFG_R=0x00
CNANO.build.PINCFG_G=0x00
CNANO.compiler.ldflags=
CNANO.compiler.c.elf.extra_flags=
CNANO.upload.speed=115200
CNANO.upload.tool=

CNANO.menu.01_variant.AVR128DA48=DM164151 AVR128DA48 24MHz UART1 TX:PC0 RX:PC1 LED=PC6 SW=PC7
CNANO.menu.01_variant.AVR128DA48.build.board=AVR_AVR128DA48
CNANO.menu.01_variant.AVR128DA48.build.mcu=avr128da48
CNANO.menu.01_variant.AVR128DA48.build.variant=avr_da48
CNANO.menu.01_variant.AVR128DA48.build.f_cpu=24000000L
CNANO.menu.01_variant.AVR128DA48.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PC6 -DSW_BUILTIN=PIN_PC7
CNANO.menu.01_variant.AVR128DA48.build.SYSCFG0_R=0b11001001
CNANO.menu.01_variant.AVR128DA48.build.SYSCFG0_G=0b11000001
CNANO.menu.01_variant.AVR128DA48.build.linker_script=avrxmega4_p512.x
CNANO.menu.01_variant.AVR128DA48.upload.maximum_data_size=16384
CNANO.menu.01_variant.AVR128DA48.upload.maximum_size=131072

CNANO.menu.01_variant.AVR128DB48=EV35L43A AVR128DB48 24MHz UART3 TX:PB0 RX:PB1 LED=PB3 SW=PB2
CNANO.menu.01_variant.AVR128DB48.build.board=AVR_AVR128DB48
CNANO.menu.01_variant.AVR128DB48.build.mcu=avr128db48
CNANO.menu.01_variant.AVR128DB48.build.variant=avr_db48
CNANO.menu.01_variant.AVR128DB48.build.f_cpu=24000000L
CNANO.menu.01_variant.AVR128DB48.build.console_select=-DSerial=Serial3A -DLED_BUILTIN=PIN_PB3 -DSW_BUILTIN=PIN_PB2
CNANO.menu.01_variant.AVR128DB48.build.SYSCFG0_R=0b11001001
CNANO.menu.01_variant.AVR128DB48.build.SYSCFG0_G=0b11000001
CNANO.menu.01_variant.AVR128DB48.build.SYSCFG1=0x0F
CNANO.menu.01_variant.AVR128DB48.build.linker_script=avrxmega4_p512.x
CNANO.menu.01_variant.AVR128DB48.upload.maximum_data_size=16384
CNANO.menu.01_variant.AVR128DB48.upload.maximum_size=131072

CNANO.menu.01_variant.AVR64DD32=EV72Y42A AVR64DD32 24MHz UART0 TX:PD4 RX:PD5 LED=PF5 SW=PF6
CNANO.menu.01_variant.AVR64DD32.build.board=AVR_AVR64DD32
CNANO.menu.01_variant.AVR64DD32.build.mcu=avr64dd32
CNANO.menu.01_variant.AVR64DD32.build.variant=avr_dd32
CNANO.menu.01_variant.AVR64DD32.build.f_cpu=24000000L
CNANO.menu.01_variant.AVR64DD32.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6
CNANO.menu.01_variant.AVR64DD32.build.SYSCFG0_R=0b11011001
CNANO.menu.01_variant.AVR64DD32.build.SYSCFG0_G=0b11010001
CNANO.menu.01_variant.AVR64DD32.build.SYSCFG1=0x0F
CNANO.menu.01_variant.AVR64DD32.bootloader.reset_bit=0
CNANO.menu.01_variant.AVR64DD32.build.linker_script=avrxmega2_p512.x
CNANO.menu.01_variant.AVR64DD32.upload.maximum_data_size=8192
CNANO.menu.01_variant.AVR64DD32.upload.maximum_size=65536

CNANO.menu.01_variant.AVR64DU32=EV59F82A AVR64DU32 20MHz UART1 TX:PD6 RX:PD7 LED=PF2 SW=PF6
CNANO.menu.01_variant.AVR64DU32.build.board=AVR_AVR64DU32
CNANO.menu.01_variant.AVR64DU32.build.mcu=avr64du32
CNANO.menu.01_variant.AVR64DU32.build.variant=avr_du32
CNANO.menu.01_variant.AVR64DU32.build.f_cpu=20000000L
CNANO.menu.01_variant.AVR64DU32.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PF2 -DSW_BUILTIN=PIN_PF6
CNANO.menu.01_variant.AVR64DU32.build.SYSCFG0_R=0b11011001
CNANO.menu.01_variant.AVR64DU32.build.SYSCFG0_G=0b11010001
CNANO.menu.01_variant.AVR64DU32.build.SYSCFG1=0x0F
CNANO.menu.01_variant.AVR64DU32.bootloader.reset_bit=0
CNANO.menu.01_variant.AVR64DU32.build.linker_script=avrxmega2_p512.x
CNANO.menu.01_variant.AVR64DU32.upload.maximum_data_size=8192
CNANO.menu.01_variant.AVR64DU32.upload.maximum_size=65536

CNANO.menu.01_variant.AVR64EA48=EV66E56A AVR64EA48 20MHz UART1 TX:PC0 RX:PC1 LED=PB3 SW=PB2
CNANO.menu.01_variant.AVR64EA48.build.board=AVR_AVR64EA48
CNANO.menu.01_variant.AVR64EA48.build.mcu=avr64ea48
CNANO.menu.01_variant.AVR64EA48.build.variant=avr_ea48
CNANO.menu.01_variant.AVR64EA48.build.f_cpu=20000000L
CNANO.menu.01_variant.AVR64EA48.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PB3 -DSW_BUILTIN=PIN_PB2
CNANO.menu.01_variant.AVR64EA48.build.SYSCFG0_R=0b11011001
CNANO.menu.01_variant.AVR64EA48.build.SYSCFG0_G=0b11010001
CNANO.menu.01_variant.AVR64EA48.build.linker_script=avrxmega2_p128.x
CNANO.menu.01_variant.AVR64EA48.upload.maximum_data_size=8192
CNANO.menu.01_variant.AVR64EA48.upload.maximum_size=65536

CNANO.menu.01_variant.AVR16EB32=EV73J36A AVR16EB32 20MHz UART0 TX:PC1 RX:PC2 LED=PF5 SW=PF6
CNANO.menu.01_variant.AVR16EB32.build.board=AVR_AVR16EB32
CNANO.menu.01_variant.AVR16EB32.build.mcu=avr16eb32
CNANO.menu.01_variant.AVR16EB32.build.variant=avr_eb32
CNANO.menu.01_variant.AVR16EB32.build.f_cpu=20000000L
CNANO.menu.01_variant.AVR16EB32.build.console_select=-DSerial=Serial0E -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6
CNANO.menu.01_variant.AVR16EB32.build.SYSCFG0_R=0b11011011
CNANO.menu.01_variant.AVR16EB32.build.SYSCFG0_G=0b11010011
CNANO.menu.01_variant.AVR16EB32.build.PINCFG_R=0xFF
CNANO.menu.01_variant.AVR16EB32.build.PINCFG_G=0xFF
CNANO.menu.01_variant.AVR16EB32.bootloader.HWMONCFG=0xFF
CNANO.menu.01_variant.AVR64EB32.bootloader.reset_bit=0
CNANO.menu.01_variant.AVR16EB32.build.linker_script=avrxmega3_p64.x
CNANO.menu.01_variant.AVR16EB32.upload.maximum_data_size=2048
CNANO.menu.01_variant.AVR16EB32.upload.maximum_size=16384

CNANO.menu.01_variant.AVR32LA32=EV24D63A AVR32LA32 20MHz UART0 TX:PC1 RX:PC2 LED=PF5 SW=PC0
CNANO.menu.01_variant.AVR32LA32.build.board=AVR_AVR32LA32
CNANO.menu.01_variant.AVR32LA32.build.mcu=avr32la32
CNANO.menu.01_variant.AVR32LA32.build.variant=avr_la32
CNANO.menu.01_variant.AVR32LA32.build.f_cpu=20000000L
CNANO.menu.01_variant.AVR32LA32.build.console_select=-DSerial=Serial0E -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PC0
CNANO.menu.01_variant.AVR32LA32.build.SYSCFG0_R=0b00000011
CNANO.menu.01_variant.AVR32LA32.build.SYSCFG0_G=0b00000011
CNANO.menu.01_variant.AVR32LA32.build.PINCFG_R=0b00000011
CNANO.menu.01_variant.AVR32LA32.build.PINCFG_G=0b00000010
CNANO.menu.01_variant.AVR32LA32.build.linker_script=avrxmega3_p64.x
CNANO.menu.01_variant.AVR32LA32.upload.maximum_data_size=2048
CNANO.menu.01_variant.AVR32LA32.upload.maximum_size=32768

CNANO.menu.01_variant.AVR32SD32=EV75S16A AVR32SD32 20MHz UART0 TX:PD4 RX:PD5 LED0=PD2 LED1=PF5 SW=PF2
CNANO.menu.01_variant.AVR32SD32.build.board=AVR_AVR32SD32
CNANO.menu.01_variant.AVR32SD32.build.mcu=avr32sd32
CNANO.menu.01_variant.AVR32SD32.build.variant=avr_sd32
CNANO.menu.01_variant.AVR32SD32.build.f_cpu=20000000L
CNANO.menu.01_variant.AVR32SD32.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PD2 -DLED1_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF2
CNANO.menu.01_variant.AVR32SD32.build.SYSCFG0_R=0b00000011
CNANO.menu.01_variant.AVR32SD32.build.SYSCFG0_G=0b00000011
CNANO.menu.01_variant.AVR32SD32.build.SYSCFG1=0x0F
CNANO.menu.01_variant.AVR32SD32.build.linker_script=avrxmega3_p512.x
CNANO.menu.01_variant.AVR32SD32.upload.maximum_data_size=4098
CNANO.menu.01_variant.AVR32SD32.upload.maximum_size=32768

CNANO.menu.24_eeprom.Retained=Save guard "Retained"

CNANO.menu.24_eeprom.Upload=Upload ".eep" file
CNANO.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}

CNANO.menu.25_bootrow.Retained=Save guard "Retained"

CNANO.menu.25_bootrow.Upload=Upload ".brow" file (for DU/EB/LA/SD)
CNANO.menu.25_bootrow.Upload.bootloader.browupload={bootloader.bootrow}

CNANO.menu.26_userrow.Retained=Save guard "Retained"

CNANO.menu.26_userrow.Upload=Upload ".urow" file
CNANO.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}

