askn37/multix-zinnia-sdk-modernAVR/boards.txt
CNANO.menu.21_resetpin.Reset=Reset
CNANO.menu.21_resetpin.Reset.bootloader.reset_bit=1
CNANO.menu.21_resetpin.Reset.bootloader.SYSCFG0={build.SYSCFG0_R}
CNANO.menu.21_resetpin.Reset.bootloader.PINCFG={build.PINCFG_R}

CNANO.menu.21_resetpin.Gpio=GPIO (input only)
CNANO.menu.21_resetpin.Gpio.bootloader.reset_bit=0
CNANO.menu.21_resetpin.Gpio.bootloader.SYSCFG0={build.SYSCFG0_G}
CNANO.menu.21_resetpin.Gpio.bootloader.PINCFG={build.PINCFG_G}

CNANO.menu.27_fusefile.Menu=Specify in the MENU
CNANO.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)
CNANO.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}

CNANO.menu.51_buildopt.Release=Release (default)

CNANO.menu.51_buildopt.Debug1=DEBUG=1
CNANO.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1

CNANO.menu.51_buildopt.Debug2=DEBUG=2
CNANO.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2

CNANO.menu.52_macroapi.Enable=Macro API Enable (default)

CNANO.menu.52_macroapi.WoStartup=Macro API Enable without startup
CNANO.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
CNANO.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles

CNANO.menu.52_macroapi.Disable=Macro API Disable
CNANO.menu.52_macroapi.Disable.build.macroapi=

CNANO.menu.52_macroapi.AllDisable=Standard Library All Disable
CNANO.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
CNANO.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib

CNANO.menu.53_printf.Default=Integer Only

CNANO.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
CNANO.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
CNANO.menu.53_printf.Full=Float Support

CNANO.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
CNANO.menu.90_console_baud.115200bps=115200 bps (default)

CNANO.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
CNANO.menu.90_console_baud.230400bps=230400 bps

CNANO.menu.90_console_baud.460800bps.build.console_baud=-DCONSOLE_BAUD=460800
CNANO.menu.90_console_baud.460800bps=460800 bps

CNANO.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
CNANO.menu.90_console_baud.9600bps=9600 bps

CNANO.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
CNANO.menu.90_console_baud.38400bps=38400 bps

CNANO.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
CNANO.menu.90_console_baud.57600bps=57600 bps

CNANO.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
CNANO.menu.90_console_baud.500000bps=500000 bps

CNANO.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
CNANO.menu.90_console_baud.1000000bps=1000000 bps
